TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:19 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../include/hal/hal.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SCI_clearRxFifoOvf")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SCI_clearRxFifoOvf")
      16                      .dwattr $C$DW$1, DW_AT_declaration

   12294                      .dwattr $C$DW$T$411, DW_AT_type(*$C$DW$2159)
   12295              
   12296              $C$DW$T$412     .dwtag  DW_TAG_enumeration_type
   12297                      .dwattr $C$DW$T$412, DW_AT_byte_size(0x01)
   12298              $C$DW$2160      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
   12299              $C$DW$2161      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
   12300                      .dwendtag $C$DW$T$412
   12301              
   12302              $C$DW$T$413     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
   12303                      .dwattr $C$DW$T$413, DW_AT_type(*$C$DW$T$412)
   12304                      .dwattr $C$DW$T$413, DW_AT_language(DW_LANG_C)
   12305              $C$DW$2162      .dwtag  DW_TAG_TI_far_type
   12306                      .dwattr $C$DW$2162, DW_AT_type(*$C$DW$T$413)
   12307              $C$DW$T$414     .dwtag  DW_TAG_const_type
   12308                      .dwattr $C$DW$T$414, DW_AT_type(*$C$DW$2162)
   12309              
   12310              $C$DW$T$415     .dwtag  DW_TAG_enumeration_type
   12311                      .dwattr $C$DW$T$415, DW_AT_byte_size(0x01)
   12312              $C$DW$2163      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
   12313              $C$DW$2164      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
   12314                      .dwendtag $C$DW$T$415
   12315              
   12316              $C$DW$T$416     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
   12317                      .dwattr $C$DW$T$416, DW_AT_type(*$C$DW$T$415)
   12318                      .dwattr $C$DW$T$416, DW_AT_language(DW_LANG_C)
   12319              $C$DW$2165      .dwtag  DW_TAG_TI_far_type
   12320                      .dwattr $C$DW$2165, DW_AT_type(*$C$DW$T$416)
   12321              $C$DW$T$417     .dwtag  DW_TAG_const_type
   12322                      .dwattr $C$DW$T$417, DW_AT_type(*$C$DW$2165)
   12323              
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  236

   12324              $C$DW$T$418     .dwtag  DW_TAG_enumeration_type
   12325                      .dwattr $C$DW$T$418, DW_AT_byte_size(0x01)
   12326              $C$DW$2166      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
   12327              $C$DW$2167      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
   12328                      .dwendtag $C$DW$T$418
   12329              
   12330              $C$DW$T$419     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
   12331                      .dwattr $C$DW$T$419, DW_AT_type(*$C$DW$T$418)
   12332                      .dwattr $C$DW$T$419, DW_AT_language(DW_LANG_C)
   12333              $C$DW$2168      .dwtag  DW_TAG_TI_far_type
   12334                      .dwattr $C$DW$2168, DW_AT_type(*$C$DW$T$419)
   12335              $C$DW$T$420     .dwtag  DW_TAG_const_type
   12336                      .dwattr $C$DW$T$420, DW_AT_type(*$C$DW$2168)
   12337              
   12338              $C$DW$T$421     .dwtag  DW_TAG_enumeration_type
   12339                      .dwattr $C$DW$T$421, DW_AT_byte_size(0x01)
   12340              $C$DW$2169      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_Empty"), DW_AT_const_value(0x00)
   12341              $C$DW$2170      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
   12342              $C$DW$2171      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
   12343              $C$DW$2172      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
   12344              $C$DW$2173      .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
   12345                      .dwendtag $C$DW$T$421
   12346              
   12347              $C$DW$T$422     .dwtag  DW_TAG_typedef, DW_AT_name("SCI_FifoLevel_e")
   12348                      .dwattr $C$DW$T$422, DW_AT_type(*$C$DW$T$421)
   12349                      .dwattr $C$DW$T$422, DW_AT_language(DW_LANG_C)
   12350              $C$DW$2174      .dwtag  DW_TAG_TI_far_type
   12351                      .dwattr $C$DW$2174, DW_AT_type(*$C$DW$T$422)
   12352              $C$DW$T$423     .dwtag  DW_TAG_const_type
   12353                      .dwattr $C$DW$T$423, DW_AT_type(*$C$DW$2174)
   12354              
   12355              $C$DW$T$424     .dwtag  DW_TAG_enumeration_type
   12356                      .dwattr $C$DW$T$424, DW_AT_byte_size(0x01)
   12357              $C$DW$2175      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
   12358              $C$DW$2176      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
   12359                      .dwendtag $C$DW$T$424
   12360              
   12361              $C$DW$T$425     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
   12362                      .dwattr $C$DW$T$425, DW_AT_type(*$C$DW$T$424)
   12363                      .dwattr $C$DW$T$425, DW_AT_language(DW_LANG_C)
   12364              
   12365              $C$DW$T$29      .dwtag  DW_TAG_structure_type
   12366                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
   12367                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
   12368              $C$DW$2177      .dwtag  DW_TAG_member
   12369                      .dwattr $C$DW$2177, DW_AT_type(*$C$DW$T$23)
   12370                      .dwattr $C$DW$2177, DW_AT_name("ADCRESULT")
   12371                      .dwattr $C$DW$2177, DW_AT_TI_symbol_name("_ADCRESULT")
   12372                      .dwattr $C$DW$2177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12373                      .dwattr $C$DW$2177, DW_AT_accessibility(DW_ACCESS_public)
   12374              $C$DW$2178      .dwtag  DW_TAG_member
   12375                      .dwattr $C$DW$2178, DW_AT_type(*$C$DW$T$24)
   12376                      .dwattr $C$DW$2178, DW_AT_name("resvd_1")
   12377                      .dwattr $C$DW$2178, DW_AT_TI_symbol_name("_resvd_1")
   12378                      .dwattr $C$DW$2178, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  237

   12379                      .dwattr $C$DW$2178, DW_AT_accessibility(DW_ACCESS_public)
   12380              $C$DW$2179      .dwtag  DW_TAG_member
   12381                      .dwattr $C$DW$2179, DW_AT_type(*$C$DW$T$22)
   12382                      .dwattr $C$DW$2179, DW_AT_name("ADCCTL1")
   12383                      .dwattr $C$DW$2179, DW_AT_TI_symbol_name("_ADCCTL1")
   12384                      .dwattr $C$DW$2179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
   12385                      .dwattr $C$DW$2179, DW_AT_accessibility(DW_ACCESS_public)
   12386              $C$DW$2180      .dwtag  DW_TAG_member
   12387                      .dwattr $C$DW$2180, DW_AT_type(*$C$DW$T$22)
   12388                      .dwattr $C$DW$2180, DW_AT_name("ADCCTL2")
   12389                      .dwattr $C$DW$2180, DW_AT_TI_symbol_name("_ADCCTL2")
   12390                      .dwattr $C$DW$2180, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
   12391                      .dwattr $C$DW$2180, DW_AT_accessibility(DW_ACCESS_public)
   12392              $C$DW$2181      .dwtag  DW_TAG_member
   12393                      .dwattr $C$DW$2181, DW_AT_type(*$C$DW$T$25)
   12394                      .dwattr $C$DW$2181, DW_AT_name("rsvd_2")
   12395                      .dwattr $C$DW$2181, DW_AT_TI_symbol_name("_rsvd_2")
   12396                      .dwattr $C$DW$2181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
   12397                      .dwattr $C$DW$2181, DW_AT_accessibility(DW_ACCESS_public)
   12398              $C$DW$2182      .dwtag  DW_TAG_member
   12399                      .dwattr $C$DW$2182, DW_AT_type(*$C$DW$T$22)
   12400                      .dwattr $C$DW$2182, DW_AT_name("ADCINTFLG")
   12401                      .dwattr $C$DW$2182, DW_AT_TI_symbol_name("_ADCINTFLG")
   12402                      .dwattr $C$DW$2182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
   12403                      .dwattr $C$DW$2182, DW_AT_accessibility(DW_ACCESS_public)
   12404              $C$DW$2183      .dwtag  DW_TAG_member
   12405                      .dwattr $C$DW$2183, DW_AT_type(*$C$DW$T$22)
   12406                      .dwattr $C$DW$2183, DW_AT_name("ADCINTFLGCLR")
   12407                      .dwattr $C$DW$2183, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
   12408                      .dwattr $C$DW$2183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
   12409                      .dwattr $C$DW$2183, DW_AT_accessibility(DW_ACCESS_public)
   12410              $C$DW$2184      .dwtag  DW_TAG_member
   12411                      .dwattr $C$DW$2184, DW_AT_type(*$C$DW$T$22)
   12412                      .dwattr $C$DW$2184, DW_AT_name("ADCINTOVF")
   12413                      .dwattr $C$DW$2184, DW_AT_TI_symbol_name("_ADCINTOVF")
   12414                      .dwattr $C$DW$2184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
   12415                      .dwattr $C$DW$2184, DW_AT_accessibility(DW_ACCESS_public)
   12416              $C$DW$2185      .dwtag  DW_TAG_member
   12417                      .dwattr $C$DW$2185, DW_AT_type(*$C$DW$T$22)
   12418                      .dwattr $C$DW$2185, DW_AT_name("ADCINTOVFCLR")
   12419                      .dwattr $C$DW$2185, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
   12420                      .dwattr $C$DW$2185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
   12421                      .dwattr $C$DW$2185, DW_AT_accessibility(DW_ACCESS_public)
   12422              $C$DW$2186      .dwtag  DW_TAG_member
   12423                      .dwattr $C$DW$2186, DW_AT_type(*$C$DW$T$26)
   12424                      .dwattr $C$DW$2186, DW_AT_name("INTSELxNy")
   12425                      .dwattr $C$DW$2186, DW_AT_TI_symbol_name("_INTSELxNy")
   12426                      .dwattr $C$DW$2186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
   12427                      .dwattr $C$DW$2186, DW_AT_accessibility(DW_ACCESS_public)
   12428              $C$DW$2187      .dwtag  DW_TAG_member
   12429                      .dwattr $C$DW$2187, DW_AT_type(*$C$DW$T$27)
   12430                      .dwattr $C$DW$2187, DW_AT_name("rsvd_3")
   12431                      .dwattr $C$DW$2187, DW_AT_TI_symbol_name("_rsvd_3")
   12432                      .dwattr $C$DW$2187, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
   12433                      .dwattr $C$DW$2187, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  238

   12434              $C$DW$2188      .dwtag  DW_TAG_member
   12435                      .dwattr $C$DW$2188, DW_AT_type(*$C$DW$T$22)
   12436                      .dwattr $C$DW$2188, DW_AT_name("SOCPRICTRL")
   12437                      .dwattr $C$DW$2188, DW_AT_TI_symbol_name("_SOCPRICTRL")
   12438                      .dwattr $C$DW$2188, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
   12439                      .dwattr $C$DW$2188, DW_AT_accessibility(DW_ACCESS_public)
   12440              $C$DW$2189      .dwtag  DW_TAG_member
   12441                      .dwattr $C$DW$2189, DW_AT_type(*$C$DW$T$22)
   12442                      .dwattr $C$DW$2189, DW_AT_name("rsvd_4")
   12443                      .dwattr $C$DW$2189, DW_AT_TI_symbol_name("_rsvd_4")
   12444                      .dwattr $C$DW$2189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
   12445                      .dwattr $C$DW$2189, DW_AT_accessibility(DW_ACCESS_public)
   12446              $C$DW$2190      .dwtag  DW_TAG_member
   12447                      .dwattr $C$DW$2190, DW_AT_type(*$C$DW$T$22)
   12448                      .dwattr $C$DW$2190, DW_AT_name("ADCSAMPLEMODE")
   12449                      .dwattr $C$DW$2190, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
   12450                      .dwattr $C$DW$2190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
   12451                      .dwattr $C$DW$2190, DW_AT_accessibility(DW_ACCESS_public)
   12452              $C$DW$2191      .dwtag  DW_TAG_member
   12453                      .dwattr $C$DW$2191, DW_AT_type(*$C$DW$T$22)
   12454                      .dwattr $C$DW$2191, DW_AT_name("rsvd_5")
   12455                      .dwattr $C$DW$2191, DW_AT_TI_symbol_name("_rsvd_5")
   12456                      .dwattr $C$DW$2191, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
   12457                      .dwattr $C$DW$2191, DW_AT_accessibility(DW_ACCESS_public)
   12458              $C$DW$2192      .dwtag  DW_TAG_member
   12459                      .dwattr $C$DW$2192, DW_AT_type(*$C$DW$T$22)
   12460                      .dwattr $C$DW$2192, DW_AT_name("ADCINTSOCSEL1")
   12461                      .dwattr $C$DW$2192, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
   12462                      .dwattr $C$DW$2192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
   12463                      .dwattr $C$DW$2192, DW_AT_accessibility(DW_ACCESS_public)
   12464              $C$DW$2193      .dwtag  DW_TAG_member
   12465                      .dwattr $C$DW$2193, DW_AT_type(*$C$DW$T$22)
   12466                      .dwattr $C$DW$2193, DW_AT_name("ADCINTSOCSEL2")
   12467                      .dwattr $C$DW$2193, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
   12468                      .dwattr $C$DW$2193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
   12469                      .dwattr $C$DW$2193, DW_AT_accessibility(DW_ACCESS_public)
   12470              $C$DW$2194      .dwtag  DW_TAG_member
   12471                      .dwattr $C$DW$2194, DW_AT_type(*$C$DW$T$25)
   12472                      .dwattr $C$DW$2194, DW_AT_name("rsvd_6")
   12473                      .dwattr $C$DW$2194, DW_AT_TI_symbol_name("_rsvd_6")
   12474                      .dwattr $C$DW$2194, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
   12475                      .dwattr $C$DW$2194, DW_AT_accessibility(DW_ACCESS_public)
   12476              $C$DW$2195      .dwtag  DW_TAG_member
   12477                      .dwattr $C$DW$2195, DW_AT_type(*$C$DW$T$22)
   12478                      .dwattr $C$DW$2195, DW_AT_name("ADCSOCFLG1")
   12479                      .dwattr $C$DW$2195, DW_AT_TI_symbol_name("_ADCSOCFLG1")
   12480                      .dwattr $C$DW$2195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
   12481                      .dwattr $C$DW$2195, DW_AT_accessibility(DW_ACCESS_public)
   12482              $C$DW$2196      .dwtag  DW_TAG_member
   12483                      .dwattr $C$DW$2196, DW_AT_type(*$C$DW$T$22)
   12484                      .dwattr $C$DW$2196, DW_AT_name("rsvd_7")
   12485                      .dwattr $C$DW$2196, DW_AT_TI_symbol_name("_rsvd_7")
   12486                      .dwattr $C$DW$2196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
   12487                      .dwattr $C$DW$2196, DW_AT_accessibility(DW_ACCESS_public)
   12488              $C$DW$2197      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  239

   12489                      .dwattr $C$DW$2197, DW_AT_type(*$C$DW$T$22)
   12490                      .dwattr $C$DW$2197, DW_AT_name("ADCSOCFRC1")
   12491                      .dwattr $C$DW$2197, DW_AT_TI_symbol_name("_ADCSOCFRC1")
   12492                      .dwattr $C$DW$2197, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
   12493                      .dwattr $C$DW$2197, DW_AT_accessibility(DW_ACCESS_public)
   12494              $C$DW$2198      .dwtag  DW_TAG_member
   12495                      .dwattr $C$DW$2198, DW_AT_type(*$C$DW$T$22)
   12496                      .dwattr $C$DW$2198, DW_AT_name("rsvd_8")
   12497                      .dwattr $C$DW$2198, DW_AT_TI_symbol_name("_rsvd_8")
   12498                      .dwattr $C$DW$2198, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
   12499                      .dwattr $C$DW$2198, DW_AT_accessibility(DW_ACCESS_public)
   12500              $C$DW$2199      .dwtag  DW_TAG_member
   12501                      .dwattr $C$DW$2199, DW_AT_type(*$C$DW$T$22)
   12502                      .dwattr $C$DW$2199, DW_AT_name("ADCSOCOVF1")
   12503                      .dwattr $C$DW$2199, DW_AT_TI_symbol_name("_ADCSOCOVF1")
   12504                      .dwattr $C$DW$2199, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
   12505                      .dwattr $C$DW$2199, DW_AT_accessibility(DW_ACCESS_public)
   12506              $C$DW$2200      .dwtag  DW_TAG_member
   12507                      .dwattr $C$DW$2200, DW_AT_type(*$C$DW$T$22)
   12508                      .dwattr $C$DW$2200, DW_AT_name("rsvd_9")
   12509                      .dwattr $C$DW$2200, DW_AT_TI_symbol_name("_rsvd_9")
   12510                      .dwattr $C$DW$2200, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
   12511                      .dwattr $C$DW$2200, DW_AT_accessibility(DW_ACCESS_public)
   12512              $C$DW$2201      .dwtag  DW_TAG_member
   12513                      .dwattr $C$DW$2201, DW_AT_type(*$C$DW$T$22)
   12514                      .dwattr $C$DW$2201, DW_AT_name("ADCSOCOVFCLR1")
   12515                      .dwattr $C$DW$2201, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
   12516                      .dwattr $C$DW$2201, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
   12517                      .dwattr $C$DW$2201, DW_AT_accessibility(DW_ACCESS_public)
   12518              $C$DW$2202      .dwtag  DW_TAG_member
   12519                      .dwattr $C$DW$2202, DW_AT_type(*$C$DW$T$22)
   12520                      .dwattr $C$DW$2202, DW_AT_name("rsvd_10")
   12521                      .dwattr $C$DW$2202, DW_AT_TI_symbol_name("_rsvd_10")
   12522                      .dwattr $C$DW$2202, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
   12523                      .dwattr $C$DW$2202, DW_AT_accessibility(DW_ACCESS_public)
   12524              $C$DW$2203      .dwtag  DW_TAG_member
   12525                      .dwattr $C$DW$2203, DW_AT_type(*$C$DW$T$23)
   12526                      .dwattr $C$DW$2203, DW_AT_name("ADCSOCxCTL")
   12527                      .dwattr $C$DW$2203, DW_AT_TI_symbol_name("_ADCSOCxCTL")
   12528                      .dwattr $C$DW$2203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
   12529                      .dwattr $C$DW$2203, DW_AT_accessibility(DW_ACCESS_public)
   12530              $C$DW$2204      .dwtag  DW_TAG_member
   12531                      .dwattr $C$DW$2204, DW_AT_type(*$C$DW$T$23)
   12532                      .dwattr $C$DW$2204, DW_AT_name("rsvd_11")
   12533                      .dwattr $C$DW$2204, DW_AT_TI_symbol_name("_rsvd_11")
   12534                      .dwattr $C$DW$2204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
   12535                      .dwattr $C$DW$2204, DW_AT_accessibility(DW_ACCESS_public)
   12536              $C$DW$2205      .dwtag  DW_TAG_member
   12537                      .dwattr $C$DW$2205, DW_AT_type(*$C$DW$T$22)
   12538                      .dwattr $C$DW$2205, DW_AT_name("ADCREFTRIM")
   12539                      .dwattr $C$DW$2205, DW_AT_TI_symbol_name("_ADCREFTRIM")
   12540                      .dwattr $C$DW$2205, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
   12541                      .dwattr $C$DW$2205, DW_AT_accessibility(DW_ACCESS_public)
   12542              $C$DW$2206      .dwtag  DW_TAG_member
   12543                      .dwattr $C$DW$2206, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  240

   12544                      .dwattr $C$DW$2206, DW_AT_name("ADCOFFTRIM")
   12545                      .dwattr $C$DW$2206, DW_AT_TI_symbol_name("_ADCOFFTRIM")
   12546                      .dwattr $C$DW$2206, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
   12547                      .dwattr $C$DW$2206, DW_AT_accessibility(DW_ACCESS_public)
   12548              $C$DW$2207      .dwtag  DW_TAG_member
   12549                      .dwattr $C$DW$2207, DW_AT_type(*$C$DW$T$28)
   12550                      .dwattr $C$DW$2207, DW_AT_name("resvd_12")
   12551                      .dwattr $C$DW$2207, DW_AT_TI_symbol_name("_resvd_12")
   12552                      .dwattr $C$DW$2207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
   12553                      .dwattr $C$DW$2207, DW_AT_accessibility(DW_ACCESS_public)
   12554              $C$DW$2208      .dwtag  DW_TAG_member
   12555                      .dwattr $C$DW$2208, DW_AT_type(*$C$DW$T$22)
   12556                      .dwattr $C$DW$2208, DW_AT_name("ADCREV")
   12557                      .dwattr $C$DW$2208, DW_AT_TI_symbol_name("_ADCREV")
   12558                      .dwattr $C$DW$2208, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
   12559                      .dwattr $C$DW$2208, DW_AT_accessibility(DW_ACCESS_public)
   12560                      .dwendtag $C$DW$T$29
   12561              
   12562              $C$DW$T$427     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
   12563                      .dwattr $C$DW$T$427, DW_AT_type(*$C$DW$T$29)
   12564                      .dwattr $C$DW$T$427, DW_AT_language(DW_LANG_C)
   12565              $C$DW$T$120     .dwtag  DW_TAG_pointer_type
   12566                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$29)
   12567                      .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
   12568              $C$DW$T$121     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
   12569                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
   12570                      .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
   12571              
   12572              $C$DW$T$33      .dwtag  DW_TAG_structure_type
   12573                      .dwattr $C$DW$T$33, DW_AT_name("_CAP_Obj_")
   12574                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x1a)
   12575              $C$DW$2209      .dwtag  DW_TAG_member
   12576                      .dwattr $C$DW$2209, DW_AT_type(*$C$DW$T$31)
   12577                      .dwattr $C$DW$2209, DW_AT_name("TSCTR")
   12578                      .dwattr $C$DW$2209, DW_AT_TI_symbol_name("_TSCTR")
   12579                      .dwattr $C$DW$2209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12580                      .dwattr $C$DW$2209, DW_AT_accessibility(DW_ACCESS_public)
   12581              $C$DW$2210      .dwtag  DW_TAG_member
   12582                      .dwattr $C$DW$2210, DW_AT_type(*$C$DW$T$31)
   12583                      .dwattr $C$DW$2210, DW_AT_name("CTRPHS")
   12584                      .dwattr $C$DW$2210, DW_AT_TI_symbol_name("_CTRPHS")
   12585                      .dwattr $C$DW$2210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12586                      .dwattr $C$DW$2210, DW_AT_accessibility(DW_ACCESS_public)
   12587              $C$DW$2211      .dwtag  DW_TAG_member
   12588                      .dwattr $C$DW$2211, DW_AT_type(*$C$DW$T$31)
   12589                      .dwattr $C$DW$2211, DW_AT_name("CAP1")
   12590                      .dwattr $C$DW$2211, DW_AT_TI_symbol_name("_CAP1")
   12591                      .dwattr $C$DW$2211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12592                      .dwattr $C$DW$2211, DW_AT_accessibility(DW_ACCESS_public)
   12593              $C$DW$2212      .dwtag  DW_TAG_member
   12594                      .dwattr $C$DW$2212, DW_AT_type(*$C$DW$T$31)
   12595                      .dwattr $C$DW$2212, DW_AT_name("CAP2")
   12596                      .dwattr $C$DW$2212, DW_AT_TI_symbol_name("_CAP2")
   12597                      .dwattr $C$DW$2212, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12598                      .dwattr $C$DW$2212, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  241

   12599              $C$DW$2213      .dwtag  DW_TAG_member
   12600                      .dwattr $C$DW$2213, DW_AT_type(*$C$DW$T$31)
   12601                      .dwattr $C$DW$2213, DW_AT_name("CAP3")
   12602                      .dwattr $C$DW$2213, DW_AT_TI_symbol_name("_CAP3")
   12603                      .dwattr $C$DW$2213, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12604                      .dwattr $C$DW$2213, DW_AT_accessibility(DW_ACCESS_public)
   12605              $C$DW$2214      .dwtag  DW_TAG_member
   12606                      .dwattr $C$DW$2214, DW_AT_type(*$C$DW$T$31)
   12607                      .dwattr $C$DW$2214, DW_AT_name("CAP4")
   12608                      .dwattr $C$DW$2214, DW_AT_TI_symbol_name("_CAP4")
   12609                      .dwattr $C$DW$2214, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   12610                      .dwattr $C$DW$2214, DW_AT_accessibility(DW_ACCESS_public)
   12611              $C$DW$2215      .dwtag  DW_TAG_member
   12612                      .dwattr $C$DW$2215, DW_AT_type(*$C$DW$T$32)
   12613                      .dwattr $C$DW$2215, DW_AT_name("Rsvd_1")
   12614                      .dwattr $C$DW$2215, DW_AT_TI_symbol_name("_Rsvd_1")
   12615                      .dwattr $C$DW$2215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12616                      .dwattr $C$DW$2215, DW_AT_accessibility(DW_ACCESS_public)
   12617              $C$DW$2216      .dwtag  DW_TAG_member
   12618                      .dwattr $C$DW$2216, DW_AT_type(*$C$DW$T$22)
   12619                      .dwattr $C$DW$2216, DW_AT_name("ECCTL1")
   12620                      .dwattr $C$DW$2216, DW_AT_TI_symbol_name("_ECCTL1")
   12621                      .dwattr $C$DW$2216, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
   12622                      .dwattr $C$DW$2216, DW_AT_accessibility(DW_ACCESS_public)
   12623              $C$DW$2217      .dwtag  DW_TAG_member
   12624                      .dwattr $C$DW$2217, DW_AT_type(*$C$DW$T$22)
   12625                      .dwattr $C$DW$2217, DW_AT_name("ECCTL2")
   12626                      .dwattr $C$DW$2217, DW_AT_TI_symbol_name("_ECCTL2")
   12627                      .dwattr $C$DW$2217, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
   12628                      .dwattr $C$DW$2217, DW_AT_accessibility(DW_ACCESS_public)
   12629              $C$DW$2218      .dwtag  DW_TAG_member
   12630                      .dwattr $C$DW$2218, DW_AT_type(*$C$DW$T$22)
   12631                      .dwattr $C$DW$2218, DW_AT_name("ECEINT")
   12632                      .dwattr $C$DW$2218, DW_AT_TI_symbol_name("_ECEINT")
   12633                      .dwattr $C$DW$2218, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   12634                      .dwattr $C$DW$2218, DW_AT_accessibility(DW_ACCESS_public)
   12635              $C$DW$2219      .dwtag  DW_TAG_member
   12636                      .dwattr $C$DW$2219, DW_AT_type(*$C$DW$T$22)
   12637                      .dwattr $C$DW$2219, DW_AT_name("ECEFLG")
   12638                      .dwattr $C$DW$2219, DW_AT_TI_symbol_name("_ECEFLG")
   12639                      .dwattr $C$DW$2219, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
   12640                      .dwattr $C$DW$2219, DW_AT_accessibility(DW_ACCESS_public)
   12641              $C$DW$2220      .dwtag  DW_TAG_member
   12642                      .dwattr $C$DW$2220, DW_AT_type(*$C$DW$T$22)
   12643                      .dwattr $C$DW$2220, DW_AT_name("ECECLR")
   12644                      .dwattr $C$DW$2220, DW_AT_TI_symbol_name("_ECECLR")
   12645                      .dwattr $C$DW$2220, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
   12646                      .dwattr $C$DW$2220, DW_AT_accessibility(DW_ACCESS_public)
   12647              $C$DW$2221      .dwtag  DW_TAG_member
   12648                      .dwattr $C$DW$2221, DW_AT_type(*$C$DW$T$22)
   12649                      .dwattr $C$DW$2221, DW_AT_name("ECEFRC")
   12650                      .dwattr $C$DW$2221, DW_AT_TI_symbol_name("_ECEFRC")
   12651                      .dwattr $C$DW$2221, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
   12652                      .dwattr $C$DW$2221, DW_AT_accessibility(DW_ACCESS_public)
   12653                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  242

   12654              
   12655              $C$DW$T$433     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Obj")
   12656                      .dwattr $C$DW$T$433, DW_AT_type(*$C$DW$T$33)
   12657                      .dwattr $C$DW$T$433, DW_AT_language(DW_LANG_C)
   12658              $C$DW$T$122     .dwtag  DW_TAG_pointer_type
   12659                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$33)
   12660                      .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
   12661              $C$DW$T$123     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
   12662                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
   12663                      .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
   12664              
   12665              $C$DW$T$34      .dwtag  DW_TAG_structure_type
   12666                      .dwattr $C$DW$T$34, DW_AT_name("_CLK_Obj_")
   12667                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x11)
   12668              $C$DW$2222      .dwtag  DW_TAG_member
   12669                      .dwattr $C$DW$2222, DW_AT_type(*$C$DW$T$22)
   12670                      .dwattr $C$DW$2222, DW_AT_name("XCLK")
   12671                      .dwattr $C$DW$2222, DW_AT_TI_symbol_name("_XCLK")
   12672                      .dwattr $C$DW$2222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12673                      .dwattr $C$DW$2222, DW_AT_accessibility(DW_ACCESS_public)
   12674              $C$DW$2223      .dwtag  DW_TAG_member
   12675                      .dwattr $C$DW$2223, DW_AT_type(*$C$DW$T$22)
   12676                      .dwattr $C$DW$2223, DW_AT_name("rsvd_1")
   12677                      .dwattr $C$DW$2223, DW_AT_TI_symbol_name("_rsvd_1")
   12678                      .dwattr $C$DW$2223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12679                      .dwattr $C$DW$2223, DW_AT_accessibility(DW_ACCESS_public)
   12680              $C$DW$2224      .dwtag  DW_TAG_member
   12681                      .dwattr $C$DW$2224, DW_AT_type(*$C$DW$T$22)
   12682                      .dwattr $C$DW$2224, DW_AT_name("CLKCTL")
   12683                      .dwattr $C$DW$2224, DW_AT_TI_symbol_name("_CLKCTL")
   12684                      .dwattr $C$DW$2224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12685                      .dwattr $C$DW$2224, DW_AT_accessibility(DW_ACCESS_public)
   12686              $C$DW$2225      .dwtag  DW_TAG_member
   12687                      .dwattr $C$DW$2225, DW_AT_type(*$C$DW$T$32)
   12688                      .dwattr $C$DW$2225, DW_AT_name("rsvd_2")
   12689                      .dwattr $C$DW$2225, DW_AT_TI_symbol_name("_rsvd_2")
   12690                      .dwattr $C$DW$2225, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12691                      .dwattr $C$DW$2225, DW_AT_accessibility(DW_ACCESS_public)
   12692              $C$DW$2226      .dwtag  DW_TAG_member
   12693                      .dwattr $C$DW$2226, DW_AT_type(*$C$DW$T$22)
   12694                      .dwattr $C$DW$2226, DW_AT_name("LOSPCP")
   12695                      .dwattr $C$DW$2226, DW_AT_TI_symbol_name("_LOSPCP")
   12696                      .dwattr $C$DW$2226, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   12697                      .dwattr $C$DW$2226, DW_AT_accessibility(DW_ACCESS_public)
   12698              $C$DW$2227      .dwtag  DW_TAG_member
   12699                      .dwattr $C$DW$2227, DW_AT_type(*$C$DW$T$22)
   12700                      .dwattr $C$DW$2227, DW_AT_name("PCLKCR0")
   12701                      .dwattr $C$DW$2227, DW_AT_TI_symbol_name("_PCLKCR0")
   12702                      .dwattr $C$DW$2227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   12703                      .dwattr $C$DW$2227, DW_AT_accessibility(DW_ACCESS_public)
   12704              $C$DW$2228      .dwtag  DW_TAG_member
   12705                      .dwattr $C$DW$2228, DW_AT_type(*$C$DW$T$22)
   12706                      .dwattr $C$DW$2228, DW_AT_name("PCLKCR1")
   12707                      .dwattr $C$DW$2228, DW_AT_TI_symbol_name("_PCLKCR1")
   12708                      .dwattr $C$DW$2228, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  243

   12709                      .dwattr $C$DW$2228, DW_AT_accessibility(DW_ACCESS_public)
   12710              $C$DW$2229      .dwtag  DW_TAG_member
   12711                      .dwattr $C$DW$2229, DW_AT_type(*$C$DW$T$25)
   12712                      .dwattr $C$DW$2229, DW_AT_name("rsvd_3")
   12713                      .dwattr $C$DW$2229, DW_AT_TI_symbol_name("_rsvd_3")
   12714                      .dwattr $C$DW$2229, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   12715                      .dwattr $C$DW$2229, DW_AT_accessibility(DW_ACCESS_public)
   12716              $C$DW$2230      .dwtag  DW_TAG_member
   12717                      .dwattr $C$DW$2230, DW_AT_type(*$C$DW$T$22)
   12718                      .dwattr $C$DW$2230, DW_AT_name("PCLKCR3")
   12719                      .dwattr $C$DW$2230, DW_AT_TI_symbol_name("_PCLKCR3")
   12720                      .dwattr $C$DW$2230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   12721                      .dwattr $C$DW$2230, DW_AT_accessibility(DW_ACCESS_public)
   12722                      .dwendtag $C$DW$T$34
   12723              
   12724              $C$DW$T$124     .dwtag  DW_TAG_pointer_type
   12725                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$34)
   12726                      .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
   12727              $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
   12728                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
   12729                      .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
   12730              
   12731              $C$DW$T$36      .dwtag  DW_TAG_structure_type
   12732                      .dwattr $C$DW$T$36, DW_AT_name("_CPU_Obj_")
   12733                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
   12734              $C$DW$2231      .dwtag  DW_TAG_member
   12735                      .dwattr $C$DW$2231, DW_AT_type(*$C$DW$T$35)
   12736                      .dwattr $C$DW$2231, DW_AT_name("tmp")
   12737                      .dwattr $C$DW$2231, DW_AT_TI_symbol_name("_tmp")
   12738                      .dwattr $C$DW$2231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12739                      .dwattr $C$DW$2231, DW_AT_accessibility(DW_ACCESS_public)
   12740                      .dwendtag $C$DW$T$36
   12741              
   12742              $C$DW$T$440     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
   12743                      .dwattr $C$DW$T$440, DW_AT_type(*$C$DW$T$36)
   12744                      .dwattr $C$DW$T$440, DW_AT_language(DW_LANG_C)
   12745              $C$DW$T$126     .dwtag  DW_TAG_pointer_type
   12746                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$36)
   12747                      .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
   12748              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
   12749                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$126)
   12750                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
   12751              
   12752              $C$DW$T$44      .dwtag  DW_TAG_structure_type
   12753                      .dwattr $C$DW$T$44, DW_AT_name("_DRV8305_Obj_")
   12754                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
   12755              $C$DW$2232      .dwtag  DW_TAG_member
   12756                      .dwattr $C$DW$2232, DW_AT_type(*$C$DW$T$38)
   12757                      .dwattr $C$DW$2232, DW_AT_name("spiHandle")
   12758                      .dwattr $C$DW$2232, DW_AT_TI_symbol_name("_spiHandle")
   12759                      .dwattr $C$DW$2232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12760                      .dwattr $C$DW$2232, DW_AT_accessibility(DW_ACCESS_public)
   12761              $C$DW$2233      .dwtag  DW_TAG_member
   12762                      .dwattr $C$DW$2233, DW_AT_type(*$C$DW$T$40)
   12763                      .dwattr $C$DW$2233, DW_AT_name("gpioHandle")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  244

   12764                      .dwattr $C$DW$2233, DW_AT_TI_symbol_name("_gpioHandle")
   12765                      .dwattr $C$DW$2233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12766                      .dwattr $C$DW$2233, DW_AT_accessibility(DW_ACCESS_public)
   12767              $C$DW$2234      .dwtag  DW_TAG_member
   12768                      .dwattr $C$DW$2234, DW_AT_type(*$C$DW$T$42)
   12769                      .dwattr $C$DW$2234, DW_AT_name("gpioNumber")
   12770                      .dwattr $C$DW$2234, DW_AT_TI_symbol_name("_gpioNumber")
   12771                      .dwattr $C$DW$2234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12772                      .dwattr $C$DW$2234, DW_AT_accessibility(DW_ACCESS_public)
   12773              $C$DW$2235      .dwtag  DW_TAG_member
   12774                      .dwattr $C$DW$2235, DW_AT_type(*$C$DW$T$43)
   12775                      .dwattr $C$DW$2235, DW_AT_name("RxTimeOut")
   12776                      .dwattr $C$DW$2235, DW_AT_TI_symbol_name("_RxTimeOut")
   12777                      .dwattr $C$DW$2235, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12778                      .dwattr $C$DW$2235, DW_AT_accessibility(DW_ACCESS_public)
   12779              $C$DW$2236      .dwtag  DW_TAG_member
   12780                      .dwattr $C$DW$2236, DW_AT_type(*$C$DW$T$43)
   12781                      .dwattr $C$DW$2236, DW_AT_name("enableTimeOut")
   12782                      .dwattr $C$DW$2236, DW_AT_TI_symbol_name("_enableTimeOut")
   12783                      .dwattr $C$DW$2236, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12784                      .dwattr $C$DW$2236, DW_AT_accessibility(DW_ACCESS_public)
   12785                      .dwendtag $C$DW$T$44
   12786              
   12787              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Obj")
   12788                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$44)
   12789                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
   12790              $C$DW$T$155     .dwtag  DW_TAG_pointer_type
   12791                      .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$44)
   12792                      .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
   12793              $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Handle")
   12794                      .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$155)
   12795                      .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
   12796              
   12797              $C$DW$T$51      .dwtag  DW_TAG_structure_type
   12798                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
   12799                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
   12800              $C$DW$2237      .dwtag  DW_TAG_member
   12801                      .dwattr $C$DW$2237, DW_AT_type(*$C$DW$T$46)
   12802                      .dwattr $C$DW$2237, DW_AT_name("IDRIVEP_HS")
   12803                      .dwattr $C$DW$2237, DW_AT_TI_symbol_name("_IDRIVEP_HS")
   12804                      .dwattr $C$DW$2237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12805                      .dwattr $C$DW$2237, DW_AT_accessibility(DW_ACCESS_public)
   12806              $C$DW$2238      .dwtag  DW_TAG_member
   12807                      .dwattr $C$DW$2238, DW_AT_type(*$C$DW$T$48)
   12808                      .dwattr $C$DW$2238, DW_AT_name("IDRIVEN_HS")
   12809                      .dwattr $C$DW$2238, DW_AT_TI_symbol_name("_IDRIVEN_HS")
   12810                      .dwattr $C$DW$2238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12811                      .dwattr $C$DW$2238, DW_AT_accessibility(DW_ACCESS_public)
   12812              $C$DW$2239      .dwtag  DW_TAG_member
   12813                      .dwattr $C$DW$2239, DW_AT_type(*$C$DW$T$50)
   12814                      .dwattr $C$DW$2239, DW_AT_name("TDRIVEN")
   12815                      .dwattr $C$DW$2239, DW_AT_TI_symbol_name("_TDRIVEN")
   12816                      .dwattr $C$DW$2239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12817                      .dwattr $C$DW$2239, DW_AT_accessibility(DW_ACCESS_public)
   12818              $C$DW$2240      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  245

   12819                      .dwattr $C$DW$2240, DW_AT_type(*$C$DW$T$43)
   12820                      .dwattr $C$DW$2240, DW_AT_name("CTRL05_RSV1")
   12821                      .dwattr $C$DW$2240, DW_AT_TI_symbol_name("_CTRL05_RSV1")
   12822                      .dwattr $C$DW$2240, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12823                      .dwattr $C$DW$2240, DW_AT_accessibility(DW_ACCESS_public)
   12824                      .dwendtag $C$DW$T$51
   12825              
   12826              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
   12827                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$51)
   12828                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
   12829              
   12830              $C$DW$T$58      .dwtag  DW_TAG_structure_type
   12831                      .dwattr $C$DW$T$58, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
   12832                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
   12833              $C$DW$2241      .dwtag  DW_TAG_member
   12834                      .dwattr $C$DW$2241, DW_AT_type(*$C$DW$T$53)
   12835                      .dwattr $C$DW$2241, DW_AT_name("IDRIVEP_LS")
   12836                      .dwattr $C$DW$2241, DW_AT_TI_symbol_name("_IDRIVEP_LS")
   12837                      .dwattr $C$DW$2241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12838                      .dwattr $C$DW$2241, DW_AT_accessibility(DW_ACCESS_public)
   12839              $C$DW$2242      .dwtag  DW_TAG_member
   12840                      .dwattr $C$DW$2242, DW_AT_type(*$C$DW$T$55)
   12841                      .dwattr $C$DW$2242, DW_AT_name("IDRIVEN_LS")
   12842                      .dwattr $C$DW$2242, DW_AT_TI_symbol_name("_IDRIVEN_LS")
   12843                      .dwattr $C$DW$2242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12844                      .dwattr $C$DW$2242, DW_AT_accessibility(DW_ACCESS_public)
   12845              $C$DW$2243      .dwtag  DW_TAG_member
   12846                      .dwattr $C$DW$2243, DW_AT_type(*$C$DW$T$57)
   12847                      .dwattr $C$DW$2243, DW_AT_name("TDRIVEP")
   12848                      .dwattr $C$DW$2243, DW_AT_TI_symbol_name("_TDRIVEP")
   12849                      .dwattr $C$DW$2243, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12850                      .dwattr $C$DW$2243, DW_AT_accessibility(DW_ACCESS_public)
   12851              $C$DW$2244      .dwtag  DW_TAG_member
   12852                      .dwattr $C$DW$2244, DW_AT_type(*$C$DW$T$43)
   12853                      .dwattr $C$DW$2244, DW_AT_name("CTRL06_RSV1")
   12854                      .dwattr $C$DW$2244, DW_AT_TI_symbol_name("_CTRL06_RSV1")
   12855                      .dwattr $C$DW$2244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12856                      .dwattr $C$DW$2244, DW_AT_accessibility(DW_ACCESS_public)
   12857                      .dwendtag $C$DW$T$58
   12858              
   12859              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
   12860                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$58)
   12861                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
   12862              
   12863              $C$DW$T$69      .dwtag  DW_TAG_structure_type
   12864                      .dwattr $C$DW$T$69, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
   12865                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x06)
   12866              $C$DW$2245      .dwtag  DW_TAG_member
   12867                      .dwattr $C$DW$2245, DW_AT_type(*$C$DW$T$60)
   12868                      .dwattr $C$DW$2245, DW_AT_name("TVDS")
   12869                      .dwattr $C$DW$2245, DW_AT_TI_symbol_name("_TVDS")
   12870                      .dwattr $C$DW$2245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12871                      .dwattr $C$DW$2245, DW_AT_accessibility(DW_ACCESS_public)
   12872              $C$DW$2246      .dwtag  DW_TAG_member
   12873                      .dwattr $C$DW$2246, DW_AT_type(*$C$DW$T$62)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  246

   12874                      .dwattr $C$DW$2246, DW_AT_name("TBLANK")
   12875                      .dwattr $C$DW$2246, DW_AT_TI_symbol_name("_TBLANK")
   12876                      .dwattr $C$DW$2246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12877                      .dwattr $C$DW$2246, DW_AT_accessibility(DW_ACCESS_public)
   12878              $C$DW$2247      .dwtag  DW_TAG_member
   12879                      .dwattr $C$DW$2247, DW_AT_type(*$C$DW$T$64)
   12880                      .dwattr $C$DW$2247, DW_AT_name("DEAD_TIME")
   12881                      .dwattr $C$DW$2247, DW_AT_TI_symbol_name("_DEAD_TIME")
   12882                      .dwattr $C$DW$2247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12883                      .dwattr $C$DW$2247, DW_AT_accessibility(DW_ACCESS_public)
   12884              $C$DW$2248      .dwtag  DW_TAG_member
   12885                      .dwattr $C$DW$2248, DW_AT_type(*$C$DW$T$66)
   12886                      .dwattr $C$DW$2248, DW_AT_name("PWM_MODE")
   12887                      .dwattr $C$DW$2248, DW_AT_TI_symbol_name("_PWM_MODE")
   12888                      .dwattr $C$DW$2248, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12889                      .dwattr $C$DW$2248, DW_AT_accessibility(DW_ACCESS_public)
   12890              $C$DW$2249      .dwtag  DW_TAG_member
   12891                      .dwattr $C$DW$2249, DW_AT_type(*$C$DW$T$68)
   12892                      .dwattr $C$DW$2249, DW_AT_name("COMM_OPT")
   12893                      .dwattr $C$DW$2249, DW_AT_TI_symbol_name("_COMM_OPT")
   12894                      .dwattr $C$DW$2249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12895                      .dwattr $C$DW$2249, DW_AT_accessibility(DW_ACCESS_public)
   12896              $C$DW$2250      .dwtag  DW_TAG_member
   12897                      .dwattr $C$DW$2250, DW_AT_type(*$C$DW$T$43)
   12898                      .dwattr $C$DW$2250, DW_AT_name("CTRL07_RSV1")
   12899                      .dwattr $C$DW$2250, DW_AT_TI_symbol_name("_CTRL07_RSV1")
   12900                      .dwattr $C$DW$2250, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12901                      .dwattr $C$DW$2250, DW_AT_accessibility(DW_ACCESS_public)
   12902                      .dwendtag $C$DW$T$69
   12903              
   12904              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
   12905                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$69)
   12906                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   12907              
   12908              $C$DW$T$70      .dwtag  DW_TAG_structure_type
   12909                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
   12910                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x01)
   12911              $C$DW$2251      .dwtag  DW_TAG_member
   12912                      .dwattr $C$DW$2251, DW_AT_type(*$C$DW$T$21)
   12913                      .dwattr $C$DW$2251, DW_AT_name("CTRL08_RSV1")
   12914                      .dwattr $C$DW$2251, DW_AT_TI_symbol_name("_CTRL08_RSV1")
   12915                      .dwattr $C$DW$2251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12916                      .dwattr $C$DW$2251, DW_AT_accessibility(DW_ACCESS_public)
   12917                      .dwendtag $C$DW$T$70
   12918              
   12919              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
   12920                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$70)
   12921                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
   12922              
   12923              $C$DW$T$73      .dwtag  DW_TAG_structure_type
   12924                      .dwattr $C$DW$T$73, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
   12925                      .dwattr $C$DW$T$73, DW_AT_byte_size(0x0a)
   12926              $C$DW$2252      .dwtag  DW_TAG_member
   12927                      .dwattr $C$DW$2252, DW_AT_type(*$C$DW$T$43)
   12928                      .dwattr $C$DW$2252, DW_AT_name("SET_VCPH_UV")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  247

   12929                      .dwattr $C$DW$2252, DW_AT_TI_symbol_name("_SET_VCPH_UV")
   12930                      .dwattr $C$DW$2252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   12931                      .dwattr $C$DW$2252, DW_AT_accessibility(DW_ACCESS_public)
   12932              $C$DW$2253      .dwtag  DW_TAG_member
   12933                      .dwattr $C$DW$2253, DW_AT_type(*$C$DW$T$43)
   12934                      .dwattr $C$DW$2253, DW_AT_name("CLR_FLTS")
   12935                      .dwattr $C$DW$2253, DW_AT_TI_symbol_name("_CLR_FLTS")
   12936                      .dwattr $C$DW$2253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   12937                      .dwattr $C$DW$2253, DW_AT_accessibility(DW_ACCESS_public)
   12938              $C$DW$2254      .dwtag  DW_TAG_member
   12939                      .dwattr $C$DW$2254, DW_AT_type(*$C$DW$T$43)
   12940                      .dwattr $C$DW$2254, DW_AT_name("SLEEP")
   12941                      .dwattr $C$DW$2254, DW_AT_TI_symbol_name("_SLEEP")
   12942                      .dwattr $C$DW$2254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   12943                      .dwattr $C$DW$2254, DW_AT_accessibility(DW_ACCESS_public)
   12944              $C$DW$2255      .dwtag  DW_TAG_member
   12945                      .dwattr $C$DW$2255, DW_AT_type(*$C$DW$T$43)
   12946                      .dwattr $C$DW$2255, DW_AT_name("WD_EN")
   12947                      .dwattr $C$DW$2255, DW_AT_TI_symbol_name("_WD_EN")
   12948                      .dwattr $C$DW$2255, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   12949                      .dwattr $C$DW$2255, DW_AT_accessibility(DW_ACCESS_public)
   12950              $C$DW$2256      .dwtag  DW_TAG_member
   12951                      .dwattr $C$DW$2256, DW_AT_type(*$C$DW$T$43)
   12952                      .dwattr $C$DW$2256, DW_AT_name("DIS_SNS_OCP")
   12953                      .dwattr $C$DW$2256, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
   12954                      .dwattr $C$DW$2256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   12955                      .dwattr $C$DW$2256, DW_AT_accessibility(DW_ACCESS_public)
   12956              $C$DW$2257      .dwtag  DW_TAG_member
   12957                      .dwattr $C$DW$2257, DW_AT_type(*$C$DW$T$72)
   12958                      .dwattr $C$DW$2257, DW_AT_name("WD_DLY")
   12959                      .dwattr $C$DW$2257, DW_AT_TI_symbol_name("_WD_DLY")
   12960                      .dwattr $C$DW$2257, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   12961                      .dwattr $C$DW$2257, DW_AT_accessibility(DW_ACCESS_public)
   12962              $C$DW$2258      .dwtag  DW_TAG_member
   12963                      .dwattr $C$DW$2258, DW_AT_type(*$C$DW$T$43)
   12964                      .dwattr $C$DW$2258, DW_AT_name("EN_SNS_CLAMP")
   12965                      .dwattr $C$DW$2258, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
   12966                      .dwattr $C$DW$2258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   12967                      .dwattr $C$DW$2258, DW_AT_accessibility(DW_ACCESS_public)
   12968              $C$DW$2259      .dwtag  DW_TAG_member
   12969                      .dwattr $C$DW$2259, DW_AT_type(*$C$DW$T$43)
   12970                      .dwattr $C$DW$2259, DW_AT_name("DIS_GDRV_FAULT")
   12971                      .dwattr $C$DW$2259, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
   12972                      .dwattr $C$DW$2259, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   12973                      .dwattr $C$DW$2259, DW_AT_accessibility(DW_ACCESS_public)
   12974              $C$DW$2260      .dwtag  DW_TAG_member
   12975                      .dwattr $C$DW$2260, DW_AT_type(*$C$DW$T$43)
   12976                      .dwattr $C$DW$2260, DW_AT_name("DISABLE")
   12977                      .dwattr $C$DW$2260, DW_AT_TI_symbol_name("_DISABLE")
   12978                      .dwattr $C$DW$2260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   12979                      .dwattr $C$DW$2260, DW_AT_accessibility(DW_ACCESS_public)
   12980              $C$DW$2261      .dwtag  DW_TAG_member
   12981                      .dwattr $C$DW$2261, DW_AT_type(*$C$DW$T$43)
   12982                      .dwattr $C$DW$2261, DW_AT_name("FLIP_OTS")
   12983                      .dwattr $C$DW$2261, DW_AT_TI_symbol_name("_FLIP_OTS")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  248

   12984                      .dwattr $C$DW$2261, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   12985                      .dwattr $C$DW$2261, DW_AT_accessibility(DW_ACCESS_public)
   12986                      .dwendtag $C$DW$T$73
   12987              
   12988              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
   12989                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$73)
   12990                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   12991              
   12992              $C$DW$T$82      .dwtag  DW_TAG_structure_type
   12993                      .dwattr $C$DW$T$82, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
   12994                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x07)
   12995              $C$DW$2262      .dwtag  DW_TAG_member
   12996                      .dwattr $C$DW$2262, DW_AT_type(*$C$DW$T$75)
   12997                      .dwattr $C$DW$2262, DW_AT_name("GAIN_CS1")
   12998                      .dwattr $C$DW$2262, DW_AT_TI_symbol_name("_GAIN_CS1")
   12999                      .dwattr $C$DW$2262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13000                      .dwattr $C$DW$2262, DW_AT_accessibility(DW_ACCESS_public)
   13001              $C$DW$2263      .dwtag  DW_TAG_member
   13002                      .dwattr $C$DW$2263, DW_AT_type(*$C$DW$T$77)
   13003                      .dwattr $C$DW$2263, DW_AT_name("GAIN_CS2")
   13004                      .dwattr $C$DW$2263, DW_AT_TI_symbol_name("_GAIN_CS2")
   13005                      .dwattr $C$DW$2263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13006                      .dwattr $C$DW$2263, DW_AT_accessibility(DW_ACCESS_public)
   13007              $C$DW$2264      .dwtag  DW_TAG_member
   13008                      .dwattr $C$DW$2264, DW_AT_type(*$C$DW$T$79)
   13009                      .dwattr $C$DW$2264, DW_AT_name("GAIN_CS3")
   13010                      .dwattr $C$DW$2264, DW_AT_TI_symbol_name("_GAIN_CS3")
   13011                      .dwattr $C$DW$2264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13012                      .dwattr $C$DW$2264, DW_AT_accessibility(DW_ACCESS_public)
   13013              $C$DW$2265      .dwtag  DW_TAG_member
   13014                      .dwattr $C$DW$2265, DW_AT_type(*$C$DW$T$81)
   13015                      .dwattr $C$DW$2265, DW_AT_name("CS_BLANK")
   13016                      .dwattr $C$DW$2265, DW_AT_TI_symbol_name("_CS_BLANK")
   13017                      .dwattr $C$DW$2265, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13018                      .dwattr $C$DW$2265, DW_AT_accessibility(DW_ACCESS_public)
   13019              $C$DW$2266      .dwtag  DW_TAG_member
   13020                      .dwattr $C$DW$2266, DW_AT_type(*$C$DW$T$43)
   13021                      .dwattr $C$DW$2266, DW_AT_name("DC_CAL_CH1")
   13022                      .dwattr $C$DW$2266, DW_AT_TI_symbol_name("_DC_CAL_CH1")
   13023                      .dwattr $C$DW$2266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13024                      .dwattr $C$DW$2266, DW_AT_accessibility(DW_ACCESS_public)
   13025              $C$DW$2267      .dwtag  DW_TAG_member
   13026                      .dwattr $C$DW$2267, DW_AT_type(*$C$DW$T$43)
   13027                      .dwattr $C$DW$2267, DW_AT_name("DC_CAL_CH2")
   13028                      .dwattr $C$DW$2267, DW_AT_TI_symbol_name("_DC_CAL_CH2")
   13029                      .dwattr $C$DW$2267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13030                      .dwattr $C$DW$2267, DW_AT_accessibility(DW_ACCESS_public)
   13031              $C$DW$2268      .dwtag  DW_TAG_member
   13032                      .dwattr $C$DW$2268, DW_AT_type(*$C$DW$T$43)
   13033                      .dwattr $C$DW$2268, DW_AT_name("DC_CAL_CH3")
   13034                      .dwattr $C$DW$2268, DW_AT_TI_symbol_name("_DC_CAL_CH3")
   13035                      .dwattr $C$DW$2268, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13036                      .dwattr $C$DW$2268, DW_AT_accessibility(DW_ACCESS_public)
   13037                      .dwendtag $C$DW$T$82
   13038              
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  249

   13039              $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
   13040                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$82)
   13041                      .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
   13042              
   13043              $C$DW$T$89      .dwtag  DW_TAG_structure_type
   13044                      .dwattr $C$DW$T$89, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
   13045                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x08)
   13046              $C$DW$2269      .dwtag  DW_TAG_member
   13047                      .dwattr $C$DW$2269, DW_AT_type(*$C$DW$T$84)
   13048                      .dwattr $C$DW$2269, DW_AT_name("VREG_UV_LEVEL")
   13049                      .dwattr $C$DW$2269, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
   13050                      .dwattr $C$DW$2269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13051                      .dwattr $C$DW$2269, DW_AT_accessibility(DW_ACCESS_public)
   13052              $C$DW$2270      .dwtag  DW_TAG_member
   13053                      .dwattr $C$DW$2270, DW_AT_type(*$C$DW$T$43)
   13054                      .dwattr $C$DW$2270, DW_AT_name("DIS_PWRGD")
   13055                      .dwattr $C$DW$2270, DW_AT_TI_symbol_name("_DIS_PWRGD")
   13056                      .dwattr $C$DW$2270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13057                      .dwattr $C$DW$2270, DW_AT_accessibility(DW_ACCESS_public)
   13058              $C$DW$2271      .dwtag  DW_TAG_member
   13059                      .dwattr $C$DW$2271, DW_AT_type(*$C$DW$T$86)
   13060                      .dwattr $C$DW$2271, DW_AT_name("SLP_DLY")
   13061                      .dwattr $C$DW$2271, DW_AT_TI_symbol_name("_SLP_DLY")
   13062                      .dwattr $C$DW$2271, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13063                      .dwattr $C$DW$2271, DW_AT_accessibility(DW_ACCESS_public)
   13064              $C$DW$2272      .dwtag  DW_TAG_member
   13065                      .dwattr $C$DW$2272, DW_AT_type(*$C$DW$T$43)
   13066                      .dwattr $C$DW$2272, DW_AT_name("CTRL0B_RSV1")
   13067                      .dwattr $C$DW$2272, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
   13068                      .dwattr $C$DW$2272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13069                      .dwattr $C$DW$2272, DW_AT_accessibility(DW_ACCESS_public)
   13070              $C$DW$2273      .dwtag  DW_TAG_member
   13071                      .dwattr $C$DW$2273, DW_AT_type(*$C$DW$T$43)
   13072                      .dwattr $C$DW$2273, DW_AT_name("CTRL0B_RSV2")
   13073                      .dwattr $C$DW$2273, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
   13074                      .dwattr $C$DW$2273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13075                      .dwattr $C$DW$2273, DW_AT_accessibility(DW_ACCESS_public)
   13076              $C$DW$2274      .dwtag  DW_TAG_member
   13077                      .dwattr $C$DW$2274, DW_AT_type(*$C$DW$T$43)
   13078                      .dwattr $C$DW$2274, DW_AT_name("CTRL0B_RSV3")
   13079                      .dwattr $C$DW$2274, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
   13080                      .dwattr $C$DW$2274, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13081                      .dwattr $C$DW$2274, DW_AT_accessibility(DW_ACCESS_public)
   13082              $C$DW$2275      .dwtag  DW_TAG_member
   13083                      .dwattr $C$DW$2275, DW_AT_type(*$C$DW$T$88)
   13084                      .dwattr $C$DW$2275, DW_AT_name("VREF_SCALING")
   13085                      .dwattr $C$DW$2275, DW_AT_TI_symbol_name("_VREF_SCALING")
   13086                      .dwattr $C$DW$2275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13087                      .dwattr $C$DW$2275, DW_AT_accessibility(DW_ACCESS_public)
   13088              $C$DW$2276      .dwtag  DW_TAG_member
   13089                      .dwattr $C$DW$2276, DW_AT_type(*$C$DW$T$43)
   13090                      .dwattr $C$DW$2276, DW_AT_name("CTRL0B_RSV4")
   13091                      .dwattr $C$DW$2276, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
   13092                      .dwattr $C$DW$2276, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13093                      .dwattr $C$DW$2276, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  250

   13094                      .dwendtag $C$DW$T$89
   13095              
   13096              $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
   13097                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$89)
   13098                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
   13099              
   13100              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   13101                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
   13102                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x05)
   13103              $C$DW$2277      .dwtag  DW_TAG_member
   13104                      .dwattr $C$DW$2277, DW_AT_type(*$C$DW$T$91)
   13105                      .dwattr $C$DW$2277, DW_AT_name("VDS_MODE")
   13106                      .dwattr $C$DW$2277, DW_AT_TI_symbol_name("_VDS_MODE")
   13107                      .dwattr $C$DW$2277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13108                      .dwattr $C$DW$2277, DW_AT_accessibility(DW_ACCESS_public)
   13109              $C$DW$2278      .dwtag  DW_TAG_member
   13110                      .dwattr $C$DW$2278, DW_AT_type(*$C$DW$T$93)
   13111                      .dwattr $C$DW$2278, DW_AT_name("VDS_LEVEL")
   13112                      .dwattr $C$DW$2278, DW_AT_TI_symbol_name("_VDS_LEVEL")
   13113                      .dwattr $C$DW$2278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13114                      .dwattr $C$DW$2278, DW_AT_accessibility(DW_ACCESS_public)
   13115              $C$DW$2279      .dwtag  DW_TAG_member
   13116                      .dwattr $C$DW$2279, DW_AT_type(*$C$DW$T$43)
   13117                      .dwattr $C$DW$2279, DW_AT_name("CTRL0C_RSV1")
   13118                      .dwattr $C$DW$2279, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
   13119                      .dwattr $C$DW$2279, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13120                      .dwattr $C$DW$2279, DW_AT_accessibility(DW_ACCESS_public)
   13121              $C$DW$2280      .dwtag  DW_TAG_member
   13122                      .dwattr $C$DW$2280, DW_AT_type(*$C$DW$T$43)
   13123                      .dwattr $C$DW$2280, DW_AT_name("CTRL0C_RSV2")
   13124                      .dwattr $C$DW$2280, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
   13125                      .dwattr $C$DW$2280, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13126                      .dwattr $C$DW$2280, DW_AT_accessibility(DW_ACCESS_public)
   13127              $C$DW$2281      .dwtag  DW_TAG_member
   13128                      .dwattr $C$DW$2281, DW_AT_type(*$C$DW$T$43)
   13129                      .dwattr $C$DW$2281, DW_AT_name("CTRL0C_RSV3")
   13130                      .dwattr $C$DW$2281, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
   13131                      .dwattr $C$DW$2281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13132                      .dwattr $C$DW$2281, DW_AT_accessibility(DW_ACCESS_public)
   13133                      .dwendtag $C$DW$T$94
   13134              
   13135              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
   13136                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$94)
   13137                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
   13138              
   13139              $C$DW$T$95      .dwtag  DW_TAG_structure_type
   13140                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
   13141                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x0b)
   13142              $C$DW$2282      .dwtag  DW_TAG_member
   13143                      .dwattr $C$DW$2282, DW_AT_type(*$C$DW$T$43)
   13144                      .dwattr $C$DW$2282, DW_AT_name("OTW")
   13145                      .dwattr $C$DW$2282, DW_AT_TI_symbol_name("_OTW")
   13146                      .dwattr $C$DW$2282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13147                      .dwattr $C$DW$2282, DW_AT_accessibility(DW_ACCESS_public)
   13148              $C$DW$2283      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  251

   13149                      .dwattr $C$DW$2283, DW_AT_type(*$C$DW$T$43)
   13150                      .dwattr $C$DW$2283, DW_AT_name("TEMP_FLAG3")
   13151                      .dwattr $C$DW$2283, DW_AT_TI_symbol_name("_TEMP_FLAG3")
   13152                      .dwattr $C$DW$2283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13153                      .dwattr $C$DW$2283, DW_AT_accessibility(DW_ACCESS_public)
   13154              $C$DW$2284      .dwtag  DW_TAG_member
   13155                      .dwattr $C$DW$2284, DW_AT_type(*$C$DW$T$43)
   13156                      .dwattr $C$DW$2284, DW_AT_name("TEMP_FLAG2")
   13157                      .dwattr $C$DW$2284, DW_AT_TI_symbol_name("_TEMP_FLAG2")
   13158                      .dwattr $C$DW$2284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13159                      .dwattr $C$DW$2284, DW_AT_accessibility(DW_ACCESS_public)
   13160              $C$DW$2285      .dwtag  DW_TAG_member
   13161                      .dwattr $C$DW$2285, DW_AT_type(*$C$DW$T$43)
   13162                      .dwattr $C$DW$2285, DW_AT_name("TEMP_FLAG1")
   13163                      .dwattr $C$DW$2285, DW_AT_TI_symbol_name("_TEMP_FLAG1")
   13164                      .dwattr $C$DW$2285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13165                      .dwattr $C$DW$2285, DW_AT_accessibility(DW_ACCESS_public)
   13166              $C$DW$2286      .dwtag  DW_TAG_member
   13167                      .dwattr $C$DW$2286, DW_AT_type(*$C$DW$T$43)
   13168                      .dwattr $C$DW$2286, DW_AT_name("VCPH_UVFL")
   13169                      .dwattr $C$DW$2286, DW_AT_TI_symbol_name("_VCPH_UVFL")
   13170                      .dwattr $C$DW$2286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13171                      .dwattr $C$DW$2286, DW_AT_accessibility(DW_ACCESS_public)
   13172              $C$DW$2287      .dwtag  DW_TAG_member
   13173                      .dwattr $C$DW$2287, DW_AT_type(*$C$DW$T$43)
   13174                      .dwattr $C$DW$2287, DW_AT_name("VDS_STATUS")
   13175                      .dwattr $C$DW$2287, DW_AT_TI_symbol_name("_VDS_STATUS")
   13176                      .dwattr $C$DW$2287, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13177                      .dwattr $C$DW$2287, DW_AT_accessibility(DW_ACCESS_public)
   13178              $C$DW$2288      .dwtag  DW_TAG_member
   13179                      .dwattr $C$DW$2288, DW_AT_type(*$C$DW$T$43)
   13180                      .dwattr $C$DW$2288, DW_AT_name("PVDD_OVFL")
   13181                      .dwattr $C$DW$2288, DW_AT_TI_symbol_name("_PVDD_OVFL")
   13182                      .dwattr $C$DW$2288, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13183                      .dwattr $C$DW$2288, DW_AT_accessibility(DW_ACCESS_public)
   13184              $C$DW$2289      .dwtag  DW_TAG_member
   13185                      .dwattr $C$DW$2289, DW_AT_type(*$C$DW$T$43)
   13186                      .dwattr $C$DW$2289, DW_AT_name("PVDD_UVFL")
   13187                      .dwattr $C$DW$2289, DW_AT_TI_symbol_name("_PVDD_UVFL")
   13188                      .dwattr $C$DW$2289, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13189                      .dwattr $C$DW$2289, DW_AT_accessibility(DW_ACCESS_public)
   13190              $C$DW$2290      .dwtag  DW_TAG_member
   13191                      .dwattr $C$DW$2290, DW_AT_type(*$C$DW$T$43)
   13192                      .dwattr $C$DW$2290, DW_AT_name("TEMP_FLAG4")
   13193                      .dwattr $C$DW$2290, DW_AT_TI_symbol_name("_TEMP_FLAG4")
   13194                      .dwattr $C$DW$2290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13195                      .dwattr $C$DW$2290, DW_AT_accessibility(DW_ACCESS_public)
   13196              $C$DW$2291      .dwtag  DW_TAG_member
   13197                      .dwattr $C$DW$2291, DW_AT_type(*$C$DW$T$43)
   13198                      .dwattr $C$DW$2291, DW_AT_name("STAT01_RSV1")
   13199                      .dwattr $C$DW$2291, DW_AT_TI_symbol_name("_STAT01_RSV1")
   13200                      .dwattr $C$DW$2291, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13201                      .dwattr $C$DW$2291, DW_AT_accessibility(DW_ACCESS_public)
   13202              $C$DW$2292      .dwtag  DW_TAG_member
   13203                      .dwattr $C$DW$2292, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  252

   13204                      .dwattr $C$DW$2292, DW_AT_name("FAULT")
   13205                      .dwattr $C$DW$2292, DW_AT_TI_symbol_name("_FAULT")
   13206                      .dwattr $C$DW$2292, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13207                      .dwattr $C$DW$2292, DW_AT_accessibility(DW_ACCESS_public)
   13208                      .dwendtag $C$DW$T$95
   13209              
   13210              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat01_t_")
   13211                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$95)
   13212                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   13213              
   13214              $C$DW$T$96      .dwtag  DW_TAG_structure_type
   13215                      .dwattr $C$DW$T$96, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
   13216                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x0b)
   13217              $C$DW$2293      .dwtag  DW_TAG_member
   13218                      .dwattr $C$DW$2293, DW_AT_type(*$C$DW$T$43)
   13219                      .dwattr $C$DW$2293, DW_AT_name("SNS_A_OCP")
   13220                      .dwattr $C$DW$2293, DW_AT_TI_symbol_name("_SNS_A_OCP")
   13221                      .dwattr $C$DW$2293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13222                      .dwattr $C$DW$2293, DW_AT_accessibility(DW_ACCESS_public)
   13223              $C$DW$2294      .dwtag  DW_TAG_member
   13224                      .dwattr $C$DW$2294, DW_AT_type(*$C$DW$T$43)
   13225                      .dwattr $C$DW$2294, DW_AT_name("SNS_B_OCP")
   13226                      .dwattr $C$DW$2294, DW_AT_TI_symbol_name("_SNS_B_OCP")
   13227                      .dwattr $C$DW$2294, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13228                      .dwattr $C$DW$2294, DW_AT_accessibility(DW_ACCESS_public)
   13229              $C$DW$2295      .dwtag  DW_TAG_member
   13230                      .dwattr $C$DW$2295, DW_AT_type(*$C$DW$T$43)
   13231                      .dwattr $C$DW$2295, DW_AT_name("SNS_C_OCP")
   13232                      .dwattr $C$DW$2295, DW_AT_TI_symbol_name("_SNS_C_OCP")
   13233                      .dwattr $C$DW$2295, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13234                      .dwattr $C$DW$2295, DW_AT_accessibility(DW_ACCESS_public)
   13235              $C$DW$2296      .dwtag  DW_TAG_member
   13236                      .dwattr $C$DW$2296, DW_AT_type(*$C$DW$T$43)
   13237                      .dwattr $C$DW$2296, DW_AT_name("STAT02_RSV2")
   13238                      .dwattr $C$DW$2296, DW_AT_TI_symbol_name("_STAT02_RSV2")
   13239                      .dwattr $C$DW$2296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13240                      .dwattr $C$DW$2296, DW_AT_accessibility(DW_ACCESS_public)
   13241              $C$DW$2297      .dwtag  DW_TAG_member
   13242                      .dwattr $C$DW$2297, DW_AT_type(*$C$DW$T$43)
   13243                      .dwattr $C$DW$2297, DW_AT_name("STAT02_RSV1")
   13244                      .dwattr $C$DW$2297, DW_AT_TI_symbol_name("_STAT02_RSV1")
   13245                      .dwattr $C$DW$2297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13246                      .dwattr $C$DW$2297, DW_AT_accessibility(DW_ACCESS_public)
   13247              $C$DW$2298      .dwtag  DW_TAG_member
   13248                      .dwattr $C$DW$2298, DW_AT_type(*$C$DW$T$43)
   13249                      .dwattr $C$DW$2298, DW_AT_name("FETLC_VDS")
   13250                      .dwattr $C$DW$2298, DW_AT_TI_symbol_name("_FETLC_VDS")
   13251                      .dwattr $C$DW$2298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13252                      .dwattr $C$DW$2298, DW_AT_accessibility(DW_ACCESS_public)
   13253              $C$DW$2299      .dwtag  DW_TAG_member
   13254                      .dwattr $C$DW$2299, DW_AT_type(*$C$DW$T$43)
   13255                      .dwattr $C$DW$2299, DW_AT_name("FETHC_VDS")
   13256                      .dwattr $C$DW$2299, DW_AT_TI_symbol_name("_FETHC_VDS")
   13257                      .dwattr $C$DW$2299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13258                      .dwattr $C$DW$2299, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  253

   13259              $C$DW$2300      .dwtag  DW_TAG_member
   13260                      .dwattr $C$DW$2300, DW_AT_type(*$C$DW$T$43)
   13261                      .dwattr $C$DW$2300, DW_AT_name("FETLB_VDS")
   13262                      .dwattr $C$DW$2300, DW_AT_TI_symbol_name("_FETLB_VDS")
   13263                      .dwattr $C$DW$2300, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13264                      .dwattr $C$DW$2300, DW_AT_accessibility(DW_ACCESS_public)
   13265              $C$DW$2301      .dwtag  DW_TAG_member
   13266                      .dwattr $C$DW$2301, DW_AT_type(*$C$DW$T$43)
   13267                      .dwattr $C$DW$2301, DW_AT_name("FETHB_VDS")
   13268                      .dwattr $C$DW$2301, DW_AT_TI_symbol_name("_FETHB_VDS")
   13269                      .dwattr $C$DW$2301, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13270                      .dwattr $C$DW$2301, DW_AT_accessibility(DW_ACCESS_public)
   13271              $C$DW$2302      .dwtag  DW_TAG_member
   13272                      .dwattr $C$DW$2302, DW_AT_type(*$C$DW$T$43)
   13273                      .dwattr $C$DW$2302, DW_AT_name("FETLA_VDS")
   13274                      .dwattr $C$DW$2302, DW_AT_TI_symbol_name("_FETLA_VDS")
   13275                      .dwattr $C$DW$2302, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13276                      .dwattr $C$DW$2302, DW_AT_accessibility(DW_ACCESS_public)
   13277              $C$DW$2303      .dwtag  DW_TAG_member
   13278                      .dwattr $C$DW$2303, DW_AT_type(*$C$DW$T$43)
   13279                      .dwattr $C$DW$2303, DW_AT_name("FETHA_VDS")
   13280                      .dwattr $C$DW$2303, DW_AT_TI_symbol_name("_FETHA_VDS")
   13281                      .dwattr $C$DW$2303, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13282                      .dwattr $C$DW$2303, DW_AT_accessibility(DW_ACCESS_public)
   13283                      .dwendtag $C$DW$T$96
   13284              
   13285              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat02_t_")
   13286                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$96)
   13287                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
   13288              
   13289              $C$DW$T$97      .dwtag  DW_TAG_structure_type
   13290                      .dwattr $C$DW$T$97, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
   13291                      .dwattr $C$DW$T$97, DW_AT_byte_size(0x0b)
   13292              $C$DW$2304      .dwtag  DW_TAG_member
   13293                      .dwattr $C$DW$2304, DW_AT_type(*$C$DW$T$43)
   13294                      .dwattr $C$DW$2304, DW_AT_name("VCPH_OVLO_ABS")
   13295                      .dwattr $C$DW$2304, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
   13296                      .dwattr $C$DW$2304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13297                      .dwattr $C$DW$2304, DW_AT_accessibility(DW_ACCESS_public)
   13298              $C$DW$2305      .dwtag  DW_TAG_member
   13299                      .dwattr $C$DW$2305, DW_AT_type(*$C$DW$T$43)
   13300                      .dwattr $C$DW$2305, DW_AT_name("VCPH_OVLO")
   13301                      .dwattr $C$DW$2305, DW_AT_TI_symbol_name("_VCPH_OVLO")
   13302                      .dwattr $C$DW$2305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13303                      .dwattr $C$DW$2305, DW_AT_accessibility(DW_ACCESS_public)
   13304              $C$DW$2306      .dwtag  DW_TAG_member
   13305                      .dwattr $C$DW$2306, DW_AT_type(*$C$DW$T$43)
   13306                      .dwattr $C$DW$2306, DW_AT_name("VCPH_UVLO2")
   13307                      .dwattr $C$DW$2306, DW_AT_TI_symbol_name("_VCPH_UVLO2")
   13308                      .dwattr $C$DW$2306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13309                      .dwattr $C$DW$2306, DW_AT_accessibility(DW_ACCESS_public)
   13310              $C$DW$2307      .dwtag  DW_TAG_member
   13311                      .dwattr $C$DW$2307, DW_AT_type(*$C$DW$T$43)
   13312                      .dwattr $C$DW$2307, DW_AT_name("STAT03_RSV2")
   13313                      .dwattr $C$DW$2307, DW_AT_TI_symbol_name("_STAT03_RSV2")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  254

   13314                      .dwattr $C$DW$2307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13315                      .dwattr $C$DW$2307, DW_AT_accessibility(DW_ACCESS_public)
   13316              $C$DW$2308      .dwtag  DW_TAG_member
   13317                      .dwattr $C$DW$2308, DW_AT_type(*$C$DW$T$43)
   13318                      .dwattr $C$DW$2308, DW_AT_name("VCP_LSD_UVLO2")
   13319                      .dwattr $C$DW$2308, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
   13320                      .dwattr $C$DW$2308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13321                      .dwattr $C$DW$2308, DW_AT_accessibility(DW_ACCESS_public)
   13322              $C$DW$2309      .dwtag  DW_TAG_member
   13323                      .dwattr $C$DW$2309, DW_AT_type(*$C$DW$T$43)
   13324                      .dwattr $C$DW$2309, DW_AT_name("AVDD_UVLO")
   13325                      .dwattr $C$DW$2309, DW_AT_TI_symbol_name("_AVDD_UVLO")
   13326                      .dwattr $C$DW$2309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13327                      .dwattr $C$DW$2309, DW_AT_accessibility(DW_ACCESS_public)
   13328              $C$DW$2310      .dwtag  DW_TAG_member
   13329                      .dwattr $C$DW$2310, DW_AT_type(*$C$DW$T$43)
   13330                      .dwattr $C$DW$2310, DW_AT_name("VREG_UV")
   13331                      .dwattr $C$DW$2310, DW_AT_TI_symbol_name("_VREG_UV")
   13332                      .dwattr $C$DW$2310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13333                      .dwattr $C$DW$2310, DW_AT_accessibility(DW_ACCESS_public)
   13334              $C$DW$2311      .dwtag  DW_TAG_member
   13335                      .dwattr $C$DW$2311, DW_AT_type(*$C$DW$T$43)
   13336                      .dwattr $C$DW$2311, DW_AT_name("STAT03_RSV1")
   13337                      .dwattr $C$DW$2311, DW_AT_TI_symbol_name("_STAT03_RSV1")
   13338                      .dwattr $C$DW$2311, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13339                      .dwattr $C$DW$2311, DW_AT_accessibility(DW_ACCESS_public)
   13340              $C$DW$2312      .dwtag  DW_TAG_member
   13341                      .dwattr $C$DW$2312, DW_AT_type(*$C$DW$T$43)
   13342                      .dwattr $C$DW$2312, DW_AT_name("OTS")
   13343                      .dwattr $C$DW$2312, DW_AT_TI_symbol_name("_OTS")
   13344                      .dwattr $C$DW$2312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13345                      .dwattr $C$DW$2312, DW_AT_accessibility(DW_ACCESS_public)
   13346              $C$DW$2313      .dwtag  DW_TAG_member
   13347                      .dwattr $C$DW$2313, DW_AT_type(*$C$DW$T$43)
   13348                      .dwattr $C$DW$2313, DW_AT_name("WD_FAULT")
   13349                      .dwattr $C$DW$2313, DW_AT_TI_symbol_name("_WD_FAULT")
   13350                      .dwattr $C$DW$2313, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13351                      .dwattr $C$DW$2313, DW_AT_accessibility(DW_ACCESS_public)
   13352              $C$DW$2314      .dwtag  DW_TAG_member
   13353                      .dwattr $C$DW$2314, DW_AT_type(*$C$DW$T$43)
   13354                      .dwattr $C$DW$2314, DW_AT_name("PVDD_UVLO2")
   13355                      .dwattr $C$DW$2314, DW_AT_TI_symbol_name("_PVDD_UVLO2")
   13356                      .dwattr $C$DW$2314, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13357                      .dwattr $C$DW$2314, DW_AT_accessibility(DW_ACCESS_public)
   13358                      .dwendtag $C$DW$T$97
   13359              
   13360              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat03_t_")
   13361                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$97)
   13362                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
   13363              
   13364              $C$DW$T$98      .dwtag  DW_TAG_structure_type
   13365                      .dwattr $C$DW$T$98, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
   13366                      .dwattr $C$DW$T$98, DW_AT_byte_size(0x0b)
   13367              $C$DW$2315      .dwtag  DW_TAG_member
   13368                      .dwattr $C$DW$2315, DW_AT_type(*$C$DW$T$43)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  255

   13369                      .dwattr $C$DW$2315, DW_AT_name("STAT04_RSV5")
   13370                      .dwattr $C$DW$2315, DW_AT_TI_symbol_name("_STAT04_RSV5")
   13371                      .dwattr $C$DW$2315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13372                      .dwattr $C$DW$2315, DW_AT_accessibility(DW_ACCESS_public)
   13373              $C$DW$2316      .dwtag  DW_TAG_member
   13374                      .dwattr $C$DW$2316, DW_AT_type(*$C$DW$T$43)
   13375                      .dwattr $C$DW$2316, DW_AT_name("STAT04_RSV4")
   13376                      .dwattr $C$DW$2316, DW_AT_TI_symbol_name("_STAT04_RSV4")
   13377                      .dwattr $C$DW$2316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   13378                      .dwattr $C$DW$2316, DW_AT_accessibility(DW_ACCESS_public)
   13379              $C$DW$2317      .dwtag  DW_TAG_member
   13380                      .dwattr $C$DW$2317, DW_AT_type(*$C$DW$T$43)
   13381                      .dwattr $C$DW$2317, DW_AT_name("STAT04_RSV3")
   13382                      .dwattr $C$DW$2317, DW_AT_TI_symbol_name("_STAT04_RSV3")
   13383                      .dwattr $C$DW$2317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   13384                      .dwattr $C$DW$2317, DW_AT_accessibility(DW_ACCESS_public)
   13385              $C$DW$2318      .dwtag  DW_TAG_member
   13386                      .dwattr $C$DW$2318, DW_AT_type(*$C$DW$T$43)
   13387                      .dwattr $C$DW$2318, DW_AT_name("STAT04_RSV2")
   13388                      .dwattr $C$DW$2318, DW_AT_TI_symbol_name("_STAT04_RSV2")
   13389                      .dwattr $C$DW$2318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   13390                      .dwattr $C$DW$2318, DW_AT_accessibility(DW_ACCESS_public)
   13391              $C$DW$2319      .dwtag  DW_TAG_member
   13392                      .dwattr $C$DW$2319, DW_AT_type(*$C$DW$T$43)
   13393                      .dwattr $C$DW$2319, DW_AT_name("STAT04_RSV1")
   13394                      .dwattr $C$DW$2319, DW_AT_TI_symbol_name("_STAT04_RSV1")
   13395                      .dwattr $C$DW$2319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   13396                      .dwattr $C$DW$2319, DW_AT_accessibility(DW_ACCESS_public)
   13397              $C$DW$2320      .dwtag  DW_TAG_member
   13398                      .dwattr $C$DW$2320, DW_AT_type(*$C$DW$T$43)
   13399                      .dwattr $C$DW$2320, DW_AT_name("FETLC_VGS")
   13400                      .dwattr $C$DW$2320, DW_AT_TI_symbol_name("_FETLC_VGS")
   13401                      .dwattr $C$DW$2320, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   13402                      .dwattr $C$DW$2320, DW_AT_accessibility(DW_ACCESS_public)
   13403              $C$DW$2321      .dwtag  DW_TAG_member
   13404                      .dwattr $C$DW$2321, DW_AT_type(*$C$DW$T$43)
   13405                      .dwattr $C$DW$2321, DW_AT_name("FETHC_VGS")
   13406                      .dwattr $C$DW$2321, DW_AT_TI_symbol_name("_FETHC_VGS")
   13407                      .dwattr $C$DW$2321, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   13408                      .dwattr $C$DW$2321, DW_AT_accessibility(DW_ACCESS_public)
   13409              $C$DW$2322      .dwtag  DW_TAG_member
   13410                      .dwattr $C$DW$2322, DW_AT_type(*$C$DW$T$43)
   13411                      .dwattr $C$DW$2322, DW_AT_name("FETLB_VGS")
   13412                      .dwattr $C$DW$2322, DW_AT_TI_symbol_name("_FETLB_VGS")
   13413                      .dwattr $C$DW$2322, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   13414                      .dwattr $C$DW$2322, DW_AT_accessibility(DW_ACCESS_public)
   13415              $C$DW$2323      .dwtag  DW_TAG_member
   13416                      .dwattr $C$DW$2323, DW_AT_type(*$C$DW$T$43)
   13417                      .dwattr $C$DW$2323, DW_AT_name("FETHB_VGS")
   13418                      .dwattr $C$DW$2323, DW_AT_TI_symbol_name("_FETHB_VGS")
   13419                      .dwattr $C$DW$2323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   13420                      .dwattr $C$DW$2323, DW_AT_accessibility(DW_ACCESS_public)
   13421              $C$DW$2324      .dwtag  DW_TAG_member
   13422                      .dwattr $C$DW$2324, DW_AT_type(*$C$DW$T$43)
   13423                      .dwattr $C$DW$2324, DW_AT_name("FETLA_VGS")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  256

   13424                      .dwattr $C$DW$2324, DW_AT_TI_symbol_name("_FETLA_VGS")
   13425                      .dwattr $C$DW$2324, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   13426                      .dwattr $C$DW$2324, DW_AT_accessibility(DW_ACCESS_public)
   13427              $C$DW$2325      .dwtag  DW_TAG_member
   13428                      .dwattr $C$DW$2325, DW_AT_type(*$C$DW$T$43)
   13429                      .dwattr $C$DW$2325, DW_AT_name("FETHA_VGS")
   13430                      .dwattr $C$DW$2325, DW_AT_TI_symbol_name("_FETHA_VGS")
   13431                      .dwattr $C$DW$2325, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   13432                      .dwattr $C$DW$2325, DW_AT_accessibility(DW_ACCESS_public)
   13433                      .dwendtag $C$DW$T$98
   13434              
   13435              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat04_t_")
   13436                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$98)
   13437                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
   13438              
   13439              $C$DW$T$111     .dwtag  DW_TAG_structure_type
   13440                      .dwattr $C$DW$T$111, DW_AT_name("_DRV_SPI_8305_Vars_t_")
   13441                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x61)
   13442              $C$DW$2326      .dwtag  DW_TAG_member
   13443                      .dwattr $C$DW$2326, DW_AT_type(*$C$DW$T$99)
   13444                      .dwattr $C$DW$2326, DW_AT_name("Stat_Reg_01")
   13445                      .dwattr $C$DW$2326, DW_AT_TI_symbol_name("_Stat_Reg_01")
   13446                      .dwattr $C$DW$2326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   13447                      .dwattr $C$DW$2326, DW_AT_accessibility(DW_ACCESS_public)
   13448              $C$DW$2327      .dwtag  DW_TAG_member
   13449                      .dwattr $C$DW$2327, DW_AT_type(*$C$DW$T$100)
   13450                      .dwattr $C$DW$2327, DW_AT_name("Stat_Reg_02")
   13451                      .dwattr $C$DW$2327, DW_AT_TI_symbol_name("_Stat_Reg_02")
   13452                      .dwattr $C$DW$2327, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   13453                      .dwattr $C$DW$2327, DW_AT_accessibility(DW_ACCESS_public)
   13454              $C$DW$2328      .dwtag  DW_TAG_member
   13455                      .dwattr $C$DW$2328, DW_AT_type(*$C$DW$T$101)
   13456                      .dwattr $C$DW$2328, DW_AT_name("Stat_Reg_03")
   13457                      .dwattr $C$DW$2328, DW_AT_TI_symbol_name("_Stat_Reg_03")
   13458                      .dwattr $C$DW$2328, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   13459                      .dwattr $C$DW$2328, DW_AT_accessibility(DW_ACCESS_public)
   13460              $C$DW$2329      .dwtag  DW_TAG_member
   13461                      .dwattr $C$DW$2329, DW_AT_type(*$C$DW$T$102)
   13462                      .dwattr $C$DW$2329, DW_AT_name("Stat_Reg_04")
   13463                      .dwattr $C$DW$2329, DW_AT_TI_symbol_name("_Stat_Reg_04")
   13464                      .dwattr $C$DW$2329, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   13465                      .dwattr $C$DW$2329, DW_AT_accessibility(DW_ACCESS_public)
   13466              $C$DW$2330      .dwtag  DW_TAG_member
   13467                      .dwattr $C$DW$2330, DW_AT_type(*$C$DW$T$103)
   13468                      .dwattr $C$DW$2330, DW_AT_name("Ctrl_Reg_05")
   13469                      .dwattr $C$DW$2330, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
   13470                      .dwattr $C$DW$2330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   13471                      .dwattr $C$DW$2330, DW_AT_accessibility(DW_ACCESS_public)
   13472              $C$DW$2331      .dwtag  DW_TAG_member
   13473                      .dwattr $C$DW$2331, DW_AT_type(*$C$DW$T$104)
   13474                      .dwattr $C$DW$2331, DW_AT_name("Ctrl_Reg_06")
   13475                      .dwattr $C$DW$2331, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
   13476                      .dwattr $C$DW$2331, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   13477                      .dwattr $C$DW$2331, DW_AT_accessibility(DW_ACCESS_public)
   13478              $C$DW$2332      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:20 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0272410                          PAGE  257

   13479                      .dwattr $C$DW$2332, DW_AT_type(*$C$DW$T$105)
   13480                      .dwattr $C$DW$2332, DW_AT_name("Ctrl_Reg_07")
   13481                      .dwattr $C$DW$2332, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
   13482                      .dwattr $C$DW$2332, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   13483                      .dwattr $C$DW$2332, DW_AT_accessibility(DW_ACCESS_public)
   13484              $C$DW$2333      .dwtag  DW_TAG_member
   13485                      .dwattr $C$DW$2333, DW_AT_type(*$C$DW$T$106)
   13486                      .dwattr $C$DW$2333, DW_AT_name("Ctrl_Reg_08")
   13487                      .dwattr $C$DW$2333, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
   13488                      .dwattr $C$DW$2333, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   13489                      .dwattr $C$DW$2333, DW_AT_accessibility(DW_ACCESS_public)
   13490              $C$DW$2334      .dwtag  DW_TAG_member
   13491                      .dwattr $C$DW$2334, DW_AT_type(*$C$DW$T$107)
   13492                      .dwattr $C$DW$2334, DW_AT_name("Ctrl_Reg_09")
   13493                      .dwattr $C$DW$2334, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
   13494                      .dwattr $C$DW$2334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
   13495                      .dwattr $C$DW$2334, DW_AT_accessibility(DW_ACCESS_public)
   13496              $C$DW$2335      .dwtag  DW_TAG_member
   13497                      .dwattr $C$DW$2335, DW_AT_type(*$C$DW$T$108)
   13498                      .dwattr $C$DW$2335, DW_AT_name("Ctrl_Reg_0A")
   13499                      .dwattr $C$DW$2335, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
   13500                      .dwattr $C$DW$2335, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   13501                      .dwattr $C$DW$2335, DW_AT_accessibility(DW_ACCESS_public)
   13502              $C$DW$2336      .dwtag  DW_TAG_member
   13503                      .dwattr $C$DW$2336, DW_AT_type(*$C$DW$T$109)
   13504                      .dwattr $C$DW$2336, DW_AT_name("Ctrl_Reg_0B")
   13505                      .dwattr $C$DW$2336, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
