TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0769610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:18 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../include/sci/sci.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem
      14              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\ac2000.exe -@C:\\Users\\Admiral\\AppData\\Local\\Te

    3054              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_IdleLine"), DW_AT_const_value(0x00)
    3055              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Mode_AddressBit"), DW_AT_const_value(0x08)
    3056                      .dwendtag $C$DW$T$35
    3057              
    3058              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Mode_e")
    3059                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3060                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3061              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    3062                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$36)
    3063              $C$DW$T$37      .dwtag  DW_TAG_const_type
    3064                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$256)
    3065              
    3066              $C$DW$T$38      .dwtag  DW_TAG_enumeration_type
    3067                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3068              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_One"), DW_AT_const_value(0x00)
    3069              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_NumStopBits_Two"), DW_AT_const_value(0x80)
    3070                      .dwendtag $C$DW$T$38
    3071              
    3072              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_NumStopBits_e")
    3073                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3074                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3075              $C$DW$259       .dwtag  DW_TAG_TI_far_type
    3076                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$39)
    3077              $C$DW$T$40      .dwtag  DW_TAG_const_type
    3078                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$259)
    3079              
    3080              $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0769610                          PAGE   58

    3081                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3082              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_Immediate"), DW_AT_const_value(0x00)
    3083              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_FreeRun"), DW_AT_const_value(0x08)
    3084              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Priority_AfterRxRxSeq"), DW_AT_const_value(0x10)
    3085                      .dwendtag $C$DW$T$41
    3086              
    3087              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Priority_e")
    3088                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    3089                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3090              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    3091                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$42)
    3092              $C$DW$T$43      .dwtag  DW_TAG_const_type
    3093                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$263)
    3094              
    3095              $C$DW$T$44      .dwtag  DW_TAG_enumeration_type
    3096                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    3097              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Odd"), DW_AT_const_value(0x00)
    3098              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_Parity_Even"), DW_AT_const_value(0x40)
    3099                      .dwendtag $C$DW$T$44
    3100              
    3101              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Parity_e")
    3102                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3103                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3104              $C$DW$266       .dwtag  DW_TAG_TI_far_type
    3105                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$45)
    3106              $C$DW$T$46      .dwtag  DW_TAG_const_type
    3107                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$266)
    3108              
    3109              $C$DW$T$47      .dwtag  DW_TAG_enumeration_type
    3110                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3111              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_Empty"), DW_AT_const_value(0x00)
    3112              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_1_Word"), DW_AT_const_value(0x01)
    3113              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_2_Words"), DW_AT_const_value(0x02)
    3114              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_3_Words"), DW_AT_const_value(0x03)
    3115              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("SCI_FifoLevel_4_Words"), DW_AT_const_value(0x04)
    3116                      .dwendtag $C$DW$T$47
    3117              
    3118              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_FifoLevel_e")
    3119                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3120                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3121              $C$DW$272       .dwtag  DW_TAG_TI_far_type
    3122                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$48)
    3123              $C$DW$T$49      .dwtag  DW_TAG_const_type
    3124                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$272)
    3125              
    3126              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3127                      .dwattr $C$DW$T$22, DW_AT_name("_SCI_Obj_")
    3128                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3129              $C$DW$273       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    3131                      .dwattr $C$DW$273, DW_AT_name("SCICCR")
    3132                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SCICCR")
    3133                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$274       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0769610                          PAGE   59

    3136                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    3137                      .dwattr $C$DW$274, DW_AT_name("SCICTL1")
    3138                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_SCICTL1")
    3139                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3140                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$275       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    3143                      .dwattr $C$DW$275, DW_AT_name("SCIHBAUD")
    3144                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_SCIHBAUD")
    3145                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3146                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$276       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3149                      .dwattr $C$DW$276, DW_AT_name("SCILBAUD")
    3150                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_SCILBAUD")
    3151                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3152                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$277       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    3155                      .dwattr $C$DW$277, DW_AT_name("SCICTL2")
    3156                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_SCICTL2")
    3157                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3158                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$278       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    3161                      .dwattr $C$DW$278, DW_AT_name("SCIRXST")
    3162                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_SCIRXST")
    3163                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3164                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$279       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    3167                      .dwattr $C$DW$279, DW_AT_name("SCIRXEMU")
    3168                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_SCIRXEMU")
    3169                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3170                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$280       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$20)
    3173                      .dwattr $C$DW$280, DW_AT_name("SCIRXBUF")
    3174                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_SCIRXBUF")
    3175                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3176                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$281       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    3179                      .dwattr $C$DW$281, DW_AT_name("rsvd_1")
    3180                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd_1")
    3181                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3182                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$282       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    3185                      .dwattr $C$DW$282, DW_AT_name("SCITXBUF")
    3186                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_SCITXBUF")
    3187                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3188                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$283       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0769610                          PAGE   60

    3191                      .dwattr $C$DW$283, DW_AT_name("SCIFFTX")
    3192                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_SCIFFTX")
    3193                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3194                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$284       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    3197                      .dwattr $C$DW$284, DW_AT_name("SCIFFRX")
    3198                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_SCIFFRX")
    3199                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3200                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$285       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    3203                      .dwattr $C$DW$285, DW_AT_name("SCIFFCT")
    3204                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_SCIFFCT")
    3205                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3206                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$286       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$21)
    3209                      .dwattr $C$DW$286, DW_AT_name("rsvd_2")
    3210                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_rsvd_2")
    3211                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3212                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$287       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    3215                      .dwattr $C$DW$287, DW_AT_name("SCIPRI")
    3216                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_SCIPRI")
    3217                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3218                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3219                      .dwendtag $C$DW$T$22
    3220              
    3221              $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Obj")
    3222                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$22)
    3223                      .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3224              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    3225                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$22)
    3226                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    3227              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("SCI_Handle")
    3228                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3229                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    3230              $C$DW$288       .dwtag  DW_TAG_TI_far_type
    3231                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$26)
    3232              $C$DW$T$51      .dwtag  DW_TAG_const_type
    3233                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$288)
    3234              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3235                      .dwattr $C$DW$T$2, DW_AT_name("void")
    3236              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3237                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3238                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3239              $C$DW$T$4       .dwtag  DW_TAG_base_type
    3240                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3241                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    3242                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3243              $C$DW$T$5       .dwtag  DW_TAG_base_type
    3244                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3245                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0769610                          PAGE   61

    3246                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3247              $C$DW$T$6       .dwtag  DW_TAG_base_type
    3248                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3249                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3250                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3251              $C$DW$T$7       .dwtag  DW_TAG_base_type
    3252                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3253                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3254                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    3255              $C$DW$T$8       .dwtag  DW_TAG_base_type
    3256                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3257                      .dwattr $C$DW$T$8, DW_AT_name("short")
    3258                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    3259              $C$DW$T$9       .dwtag  DW_TAG_base_type
    3260                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3261                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3262                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    3263              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3264                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3265                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3266                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3267              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3268                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3269                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
