TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:07 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/adc/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem

    2539              $C$DW$337       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_13"), DW_AT_const_value(0x0d)
    2540              $C$DW$338       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_14"), DW_AT_const_value(0x0e)
    2541              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_SocFrc_15"), DW_AT_const_value(0x0f)
    2542                      .dwendtag $C$DW$T$58
    2543              
    2544              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_SocFrc_e")
    2545                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2546                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2547              $C$DW$340       .dwtag  DW_TAG_TI_far_type
    2548                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$59)
    2549              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2550                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$340)
    2551              
    2552              $C$DW$T$61      .dwtag  DW_TAG_enumeration_type
    2553                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x01)
    2554              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Ext"), DW_AT_const_value(0x00)
    2555              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_TempSensorSrc_Int"), DW_AT_const_value(0x01)
    2556                      .dwendtag $C$DW$T$61
    2557              
    2558              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_TempSensorSrc_e")
    2559                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   49

    2560                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2561              $C$DW$343       .dwtag  DW_TAG_TI_far_type
    2562                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$62)
    2563              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2564                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$343)
    2565              
    2566              $C$DW$T$64      .dwtag  DW_TAG_enumeration_type
    2567                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2568              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Int"), DW_AT_const_value(0x00)
    2569              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_VoltageRefSrc_Ext"), DW_AT_const_value(0x08)
    2570                      .dwendtag $C$DW$T$64
    2571              
    2572              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_VoltageRefSrc_e")
    2573                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    2574                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    2575              $C$DW$346       .dwtag  DW_TAG_TI_far_type
    2576                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$65)
    2577              $C$DW$T$66      .dwtag  DW_TAG_const_type
    2578                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$346)
    2579              
    2580              $C$DW$T$67      .dwtag  DW_TAG_enumeration_type
    2581                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    2582              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_1"), DW_AT_const_value(0x00)
    2583              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_DivideSelect_ClkIn_by_2"), DW_AT_const_value(0x01)
    2584                      .dwendtag $C$DW$T$67
    2585              
    2586              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_DivideSelect_e")
    2587                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2588                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2589              $C$DW$349       .dwtag  DW_TAG_TI_far_type
    2590                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$68)
    2591              $C$DW$T$69      .dwtag  DW_TAG_const_type
    2592                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$349)
    2593              
    2594              $C$DW$T$74      .dwtag  DW_TAG_enumeration_type
    2595                      .dwattr $C$DW$T$74, DW_AT_byte_size(0x01)
    2596              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_NoIntTriggersSOC"), DW_AT_const_value(0x00)
    2597              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int1TriggersSOC"), DW_AT_const_value(0x01)
    2598              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("ADC_Int2TriggersSOC"), DW_AT_const_value(0x02)
    2599                      .dwendtag $C$DW$T$74
    2600              
    2601              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_IntTriggerSOC_e")
    2602                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2603                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2604              $C$DW$353       .dwtag  DW_TAG_TI_far_type
    2605                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$75)
    2606              $C$DW$T$76      .dwtag  DW_TAG_const_type
    2607                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$353)
    2608              
    2609              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2610                      .dwattr $C$DW$T$27, DW_AT_name("_ADC_Obj_")
    2611                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x6650)
    2612              $C$DW$354       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    2614                      .dwattr $C$DW$354, DW_AT_name("ADCRESULT")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   50

    2615                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_ADCRESULT")
    2616                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$355       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$22)
    2620                      .dwattr $C$DW$355, DW_AT_name("resvd_1")
    2621                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_resvd_1")
    2622                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2623                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$356       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$20)
    2626                      .dwattr $C$DW$356, DW_AT_name("ADCCTL1")
    2627                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_ADCCTL1")
    2628                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    2629                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$357       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$20)
    2632                      .dwattr $C$DW$357, DW_AT_name("ADCCTL2")
    2633                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_ADCCTL2")
    2634                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    2635                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2636              $C$DW$358       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
    2638                      .dwattr $C$DW$358, DW_AT_name("rsvd_2")
    2639                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_rsvd_2")
    2640                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    2641                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2642              $C$DW$359       .dwtag  DW_TAG_member
    2643                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    2644                      .dwattr $C$DW$359, DW_AT_name("ADCINTFLG")
    2645                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_ADCINTFLG")
    2646                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    2647                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$360       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$20)
    2650                      .dwattr $C$DW$360, DW_AT_name("ADCINTFLGCLR")
    2651                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    2652                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    2653                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$361       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    2656                      .dwattr $C$DW$361, DW_AT_name("ADCINTOVF")
    2657                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_ADCINTOVF")
    2658                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    2659                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$362       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    2662                      .dwattr $C$DW$362, DW_AT_name("ADCINTOVFCLR")
    2663                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    2664                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    2665                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$363       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$24)
    2668                      .dwattr $C$DW$363, DW_AT_name("INTSELxNy")
    2669                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_INTSELxNy")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   51

    2670                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    2671                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$364       .dwtag  DW_TAG_member
    2673                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$25)
    2674                      .dwattr $C$DW$364, DW_AT_name("rsvd_3")
    2675                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd_3")
    2676                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    2677                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2678              $C$DW$365       .dwtag  DW_TAG_member
    2679                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$20)
    2680                      .dwattr $C$DW$365, DW_AT_name("SOCPRICTRL")
    2681                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_SOCPRICTRL")
    2682                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    2683                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2684              $C$DW$366       .dwtag  DW_TAG_member
    2685                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$20)
    2686                      .dwattr $C$DW$366, DW_AT_name("rsvd_4")
    2687                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_rsvd_4")
    2688                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    2689                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$367       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$20)
    2692                      .dwattr $C$DW$367, DW_AT_name("ADCSAMPLEMODE")
    2693                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    2694                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    2695                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$368       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$20)
    2698                      .dwattr $C$DW$368, DW_AT_name("rsvd_5")
    2699                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd_5")
    2700                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    2701                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$369       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$20)
    2704                      .dwattr $C$DW$369, DW_AT_name("ADCINTSOCSEL1")
    2705                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    2706                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    2707                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2708              $C$DW$370       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$20)
    2710                      .dwattr $C$DW$370, DW_AT_name("ADCINTSOCSEL2")
    2711                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    2712                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    2713                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$371       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
    2716                      .dwattr $C$DW$371, DW_AT_name("rsvd_6")
    2717                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd_6")
    2718                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    2719                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2720              $C$DW$372       .dwtag  DW_TAG_member
    2721                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    2722                      .dwattr $C$DW$372, DW_AT_name("ADCSOCFLG1")
    2723                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    2724                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   52

    2725                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2726              $C$DW$373       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$20)
    2728                      .dwattr $C$DW$373, DW_AT_name("rsvd_7")
    2729                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd_7")
    2730                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    2731                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$374       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$20)
    2734                      .dwattr $C$DW$374, DW_AT_name("ADCSOCFRC1")
    2735                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    2736                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    2737                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$375       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$20)
    2740                      .dwattr $C$DW$375, DW_AT_name("rsvd_8")
    2741                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_rsvd_8")
    2742                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    2743                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$376       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$20)
    2746                      .dwattr $C$DW$376, DW_AT_name("ADCSOCOVF1")
    2747                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    2748                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    2749                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$377       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$20)
    2752                      .dwattr $C$DW$377, DW_AT_name("rsvd_9")
    2753                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_rsvd_9")
    2754                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    2755                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$378       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$20)
    2758                      .dwattr $C$DW$378, DW_AT_name("ADCSOCOVFCLR1")
    2759                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    2760                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    2761                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$379       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$20)
    2764                      .dwattr $C$DW$379, DW_AT_name("rsvd_10")
    2765                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd_10")
    2766                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    2767                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$380       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$21)
    2770                      .dwattr $C$DW$380, DW_AT_name("ADCSOCxCTL")
    2771                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    2772                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    2773                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$381       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$21)
    2776                      .dwattr $C$DW$381, DW_AT_name("rsvd_11")
    2777                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd_11")
    2778                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    2779                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   53

    2780              $C$DW$382       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$20)
    2782                      .dwattr $C$DW$382, DW_AT_name("ADCREFTRIM")
    2783                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ADCREFTRIM")
    2784                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    2785                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$383       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$20)
    2788                      .dwattr $C$DW$383, DW_AT_name("ADCOFFTRIM")
    2789                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    2790                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    2791                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$384       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$26)
    2794                      .dwattr $C$DW$384, DW_AT_name("resvd_12")
    2795                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_resvd_12")
    2796                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    2797                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$385       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$20)
    2800                      .dwattr $C$DW$385, DW_AT_name("ADCREV")
    2801                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_ADCREV")
    2802                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    2803                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2804                      .dwendtag $C$DW$T$27
    2805              
    2806              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    2807                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$27)
    2808                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2809              $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2810                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$27)
    2811                      .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    2812              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    2813                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    2814                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2815              $C$DW$386       .dwtag  DW_TAG_TI_far_type
    2816                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$71)
    2817              $C$DW$T$78      .dwtag  DW_TAG_const_type
    2818                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$386)
    2819              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2820                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2821              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2822                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2823                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2824              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2825                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2826                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2827                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2828              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2829                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2830                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2831                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2832              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2833                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2834                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0886810                          PAGE   54

    2835                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2836              $C$DW$T$7       .dwtag  DW_TAG_base_type
    2837                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2838                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2839                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2840              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2841                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2842                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2843                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2844              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2845                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2846                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2847                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2848              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2849                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2850                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2851                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2852              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2853                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2854                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
