TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0907210                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:07 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/cap/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem

     981              $C$DW$84        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Event_2"), DW_AT_const_value(0x01)
     982              $C$DW$85        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Event_3"), DW_AT_const_value(0x02)
     983              $C$DW$86        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Event_4"), DW_AT_const_value(0x03)
     984                      .dwendtag $C$DW$T$28
     985              
     986              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Event_e")
     987                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
     988                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     989              $C$DW$87        .dwtag  DW_TAG_TI_far_type
     990                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
     991              $C$DW$T$30      .dwtag  DW_TAG_const_type
     992                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$87)
     993              
     994              $C$DW$T$31      .dwtag  DW_TAG_enumeration_type
     995                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     996              $C$DW$88        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Polarity_Rising"), DW_AT_const_value(0x00)
     997              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Polarity_Falling"), DW_AT_const_value(0x01)
     998                      .dwendtag $C$DW$T$31
     999              
    1000              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Polarity_e")
    1001                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1002                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1003              $C$DW$90        .dwtag  DW_TAG_TI_far_type
    1004                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$32)
    1005              $C$DW$T$33      .dwtag  DW_TAG_const_type
    1006                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$90)
    1007              
    1008              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    1009                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1010              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Reset_Disable"), DW_AT_const_value(0x00)
    1011              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Reset_Enable"), DW_AT_const_value(0x01)
    1012                      .dwendtag $C$DW$T$34
    1013              
    1014              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Reset_e")
    1015                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1016                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1017              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    1018                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$35)
    1019              $C$DW$T$36      .dwtag  DW_TAG_const_type
    1020                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$93)
    1021              
    1022              $C$DW$T$37      .dwtag  DW_TAG_enumeration_type
    1023                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1024              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Stop_Wrap_CEVT1"), DW_AT_const_value(0x00)
    1025              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Stop_Wrap_CEVT2"), DW_AT_const_value(0x02)
    1026              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Stop_Wrap_CEVT3"), DW_AT_const_value(0x04)
    1027              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Stop_Wrap_CEVT4"), DW_AT_const_value(0x06)
    1028                      .dwendtag $C$DW$T$37
    1029              
    1030              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Stop_Wrap_e")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0907210                          PAGE   20

    1031                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1032                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1033              $C$DW$98        .dwtag  DW_TAG_TI_far_type
    1034                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$38)
    1035              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1036                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$98)
    1037              
    1038              $C$DW$T$40      .dwtag  DW_TAG_enumeration_type
    1039                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1040              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_SyncOut_SyncIn"), DW_AT_const_value(0x00)
    1041              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_SyncOut_CTRPRD"), DW_AT_const_value(0x40)
    1042              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_SyncOut_Disable"), DW_AT_const_value(0x80)
    1043                      .dwendtag $C$DW$T$40
    1044              
    1045              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_SyncOut_e")
    1046                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1047                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1048              $C$DW$102       .dwtag  DW_TAG_TI_far_type
    1049                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$41)
    1050              $C$DW$T$42      .dwtag  DW_TAG_const_type
    1051                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$102)
    1052              
    1053              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1054                      .dwattr $C$DW$T$24, DW_AT_name("_CAP_Obj_")
    1055                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x1a)
    1056              $C$DW$103       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1058                      .dwattr $C$DW$103, DW_AT_name("TSCTR")
    1059                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_TSCTR")
    1060                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$104       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1064                      .dwattr $C$DW$104, DW_AT_name("CTRPHS")
    1065                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CTRPHS")
    1066                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1067                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$105       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
    1070                      .dwattr $C$DW$105, DW_AT_name("CAP1")
    1071                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CAP1")
    1072                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1073                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$106       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1076                      .dwattr $C$DW$106, DW_AT_name("CAP2")
    1077                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CAP2")
    1078                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1079                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$107       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1082                      .dwattr $C$DW$107, DW_AT_name("CAP3")
    1083                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CAP3")
    1084                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1085                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0907210                          PAGE   21

    1086              $C$DW$108       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1088                      .dwattr $C$DW$108, DW_AT_name("CAP4")
    1089                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CAP4")
    1090                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1091                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$109       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$23)
    1094                      .dwattr $C$DW$109, DW_AT_name("Rsvd_1")
    1095                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Rsvd_1")
    1096                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1097                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$110       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1100                      .dwattr $C$DW$110, DW_AT_name("ECCTL1")
    1101                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ECCTL1")
    1102                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1103                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$111       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1106                      .dwattr $C$DW$111, DW_AT_name("ECCTL2")
    1107                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ECCTL2")
    1108                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1109                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$112       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
    1112                      .dwattr $C$DW$112, DW_AT_name("ECEINT")
    1113                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_ECEINT")
    1114                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1115                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$113       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$22)
    1118                      .dwattr $C$DW$113, DW_AT_name("ECEFLG")
    1119                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_ECEFLG")
    1120                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1121                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$114       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
    1124                      .dwattr $C$DW$114, DW_AT_name("ECECLR")
    1125                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_ECECLR")
    1126                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1127                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$115       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$22)
    1130                      .dwattr $C$DW$115, DW_AT_name("ECEFRC")
    1131                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_ECEFRC")
    1132                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1133                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1134                      .dwendtag $C$DW$T$24
    1135              
    1136              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Obj")
    1137                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$24)
    1138                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1139              $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1140                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:07 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0907210                          PAGE   22

    1141                      .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    1142              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
    1143                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1144                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1145              $C$DW$116       .dwtag  DW_TAG_TI_far_type
    1146                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$45)
    1147              $C$DW$T$46      .dwtag  DW_TAG_const_type
    1148                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$116)
    1149              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1150                      .dwattr $C$DW$T$2, DW_AT_name("void")
    1151              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1152                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1153                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1154              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1155                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1156                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1157                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1158              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1159                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1160                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1161                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1162              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1163                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1164                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1165                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1166              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1167                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1168                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1169                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1170              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1171                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1172                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1173                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1174              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1175                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1176                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1177                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1178              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1179                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1180                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1181                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1182              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1183                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1184                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
