TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:08 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0794010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:07 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/clk/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem

    2607                      .dwendtag $C$DW$T$42
    2608              
    2609              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Osc2Src_e")
    2610                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2611                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2612              $C$DW$218       .dwtag  DW_TAG_TI_far_type
    2613                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$43)
    2614              $C$DW$T$44      .dwtag  DW_TAG_const_type
    2615                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$218)
    2616              
    2617              $C$DW$T$45      .dwtag  DW_TAG_enumeration_type
    2618                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2619              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio38"), DW_AT_const_value(0x00)
    2620              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_XClkInSrc_Gpio19"), DW_AT_const_value(0x40)
    2621                      .dwendtag $C$DW$T$45
    2622              
    2623              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_XClkInSrc_e")
    2624                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2625                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2626              $C$DW$221       .dwtag  DW_TAG_TI_far_type
    2627                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$46)
    2628              $C$DW$T$47      .dwtag  DW_TAG_const_type
    2629                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$221)
    2630              
    2631              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    2632                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2633              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_1"), DW_AT_const_value(0x00)
    2634              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_2"), DW_AT_const_value(0x20)
    2635              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_4"), DW_AT_const_value(0x40)
    2636              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_8"), DW_AT_const_value(0x60)
    2637              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2PreScaler_by_16"), DW_AT_const_value(0x80)
    2638                      .dwendtag $C$DW$T$48
    2639              
    2640              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2PreScaler_e")
    2641                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    2642                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2643              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    2644                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$49)
    2645              $C$DW$T$50      .dwtag  DW_TAG_const_type
    2646                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$227)
    2647              
    2648              $C$DW$T$51      .dwtag  DW_TAG_enumeration_type
    2649                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2650              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_SysClk"), DW_AT_const_value(0x00)
    2651              $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_ExtOsc"), DW_AT_const_value(0x08)
    2652              $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc1"), DW_AT_const_value(0x10)
    2653              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_Timer2Src_IntOsc2"), DW_AT_const_value(0x18)
    2654                      .dwendtag $C$DW$T$51
    2655              
    2656              $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Timer2Src_e")
    2657                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:08 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0794010                          PAGE   50

    2658                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    2659              $C$DW$232       .dwtag  DW_TAG_TI_far_type
    2660                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$52)
    2661              $C$DW$T$53      .dwtag  DW_TAG_const_type
    2662                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$232)
    2663              
    2664              $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    2665                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    2666              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_IntOsc1"), DW_AT_const_value(0x00)
    2667              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("CLK_WdClkSrc_ExtOscOrIntOsc2"), DW_AT_const_value(0x04
    2668                      .dwendtag $C$DW$T$54
    2669              
    2670              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_WdClkSrc_e")
    2671                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    2672                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    2673              $C$DW$235       .dwtag  DW_TAG_TI_far_type
    2674                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$55)
    2675              $C$DW$T$56      .dwtag  DW_TAG_const_type
    2676                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$235)
    2677              
    2678              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2679                      .dwattr $C$DW$T$23, DW_AT_name("_CLK_Obj_")
    2680                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x11)
    2681              $C$DW$236       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$20)
    2683                      .dwattr $C$DW$236, DW_AT_name("XCLK")
    2684                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_XCLK")
    2685                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2686                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2687              $C$DW$237       .dwtag  DW_TAG_member
    2688                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$20)
    2689                      .dwattr $C$DW$237, DW_AT_name("rsvd_1")
    2690                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd_1")
    2691                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2692                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2693              $C$DW$238       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$20)
    2695                      .dwattr $C$DW$238, DW_AT_name("CLKCTL")
    2696                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_CLKCTL")
    2697                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2698                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2699              $C$DW$239       .dwtag  DW_TAG_member
    2700                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$21)
    2701                      .dwattr $C$DW$239, DW_AT_name("rsvd_2")
    2702                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd_2")
    2703                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2704                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2705              $C$DW$240       .dwtag  DW_TAG_member
    2706                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
    2707                      .dwattr $C$DW$240, DW_AT_name("LOSPCP")
    2708                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_LOSPCP")
    2709                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2710                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2711              $C$DW$241       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:08 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0794010                          PAGE   51

    2713                      .dwattr $C$DW$241, DW_AT_name("PCLKCR0")
    2714                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR0")
    2715                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2716                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2717              $C$DW$242       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$20)
    2719                      .dwattr $C$DW$242, DW_AT_name("PCLKCR1")
    2720                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR1")
    2721                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2722                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$243       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$22)
    2725                      .dwattr $C$DW$243, DW_AT_name("rsvd_3")
    2726                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd_3")
    2727                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2728                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$244       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$20)
    2731                      .dwattr $C$DW$244, DW_AT_name("PCLKCR3")
    2732                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR3")
    2733                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2734                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2735                      .dwendtag $C$DW$T$23
    2736              
    2737              $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Obj")
    2738                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$23)
    2739                      .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2740              $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2741                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$23)
    2742                      .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2743              $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    2744                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2745                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2746              $C$DW$245       .dwtag  DW_TAG_TI_far_type
    2747                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$59)
    2748              $C$DW$T$60      .dwtag  DW_TAG_const_type
    2749                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$245)
    2750              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2751                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2752              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2753                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2754                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2755              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2756                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2757                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2758                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2759              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2760                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2761                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2762                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2763              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2764                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2765                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2766                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2767              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:08 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0794010                          PAGE   52

    2768                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2769                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2770                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    2771              $C$DW$T$8       .dwtag  DW_TAG_base_type
    2772                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2773                      .dwattr $C$DW$T$8, DW_AT_name("short")
    2774                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    2775              $C$DW$T$9       .dwtag  DW_TAG_base_type
    2776                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2777                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2778                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2779              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2780                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2781                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2782                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2783              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2784                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2785                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
