TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:08 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/ctrl/src/32b/ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              
      14              ;**************************************************************
      15              ;* FUNCTION SYNONYMS                                          *

    6517              $C$DW$648       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    6518              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    6519              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    6520              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    6521              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    6522              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    6523              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
    6524              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    6525              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    6526              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    6527              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    6528              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    6529                      .dwendtag $C$DW$T$168
    6530              
    6531              $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    6532                      .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$168)
    6533                      .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    6534              
    6535              $C$DW$T$178     .dwtag  DW_TAG_enumeration_type
    6536                      .dwattr $C$DW$T$178, DW_AT_byte_size(0x01)
    6537              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Error"), DW_AT_const_value(0x00)
    6538              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Idle"), DW_AT_const_value(0x01)
    6539              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RoverL"), DW_AT_const_value(0x02)
    6540              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rs"), DW_AT_const_value(0x03)
    6541              $C$DW$664       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampUp"), DW_AT_const_value(0x04)
    6542              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_IdRated"), DW_AT_const_value(0x05)
    6543              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux_OL"), DW_AT_const_value(0x06)
    6544              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RatedFlux"), DW_AT_const_value(0x07)
    6545              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_RampDown"), DW_AT_const_value(0x08)
    6546              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_LockRotor"), DW_AT_const_value(0x09)
    6547              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Ls"), DW_AT_const_value(0x0a)
    6548              $C$DW$671       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_Rr"), DW_AT_const_value(0x0b)
    6549              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_MotorIdentified"), DW_AT_const_value(0x0c)
    6550              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_State_OnLine"), DW_AT_const_value(0x0d)
    6551              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("EST_numStates"), DW_AT_const_value(0x0e)
    6552                      .dwendtag $C$DW$T$178
    6553              
    6554              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("EST_State_e")
    6555                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    6556                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    6557              
    6558              $C$DW$T$183     .dwtag  DW_TAG_enumeration_type
    6559                      .dwattr $C$DW$T$183, DW_AT_byte_size(0x01)
    6560              $C$DW$675       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    6561              $C$DW$676       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    6562              $C$DW$677       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    6563                      .dwendtag $C$DW$T$183
    6564              
    6565              $C$DW$T$184     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    6566                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$183)
    6567                      .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    6568              $C$DW$678       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  127

    6569                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$184)
    6570              $C$DW$T$185     .dwtag  DW_TAG_const_type
    6571                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$678)
    6572              
    6573              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6574                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    6575                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    6576              $C$DW$679       .dwtag  DW_TAG_member
    6577                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$24)
    6578                      .dwattr $C$DW$679, DW_AT_name("ADCRESULT")
    6579                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_ADCRESULT")
    6580                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6581                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6582              $C$DW$680       .dwtag  DW_TAG_member
    6583                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    6584                      .dwattr $C$DW$680, DW_AT_name("resvd_1")
    6585                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_resvd_1")
    6586                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6587                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6588              $C$DW$681       .dwtag  DW_TAG_member
    6589                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$23)
    6590                      .dwattr $C$DW$681, DW_AT_name("ADCCTL1")
    6591                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_ADCCTL1")
    6592                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    6593                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6594              $C$DW$682       .dwtag  DW_TAG_member
    6595                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    6596                      .dwattr $C$DW$682, DW_AT_name("ADCCTL2")
    6597                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCCTL2")
    6598                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    6599                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6600              $C$DW$683       .dwtag  DW_TAG_member
    6601                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$26)
    6602                      .dwattr $C$DW$683, DW_AT_name("rsvd_2")
    6603                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_rsvd_2")
    6604                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    6605                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6606              $C$DW$684       .dwtag  DW_TAG_member
    6607                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$23)
    6608                      .dwattr $C$DW$684, DW_AT_name("ADCINTFLG")
    6609                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_ADCINTFLG")
    6610                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    6611                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6612              $C$DW$685       .dwtag  DW_TAG_member
    6613                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    6614                      .dwattr $C$DW$685, DW_AT_name("ADCINTFLGCLR")
    6615                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    6616                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    6617                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6618              $C$DW$686       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$23)
    6620                      .dwattr $C$DW$686, DW_AT_name("ADCINTOVF")
    6621                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_ADCINTOVF")
    6622                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    6623                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  128

    6624              $C$DW$687       .dwtag  DW_TAG_member
    6625                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$23)
    6626                      .dwattr $C$DW$687, DW_AT_name("ADCINTOVFCLR")
    6627                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    6628                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    6629                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6630              $C$DW$688       .dwtag  DW_TAG_member
    6631                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$27)
    6632                      .dwattr $C$DW$688, DW_AT_name("INTSELxNy")
    6633                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_INTSELxNy")
    6634                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    6635                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6636              $C$DW$689       .dwtag  DW_TAG_member
    6637                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$28)
    6638                      .dwattr $C$DW$689, DW_AT_name("rsvd_3")
    6639                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_rsvd_3")
    6640                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    6641                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6642              $C$DW$690       .dwtag  DW_TAG_member
    6643                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$23)
    6644                      .dwattr $C$DW$690, DW_AT_name("SOCPRICTRL")
    6645                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_SOCPRICTRL")
    6646                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    6647                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6648              $C$DW$691       .dwtag  DW_TAG_member
    6649                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$23)
    6650                      .dwattr $C$DW$691, DW_AT_name("rsvd_4")
    6651                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_rsvd_4")
    6652                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    6653                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6654              $C$DW$692       .dwtag  DW_TAG_member
    6655                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$23)
    6656                      .dwattr $C$DW$692, DW_AT_name("ADCSAMPLEMODE")
    6657                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    6658                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    6659                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6660              $C$DW$693       .dwtag  DW_TAG_member
    6661                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    6662                      .dwattr $C$DW$693, DW_AT_name("rsvd_5")
    6663                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_rsvd_5")
    6664                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    6665                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6666              $C$DW$694       .dwtag  DW_TAG_member
    6667                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    6668                      .dwattr $C$DW$694, DW_AT_name("ADCINTSOCSEL1")
    6669                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    6670                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    6671                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6672              $C$DW$695       .dwtag  DW_TAG_member
    6673                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    6674                      .dwattr $C$DW$695, DW_AT_name("ADCINTSOCSEL2")
    6675                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    6676                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    6677                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6678              $C$DW$696       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  129

    6679                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$26)
    6680                      .dwattr $C$DW$696, DW_AT_name("rsvd_6")
    6681                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_rsvd_6")
    6682                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    6683                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6684              $C$DW$697       .dwtag  DW_TAG_member
    6685                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    6686                      .dwattr $C$DW$697, DW_AT_name("ADCSOCFLG1")
    6687                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    6688                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    6689                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6690              $C$DW$698       .dwtag  DW_TAG_member
    6691                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    6692                      .dwattr $C$DW$698, DW_AT_name("rsvd_7")
    6693                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_rsvd_7")
    6694                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    6695                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6696              $C$DW$699       .dwtag  DW_TAG_member
    6697                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$23)
    6698                      .dwattr $C$DW$699, DW_AT_name("ADCSOCFRC1")
    6699                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    6700                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    6701                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6702              $C$DW$700       .dwtag  DW_TAG_member
    6703                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$23)
    6704                      .dwattr $C$DW$700, DW_AT_name("rsvd_8")
    6705                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_rsvd_8")
    6706                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    6707                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6708              $C$DW$701       .dwtag  DW_TAG_member
    6709                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$23)
    6710                      .dwattr $C$DW$701, DW_AT_name("ADCSOCOVF1")
    6711                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    6712                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    6713                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6714              $C$DW$702       .dwtag  DW_TAG_member
    6715                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    6716                      .dwattr $C$DW$702, DW_AT_name("rsvd_9")
    6717                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_rsvd_9")
    6718                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    6719                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6720              $C$DW$703       .dwtag  DW_TAG_member
    6721                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    6722                      .dwattr $C$DW$703, DW_AT_name("ADCSOCOVFCLR1")
    6723                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    6724                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    6725                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6726              $C$DW$704       .dwtag  DW_TAG_member
    6727                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    6728                      .dwattr $C$DW$704, DW_AT_name("rsvd_10")
    6729                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_rsvd_10")
    6730                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    6731                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6732              $C$DW$705       .dwtag  DW_TAG_member
    6733                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  130

    6734                      .dwattr $C$DW$705, DW_AT_name("ADCSOCxCTL")
    6735                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    6736                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    6737                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6738              $C$DW$706       .dwtag  DW_TAG_member
    6739                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$24)
    6740                      .dwattr $C$DW$706, DW_AT_name("rsvd_11")
    6741                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_rsvd_11")
    6742                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    6743                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6744              $C$DW$707       .dwtag  DW_TAG_member
    6745                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    6746                      .dwattr $C$DW$707, DW_AT_name("ADCREFTRIM")
    6747                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_ADCREFTRIM")
    6748                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    6749                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6750              $C$DW$708       .dwtag  DW_TAG_member
    6751                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    6752                      .dwattr $C$DW$708, DW_AT_name("ADCOFFTRIM")
    6753                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    6754                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    6755                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6756              $C$DW$709       .dwtag  DW_TAG_member
    6757                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$29)
    6758                      .dwattr $C$DW$709, DW_AT_name("resvd_12")
    6759                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_resvd_12")
    6760                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    6761                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6762              $C$DW$710       .dwtag  DW_TAG_member
    6763                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    6764                      .dwattr $C$DW$710, DW_AT_name("ADCREV")
    6765                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_ADCREV")
    6766                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    6767                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6768                      .dwendtag $C$DW$T$30
    6769              
    6770              $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    6771                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$30)
    6772                      .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    6773              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    6774                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    6775                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    6776              
    6777              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6778                      .dwattr $C$DW$T$34, DW_AT_name("_CAP_Obj_")
    6779                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x1a)
    6780              $C$DW$711       .dwtag  DW_TAG_member
    6781                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$32)
    6782                      .dwattr $C$DW$711, DW_AT_name("TSCTR")
    6783                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_TSCTR")
    6784                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6785                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6786              $C$DW$712       .dwtag  DW_TAG_member
    6787                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$32)
    6788                      .dwattr $C$DW$712, DW_AT_name("CTRPHS")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  131

    6789                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_CTRPHS")
    6790                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6791                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6792              $C$DW$713       .dwtag  DW_TAG_member
    6793                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$32)
    6794                      .dwattr $C$DW$713, DW_AT_name("CAP1")
    6795                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_CAP1")
    6796                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6797                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    6798              $C$DW$714       .dwtag  DW_TAG_member
    6799                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$32)
    6800                      .dwattr $C$DW$714, DW_AT_name("CAP2")
    6801                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_CAP2")
    6802                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6803                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    6804              $C$DW$715       .dwtag  DW_TAG_member
    6805                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$32)
    6806                      .dwattr $C$DW$715, DW_AT_name("CAP3")
    6807                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_CAP3")
    6808                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6809                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    6810              $C$DW$716       .dwtag  DW_TAG_member
    6811                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$32)
    6812                      .dwattr $C$DW$716, DW_AT_name("CAP4")
    6813                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_CAP4")
    6814                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6815                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    6816              $C$DW$717       .dwtag  DW_TAG_member
    6817                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$33)
    6818                      .dwattr $C$DW$717, DW_AT_name("Rsvd_1")
    6819                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_Rsvd_1")
    6820                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6821                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    6822              $C$DW$718       .dwtag  DW_TAG_member
    6823                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$23)
    6824                      .dwattr $C$DW$718, DW_AT_name("ECCTL1")
    6825                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_ECCTL1")
    6826                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6827                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    6828              $C$DW$719       .dwtag  DW_TAG_member
    6829                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$23)
    6830                      .dwattr $C$DW$719, DW_AT_name("ECCTL2")
    6831                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_ECCTL2")
    6832                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6833                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    6834              $C$DW$720       .dwtag  DW_TAG_member
    6835                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$23)
    6836                      .dwattr $C$DW$720, DW_AT_name("ECEINT")
    6837                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_ECEINT")
    6838                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6839                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    6840              $C$DW$721       .dwtag  DW_TAG_member
    6841                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$23)
    6842                      .dwattr $C$DW$721, DW_AT_name("ECEFLG")
    6843                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_ECEFLG")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  132

    6844                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6845                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    6846              $C$DW$722       .dwtag  DW_TAG_member
    6847                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$23)
    6848                      .dwattr $C$DW$722, DW_AT_name("ECECLR")
    6849                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_ECECLR")
    6850                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6851                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    6852              $C$DW$723       .dwtag  DW_TAG_member
    6853                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$23)
    6854                      .dwattr $C$DW$723, DW_AT_name("ECEFRC")
    6855                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_ECEFRC")
    6856                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6857                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    6858                      .dwendtag $C$DW$T$34
    6859              
    6860              $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    6861                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$34)
    6862                      .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    6863              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
    6864                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    6865                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    6866              
    6867              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6868                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    6869                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    6870              $C$DW$724       .dwtag  DW_TAG_member
    6871                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$35)
    6872                      .dwattr $C$DW$724, DW_AT_name("alpha_sf")
    6873                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_alpha_sf")
    6874                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6875                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    6876              $C$DW$725       .dwtag  DW_TAG_member
    6877                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$35)
    6878                      .dwattr $C$DW$725, DW_AT_name("beta_sf")
    6879                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_beta_sf")
    6880                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6881                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    6882              $C$DW$726       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$36)
    6884                      .dwattr $C$DW$726, DW_AT_name("numSensors")
    6885                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_numSensors")
    6886                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6887                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    6888                      .dwendtag $C$DW$T$37
    6889              
    6890              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    6891                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$37)
    6892                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    6893              $C$DW$T$186     .dwtag  DW_TAG_pointer_type
    6894                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$47)
    6895                      .dwattr $C$DW$T$186, DW_AT_address_class(0x20)
    6896              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    6897                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
    6898                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  133

    6899              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    6900                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    6901                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    6902              
    6903              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6904                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    6905                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    6906              $C$DW$727       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$23)
    6908                      .dwattr $C$DW$727, DW_AT_name("XCLK")
    6909                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_XCLK")
    6910                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6911                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    6912              $C$DW$728       .dwtag  DW_TAG_member
    6913                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$23)
    6914                      .dwattr $C$DW$728, DW_AT_name("rsvd_1")
    6915                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_rsvd_1")
    6916                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6917                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    6918              $C$DW$729       .dwtag  DW_TAG_member
    6919                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$23)
    6920                      .dwattr $C$DW$729, DW_AT_name("CLKCTL")
    6921                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_CLKCTL")
    6922                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6923                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    6924              $C$DW$730       .dwtag  DW_TAG_member
    6925                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$33)
    6926                      .dwattr $C$DW$730, DW_AT_name("rsvd_2")
    6927                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_rsvd_2")
    6928                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6929                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    6930              $C$DW$731       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$23)
    6932                      .dwattr $C$DW$731, DW_AT_name("LOSPCP")
    6933                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_LOSPCP")
    6934                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6935                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    6936              $C$DW$732       .dwtag  DW_TAG_member
    6937                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$23)
    6938                      .dwattr $C$DW$732, DW_AT_name("PCLKCR0")
    6939                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_PCLKCR0")
    6940                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6941                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    6942              $C$DW$733       .dwtag  DW_TAG_member
    6943                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$23)
    6944                      .dwattr $C$DW$733, DW_AT_name("PCLKCR1")
    6945                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_PCLKCR1")
    6946                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    6947                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    6948              $C$DW$734       .dwtag  DW_TAG_member
    6949                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$26)
    6950                      .dwattr $C$DW$734, DW_AT_name("rsvd_3")
    6951                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_rsvd_3")
    6952                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6953                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  134

    6954              $C$DW$735       .dwtag  DW_TAG_member
    6955                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$23)
    6956                      .dwattr $C$DW$735, DW_AT_name("PCLKCR3")
    6957                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_PCLKCR3")
    6958                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6959                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    6960                      .dwendtag $C$DW$T$38
    6961              
    6962              $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    6963                      .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$38)
    6964                      .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    6965              $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    6966                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    6967                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    6968              
    6969              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6970                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    6971                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    6972              $C$DW$736       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$36)
    6974                      .dwattr $C$DW$736, DW_AT_name("tmp")
    6975                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_tmp")
    6976                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6977                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    6978                      .dwendtag $C$DW$T$39
    6979              
    6980              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    6981                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$39)
    6982                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    6983              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    6984                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    6985                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    6986              
    6987              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    6988                      .dwattr $C$DW$T$72, DW_AT_name("_CTRL_Obj_")
    6989                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x108)
    6990              $C$DW$737       .dwtag  DW_TAG_member
    6991                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$40)
    6992                      .dwattr $C$DW$737, DW_AT_name("version")
    6993                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_version")
    6994                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6995                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    6996              $C$DW$738       .dwtag  DW_TAG_member
    6997                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$42)
    6998                      .dwattr $C$DW$738, DW_AT_name("state")
    6999                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_state")
    7000                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7001                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7002              $C$DW$739       .dwtag  DW_TAG_member
    7003                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$42)
    7004                      .dwattr $C$DW$739, DW_AT_name("prevState")
    7005                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_prevState")
    7006                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7007                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7008              $C$DW$740       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  135

    7009                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$44)
    7010                      .dwattr $C$DW$740, DW_AT_name("errorCode")
    7011                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_errorCode")
    7012                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7013                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7014              $C$DW$741       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$46)
    7016                      .dwattr $C$DW$741, DW_AT_name("clarkeHandle_I")
    7017                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_clarkeHandle_I")
    7018                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7019                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7020              $C$DW$742       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$47)
    7022                      .dwattr $C$DW$742, DW_AT_name("clarke_I")
    7023                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_clarke_I")
    7024                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7025                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$743       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$46)
    7028                      .dwattr $C$DW$743, DW_AT_name("clarkeHandle_V")
    7029                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_clarkeHandle_V")
    7030                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7031                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$744       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$47)
    7034                      .dwattr $C$DW$744, DW_AT_name("clarke_V")
    7035                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_clarke_V")
    7036                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7037                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7038              $C$DW$745       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$49)
    7040                      .dwattr $C$DW$745, DW_AT_name("estHandle")
    7041                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_estHandle")
    7042                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7043                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7044              $C$DW$746       .dwtag  DW_TAG_member
    7045                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$51)
    7046                      .dwattr $C$DW$746, DW_AT_name("parkHandle")
    7047                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_parkHandle")
    7048                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7049                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7050              $C$DW$747       .dwtag  DW_TAG_member
    7051                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$52)
    7052                      .dwattr $C$DW$747, DW_AT_name("park")
    7053                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_park")
    7054                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7055                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7056              $C$DW$748       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$54)
    7058                      .dwattr $C$DW$748, DW_AT_name("pidHandle_Id")
    7059                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_pidHandle_Id")
    7060                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7061                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7062              $C$DW$749       .dwtag  DW_TAG_member
    7063                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  136

    7064                      .dwattr $C$DW$749, DW_AT_name("pid_Id")
    7065                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_pid_Id")
    7066                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7067                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7068              $C$DW$750       .dwtag  DW_TAG_member
    7069                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$54)
    7070                      .dwattr $C$DW$750, DW_AT_name("pidHandle_Iq")
    7071                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_pidHandle_Iq")
    7072                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    7073                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7074              $C$DW$751       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$55)
    7076                      .dwattr $C$DW$751, DW_AT_name("pid_Iq")
    7077                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_pid_Iq")
    7078                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7079                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7080              $C$DW$752       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$54)
    7082                      .dwattr $C$DW$752, DW_AT_name("pidHandle_spd")
    7083                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_pidHandle_spd")
    7084                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7085                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7086              $C$DW$753       .dwtag  DW_TAG_member
    7087                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$55)
    7088                      .dwattr $C$DW$753, DW_AT_name("pid_spd")
    7089                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_pid_spd")
    7090                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7091                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7092              $C$DW$754       .dwtag  DW_TAG_member
    7093                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$57)
    7094                      .dwattr $C$DW$754, DW_AT_name("iparkHandle")
    7095                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_iparkHandle")
    7096                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    7097                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7098              $C$DW$755       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$58)
    7100                      .dwattr $C$DW$755, DW_AT_name("ipark")
    7101                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_ipark")
    7102                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7103                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7104              $C$DW$756       .dwtag  DW_TAG_member
    7105                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$60)
    7106                      .dwattr $C$DW$756, DW_AT_name("svgenHandle")
    7107                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_svgenHandle")
    7108                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7109                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7110              $C$DW$757       .dwtag  DW_TAG_member
    7111                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$61)
    7112                      .dwattr $C$DW$757, DW_AT_name("svgen")
    7113                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_svgen")
    7114                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7115                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    7116              $C$DW$758       .dwtag  DW_TAG_member
    7117                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$63)
    7118                      .dwattr $C$DW$758, DW_AT_name("trajHandle_Id")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  137

    7119                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_trajHandle_Id")
    7120                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7121                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7122              $C$DW$759       .dwtag  DW_TAG_member
    7123                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$64)
    7124                      .dwattr $C$DW$759, DW_AT_name("traj_Id")
    7125                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_traj_Id")
    7126                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7127                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7128              $C$DW$760       .dwtag  DW_TAG_member
    7129                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$63)
    7130                      .dwattr $C$DW$760, DW_AT_name("trajHandle_spd")
    7131                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_trajHandle_spd")
    7132                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    7133                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7134              $C$DW$761       .dwtag  DW_TAG_member
    7135                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$64)
    7136                      .dwattr $C$DW$761, DW_AT_name("traj_spd")
    7137                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_traj_spd")
    7138                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    7139                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7140              $C$DW$762       .dwtag  DW_TAG_member
    7141                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$63)
    7142                      .dwattr $C$DW$762, DW_AT_name("trajHandle_spdMax")
    7143                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    7144                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    7145                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7146              $C$DW$763       .dwtag  DW_TAG_member
    7147                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$64)
    7148                      .dwattr $C$DW$763, DW_AT_name("traj_spdMax")
    7149                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_traj_spdMax")
    7150                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    7151                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7152              $C$DW$764       .dwtag  DW_TAG_member
    7153                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$65)
    7154                      .dwattr $C$DW$764, DW_AT_name("motorParams")
    7155                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_motorParams")
    7156                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7157                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7158              $C$DW$765       .dwtag  DW_TAG_member
    7159                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$67)
    7160                      .dwattr $C$DW$765, DW_AT_name("waitTimes")
    7161                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_waitTimes")
    7162                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    7163                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7164              $C$DW$766       .dwtag  DW_TAG_member
    7165                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$66)
    7166                      .dwattr $C$DW$766, DW_AT_name("counter_state")
    7167                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_counter_state")
    7168                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    7169                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7170              $C$DW$767       .dwtag  DW_TAG_member
    7171                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$68)
    7172                      .dwattr $C$DW$767, DW_AT_name("numIsrTicksPerCtrlTick")
    7173                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  138

    7174                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    7175                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7176              $C$DW$768       .dwtag  DW_TAG_member
    7177                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$68)
    7178                      .dwattr $C$DW$768, DW_AT_name("numCtrlTicksPerCurrentTick")
    7179                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    7180                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    7181                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7182              $C$DW$769       .dwtag  DW_TAG_member
    7183                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$68)
    7184                      .dwattr $C$DW$769, DW_AT_name("numCtrlTicksPerSpeedTick")
    7185                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    7186                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    7187                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7188              $C$DW$770       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$68)
    7190                      .dwattr $C$DW$770, DW_AT_name("numCtrlTicksPerTrajTick")
    7191                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    7192                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    7193                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7194              $C$DW$771       .dwtag  DW_TAG_member
    7195                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$66)
    7196                      .dwattr $C$DW$771, DW_AT_name("ctrlFreq_Hz")
    7197                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    7198                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    7199                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7200              $C$DW$772       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$66)
    7202                      .dwattr $C$DW$772, DW_AT_name("trajFreq_Hz")
    7203                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_trajFreq_Hz")
    7204                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    7205                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7206              $C$DW$773       .dwtag  DW_TAG_member
    7207                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$35)
    7208                      .dwattr $C$DW$773, DW_AT_name("trajPeriod_sec")
    7209                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_trajPeriod_sec")
    7210                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    7211                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7212              $C$DW$774       .dwtag  DW_TAG_member
    7213                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$69)
    7214                      .dwattr $C$DW$774, DW_AT_name("ctrlPeriod_sec")
    7215                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    7216                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    7217                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7218              $C$DW$775       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
    7220                      .dwattr $C$DW$775, DW_AT_name("maxVsMag_pu")
    7221                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_maxVsMag_pu")
    7222                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    7223                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7224              $C$DW$776       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$70)
    7226                      .dwattr $C$DW$776, DW_AT_name("Iab_in")
    7227                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Iab_in")
    7228                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  139

    7229                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7230              $C$DW$777       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$70)
    7232                      .dwattr $C$DW$777, DW_AT_name("Iab_filt")
    7233                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Iab_filt")
    7234                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    7235                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7236              $C$DW$778       .dwtag  DW_TAG_member
    7237                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$70)
    7238                      .dwattr $C$DW$778, DW_AT_name("Idq_in")
    7239                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Idq_in")
    7240                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    7241                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7242              $C$DW$779       .dwtag  DW_TAG_member
    7243                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$70)
    7244                      .dwattr $C$DW$779, DW_AT_name("Vab_in")
    7245                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Vab_in")
    7246                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    7247                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7248              $C$DW$780       .dwtag  DW_TAG_member
    7249                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$35)
    7250                      .dwattr $C$DW$780, DW_AT_name("spd_out")
    7251                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_spd_out")
    7252                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    7253                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7254              $C$DW$781       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$70)
    7256                      .dwattr $C$DW$781, DW_AT_name("Vab_out")
    7257                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Vab_out")
    7258                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    7259                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7260              $C$DW$782       .dwtag  DW_TAG_member
    7261                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$70)
    7262                      .dwattr $C$DW$782, DW_AT_name("Vdq_out")
    7263                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Vdq_out")
    7264                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    7265                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7266              $C$DW$783       .dwtag  DW_TAG_member
    7267                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$69)
    7268                      .dwattr $C$DW$783, DW_AT_name("Rhf")
    7269                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_Rhf")
    7270                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    7271                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7272              $C$DW$784       .dwtag  DW_TAG_member
    7273                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$69)
    7274                      .dwattr $C$DW$784, DW_AT_name("Lhf")
    7275                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_Lhf")
    7276                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    7277                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7278              $C$DW$785       .dwtag  DW_TAG_member
    7279                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$69)
    7280                      .dwattr $C$DW$785, DW_AT_name("RoverL")
    7281                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_RoverL")
    7282                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    7283                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  140

    7284              $C$DW$786       .dwtag  DW_TAG_member
    7285                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$35)
    7286                      .dwattr $C$DW$786, DW_AT_name("Kp_Id")
    7287                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_Kp_Id")
    7288                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    7289                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7290              $C$DW$787       .dwtag  DW_TAG_member
    7291                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$35)
    7292                      .dwattr $C$DW$787, DW_AT_name("Kp_Iq")
    7293                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Kp_Iq")
    7294                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    7295                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7296              $C$DW$788       .dwtag  DW_TAG_member
    7297                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$35)
    7298                      .dwattr $C$DW$788, DW_AT_name("Kp_spd")
    7299                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Kp_spd")
    7300                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    7301                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7302              $C$DW$789       .dwtag  DW_TAG_member
    7303                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$35)
    7304                      .dwattr $C$DW$789, DW_AT_name("Ki_Id")
    7305                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_Ki_Id")
    7306                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    7307                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7308              $C$DW$790       .dwtag  DW_TAG_member
    7309                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$35)
    7310                      .dwattr $C$DW$790, DW_AT_name("Ki_Iq")
    7311                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_Ki_Iq")
    7312                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    7313                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7314              $C$DW$791       .dwtag  DW_TAG_member
    7315                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$35)
    7316                      .dwattr $C$DW$791, DW_AT_name("Ki_spd")
    7317                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_Ki_spd")
    7318                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    7319                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    7320              $C$DW$792       .dwtag  DW_TAG_member
    7321                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$35)
    7322                      .dwattr $C$DW$792, DW_AT_name("Kd_Id")
    7323                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_Kd_Id")
    7324                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    7325                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7326              $C$DW$793       .dwtag  DW_TAG_member
    7327                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$35)
    7328                      .dwattr $C$DW$793, DW_AT_name("Kd_Iq")
    7329                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_Kd_Iq")
    7330                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    7331                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7332              $C$DW$794       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$35)
    7334                      .dwattr $C$DW$794, DW_AT_name("Kd_spd")
    7335                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_Kd_spd")
    7336                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    7337                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$795       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  141

    7339                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$35)
    7340                      .dwattr $C$DW$795, DW_AT_name("Ui_Id")
    7341                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_Ui_Id")
    7342                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    7343                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7344              $C$DW$796       .dwtag  DW_TAG_member
    7345                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$35)
    7346                      .dwattr $C$DW$796, DW_AT_name("Ui_Iq")
    7347                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_Ui_Iq")
    7348                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    7349                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7350              $C$DW$797       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$35)
    7352                      .dwattr $C$DW$797, DW_AT_name("Ui_spd")
    7353                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_Ui_spd")
    7354                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    7355                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7356              $C$DW$798       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$70)
    7358                      .dwattr $C$DW$798, DW_AT_name("Idq_ref")
    7359                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_Idq_ref")
    7360                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    7361                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7362              $C$DW$799       .dwtag  DW_TAG_member
    7363                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$35)
    7364                      .dwattr $C$DW$799, DW_AT_name("IdRated")
    7365                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_IdRated")
    7366                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    7367                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7368              $C$DW$800       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$35)
    7370                      .dwattr $C$DW$800, DW_AT_name("spd_ref")
    7371                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_spd_ref")
    7372                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    7373                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7374              $C$DW$801       .dwtag  DW_TAG_member
    7375                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$35)
    7376                      .dwattr $C$DW$801, DW_AT_name("spd_max")
    7377                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_spd_max")
    7378                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    7379                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7380              $C$DW$802       .dwtag  DW_TAG_member
    7381                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$68)
    7382                      .dwattr $C$DW$802, DW_AT_name("counter_current")
    7383                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_counter_current")
    7384                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    7385                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7386              $C$DW$803       .dwtag  DW_TAG_member
    7387                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$68)
    7388                      .dwattr $C$DW$803, DW_AT_name("counter_isr")
    7389                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_counter_isr")
    7390                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    7391                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7392              $C$DW$804       .dwtag  DW_TAG_member
    7393                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$68)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  142

    7394                      .dwattr $C$DW$804, DW_AT_name("counter_speed")
    7395                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_counter_speed")
    7396                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    7397                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7398              $C$DW$805       .dwtag  DW_TAG_member
    7399                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$68)
    7400                      .dwattr $C$DW$805, DW_AT_name("counter_traj")
    7401                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_counter_traj")
    7402                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    7403                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7404              $C$DW$806       .dwtag  DW_TAG_member
    7405                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$71)
    7406                      .dwattr $C$DW$806, DW_AT_name("flag_enableCtrl")
    7407                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_flag_enableCtrl")
    7408                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    7409                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7410              $C$DW$807       .dwtag  DW_TAG_member
    7411                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$71)
    7412                      .dwattr $C$DW$807, DW_AT_name("flag_enableDcBusComp")
    7413                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    7414                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    7415                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7416              $C$DW$808       .dwtag  DW_TAG_member
    7417                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$71)
    7418                      .dwattr $C$DW$808, DW_AT_name("flag_enablePowerWarp")
    7419                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    7420                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    7421                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7422              $C$DW$809       .dwtag  DW_TAG_member
    7423                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$71)
    7424                      .dwattr $C$DW$809, DW_AT_name("flag_enableOffset")
    7425                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_flag_enableOffset")
    7426                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    7427                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7428              $C$DW$810       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$71)
    7430                      .dwattr $C$DW$810, DW_AT_name("flag_enableSpeedCtrl")
    7431                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    7432                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    7433                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7434              $C$DW$811       .dwtag  DW_TAG_member
    7435                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$71)
    7436                      .dwattr $C$DW$811, DW_AT_name("flag_enableUserMotorParams")
    7437                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    7438                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    7439                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7440              $C$DW$812       .dwtag  DW_TAG_member
    7441                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$70)
    7442                      .dwattr $C$DW$812, DW_AT_name("Idq_offset_pu")
    7443                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_Idq_offset_pu")
    7444                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    7445                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7446              $C$DW$813       .dwtag  DW_TAG_member
    7447                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$70)
    7448                      .dwattr $C$DW$813, DW_AT_name("Vdq_offset_pu")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  143

    7449                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    7450                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    7451                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7452              $C$DW$814       .dwtag  DW_TAG_member
    7453                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$35)
    7454                      .dwattr $C$DW$814, DW_AT_name("angle_pu")
    7455                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_angle_pu")
    7456                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    7457                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7458              $C$DW$815       .dwtag  DW_TAG_member
    7459                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$35)
    7460                      .dwattr $C$DW$815, DW_AT_name("speed_ref_pu")
    7461                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_speed_ref_pu")
    7462                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    7463                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7464              $C$DW$816       .dwtag  DW_TAG_member
    7465                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$35)
    7466                      .dwattr $C$DW$816, DW_AT_name("speed_fb_pu")
    7467                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_speed_fb_pu")
    7468                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    7469                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7470              $C$DW$817       .dwtag  DW_TAG_member
    7471                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$35)
    7472                      .dwattr $C$DW$817, DW_AT_name("speed_outMax_pu")
    7473                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_speed_outMax_pu")
    7474                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    7475                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7476              $C$DW$818       .dwtag  DW_TAG_member
    7477                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$71)
    7478                      .dwattr $C$DW$818, DW_AT_name("flag_enableCurrentCtrl")
    7479                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    7480                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    7481                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7482                      .dwendtag $C$DW$T$72
    7483              
    7484              $C$DW$T$187     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    7485                      .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$72)
    7486                      .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    7487              $C$DW$T$173     .dwtag  DW_TAG_pointer_type
    7488                      .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$72)
    7489                      .dwattr $C$DW$T$173, DW_AT_address_class(0x20)
    7490              $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    7491                      .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
    7492                      .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    7493              $C$DW$819       .dwtag  DW_TAG_TI_far_type
    7494                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$174)
    7495              $C$DW$T$188     .dwtag  DW_TAG_const_type
    7496                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$819)
    7497              
    7498              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7499                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Version_")
    7500                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
    7501              $C$DW$820       .dwtag  DW_TAG_member
    7502                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$22)
    7503                      .dwattr $C$DW$820, DW_AT_name("rsvd")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  144

    7504                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_rsvd")
    7505                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7506                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7507              $C$DW$821       .dwtag  DW_TAG_member
    7508                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$74)
    7509                      .dwattr $C$DW$821, DW_AT_name("targetProc")
    7510                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_targetProc")
    7511                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7512                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7513              $C$DW$822       .dwtag  DW_TAG_member
    7514                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$22)
    7515                      .dwattr $C$DW$822, DW_AT_name("major")
    7516                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_major")
    7517                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7518                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7519              $C$DW$823       .dwtag  DW_TAG_member
    7520                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$22)
    7521                      .dwattr $C$DW$823, DW_AT_name("minor")
    7522                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_minor")
    7523                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7524                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7525                      .dwendtag $C$DW$T$75
    7526              
    7527              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    7528                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$75)
    7529                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    7530              
    7531              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    7532                      .dwattr $C$DW$T$82, DW_AT_name("_DRV8305_Obj_")
    7533                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    7534              $C$DW$824       .dwtag  DW_TAG_member
    7535                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$77)
    7536                      .dwattr $C$DW$824, DW_AT_name("spiHandle")
    7537                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_spiHandle")
    7538                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7539                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7540              $C$DW$825       .dwtag  DW_TAG_member
    7541                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$79)
    7542                      .dwattr $C$DW$825, DW_AT_name("gpioHandle")
    7543                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_gpioHandle")
    7544                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7545                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7546              $C$DW$826       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$81)
    7548                      .dwattr $C$DW$826, DW_AT_name("gpioNumber")
    7549                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_gpioNumber")
    7550                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7551                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7552              $C$DW$827       .dwtag  DW_TAG_member
    7553                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$71)
    7554                      .dwattr $C$DW$827, DW_AT_name("RxTimeOut")
    7555                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_RxTimeOut")
    7556                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7557                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7558              $C$DW$828       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  145

    7559                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$71)
    7560                      .dwattr $C$DW$828, DW_AT_name("enableTimeOut")
    7561                      .dwattr $C$DW$828, DW_AT_TI_symbol_name("_enableTimeOut")
    7562                      .dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7563                      .dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
    7564                      .dwendtag $C$DW$T$82
    7565              
    7566              $C$DW$T$127     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Obj")
    7567                      .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$82)
    7568                      .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    7569              $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    7570                      .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$82)
    7571                      .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    7572              $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Handle")
    7573                      .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    7574                      .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    7575              
    7576              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    7577                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    7578                      .dwattr $C$DW$T$19, DW_AT_declaration
    7579                      .dwendtag $C$DW$T$19
    7580              
    7581              $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    7582                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
    7583                      .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    7584              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    7585                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    7586                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    7587              
    7588              $C$DW$T$83      .dwtag  DW_TAG_structure_type
    7589                      .dwattr $C$DW$T$83, DW_AT_name("_FILTER_FO_")
    7590                      .dwattr $C$DW$T$83, DW_AT_byte_size(0x0a)
    7591              $C$DW$829       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$35)
    7593                      .dwattr $C$DW$829, DW_AT_name("a1")
    7594                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_a1")
    7595                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7596                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7597              $C$DW$830       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$35)
    7599                      .dwattr $C$DW$830, DW_AT_name("b0")
    7600                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_b0")
    7601                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7602                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7603              $C$DW$831       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$35)
    7605                      .dwattr $C$DW$831, DW_AT_name("b1")
    7606                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_b1")
    7607                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7608                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7609              $C$DW$832       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$35)
    7611                      .dwattr $C$DW$832, DW_AT_name("x1")
    7612                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_x1")
    7613                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  146

    7614                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7615              $C$DW$833       .dwtag  DW_TAG_member
    7616                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$35)
    7617                      .dwattr $C$DW$833, DW_AT_name("y1")
    7618                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_y1")
    7619                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7620                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7621                      .dwendtag $C$DW$T$83
    7622              
    7623              $C$DW$T$138     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
    7624                      .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$83)
    7625                      .dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
    7626              $C$DW$T$190     .dwtag  DW_TAG_pointer_type
    7627                      .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$138)
    7628                      .dwattr $C$DW$T$190, DW_AT_address_class(0x20)
    7629              
    7630              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7631                      .dwattr $C$DW$T$20, DW_AT_name("_FILTER_FO_Obj_")
    7632                      .dwattr $C$DW$T$20, DW_AT_declaration
    7633                      .dwendtag $C$DW$T$20
    7634              
    7635              $C$DW$T$139     .dwtag  DW_TAG_pointer_type
    7636                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$20)
    7637                      .dwattr $C$DW$T$139, DW_AT_address_class(0x20)
    7638              $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
    7639                      .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$139)
    7640                      .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    7641              
    7642              $C$DW$T$84      .dwtag  DW_TAG_structure_type
    7643                      .dwattr $C$DW$T$84, DW_AT_name("_FLASH_Obj_")
    7644                      .dwattr $C$DW$T$84, DW_AT_byte_size(0x08)
    7645              $C$DW$834       .dwtag  DW_TAG_member
    7646                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$23)
    7647                      .dwattr $C$DW$834, DW_AT_name("FOPT")
    7648                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_FOPT")
    7649                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7650                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7651              $C$DW$835       .dwtag  DW_TAG_member
    7652                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$23)
    7653                      .dwattr $C$DW$835, DW_AT_name("rsvd_1")
    7654                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_rsvd_1")
    7655                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7656                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7657              $C$DW$836       .dwtag  DW_TAG_member
    7658                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$23)
    7659                      .dwattr $C$DW$836, DW_AT_name("FPWR")
    7660                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_FPWR")
    7661                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7662                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7663              $C$DW$837       .dwtag  DW_TAG_member
    7664                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$23)
    7665                      .dwattr $C$DW$837, DW_AT_name("FSTATUS")
    7666                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_FSTATUS")
    7667                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7668                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0566810                          PAGE  147

    7669              $C$DW$838       .dwtag  DW_TAG_member
    7670                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$23)
    7671                      .dwattr $C$DW$838, DW_AT_name("FSTDBYWAIT")
    7672                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_FSTDBYWAIT")
    7673                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7674                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7675              $C$DW$839       .dwtag  DW_TAG_member
    7676                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$23)
    7677                      .dwattr $C$DW$839, DW_AT_name("FACTIVEWAIT")
    7678                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_FACTIVEWAIT")
    7679                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7680                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7681              $C$DW$840       .dwtag  DW_TAG_member
    7682                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$23)
    7683                      .dwattr $C$DW$840, DW_AT_name("FBANKWAIT")
    7684                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_FBANKWAIT")
    7685                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7686                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7687              $C$DW$841       .dwtag  DW_TAG_member
    7688                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$23)
    7689                      .dwattr $C$DW$841, DW_AT_name("FOTPWAIT")
    7690                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_FOTPWAIT")
    7691                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7692                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7693                      .dwendtag $C$DW$T$84
    7694              
    7695              $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    7696                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$84)
    7697                      .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    7698              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("FLASH_Handle")
    7699                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    7700                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    7701              
    7702              $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7703                      .dwattr $C$DW$T$87, DW_AT_name("_GPIO_Obj_")
    7704                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x6a)
    7705              $C$DW$842       .dwtag  DW_TAG_member
    7706                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$32)
    7707                      .dwattr $C$DW$842, DW_AT_name("GPACTRL")
    7708                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_GPACTRL")
    7709                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7710                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7711              $C$DW$843       .dwtag  DW_TAG_member
    7712                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$32)
    7713                      .dwattr $C$DW$843, DW_AT_name("GPAQSEL1")
    7714                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_GPAQSEL1")
    7715                      .dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7716                      .dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
    7717              $C$DW$844       .dwtag  DW_TAG_member
    7718                      .dwattr $C$DW$844, DW_AT_type(*$C$DW$T$32)
    7719                      .dwattr $C$DW$844, DW_AT_name("GPAQSEL2")
    7720                      .dwattr $C$DW$844, DW_AT_TI_symbol_name("_GPAQSEL2")
