TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:11 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/drvic/drv8305/src/32b/f
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  128

    6653              
    6654              $C$DW$T$179     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_CtrlMode_e")
    6655                      .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$178)
    6656                      .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    6657              
    6658              $C$DW$T$181     .dwtag  DW_TAG_enumeration_type
    6659                      .dwattr $C$DW$T$181, DW_AT_byte_size(0x01)
    6660              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Status_1"), DW_AT_const_value(0x800)
    6661              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Status_2"), DW_AT_const_value(0x1000)
    6662              $C$DW$654       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Status_3"), DW_AT_const_value(0x1800)
    6663              $C$DW$655       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Status_4"), DW_AT_const_value(0x2000)
    6664              $C$DW$656       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_5"), DW_AT_const_value(0x2800)
    6665              $C$DW$657       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_6"), DW_AT_const_value(0x3000)
    6666              $C$DW$658       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_7"), DW_AT_const_value(0x3800)
    6667              $C$DW$659       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_8"), DW_AT_const_value(0x4000)
    6668              $C$DW$660       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_9"), DW_AT_const_value(0x4800)
    6669              $C$DW$661       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_A"), DW_AT_const_value(0x5000)
    6670              $C$DW$662       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_B"), DW_AT_const_value(0x5800)
    6671              $C$DW$663       .dwtag  DW_TAG_enumerator, DW_AT_name("Address_Control_C"), DW_AT_const_value(0x6000)
    6672                      .dwendtag $C$DW$T$181
    6673              
    6674              $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Address_e")
    6675                      .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$181)
    6676                      .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    6677              $C$DW$664       .dwtag  DW_TAG_TI_far_type
    6678                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$182)
    6679              $C$DW$T$183     .dwtag  DW_TAG_const_type
    6680                      .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$664)
    6681              
    6682              $C$DW$T$184     .dwtag  DW_TAG_enumeration_type
    6683                      .dwattr $C$DW$T$184, DW_AT_byte_size(0x01)
    6684              $C$DW$665       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch1_Load"), DW_AT_const_value(0x00)
    6685              $C$DW$666       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch1_NoLoad"), DW_AT_const_value(0x100)
    6686              $C$DW$667       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch2_Load"), DW_AT_const_value(0x00)
    6687              $C$DW$668       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch2_NoLoad"), DW_AT_const_value(0x200)
    6688              $C$DW$669       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch3_Load"), DW_AT_const_value(0x00)
    6689              $C$DW$670       .dwtag  DW_TAG_enumerator, DW_AT_name("DcCalMode_Ch3_NoLoad"), DW_AT_const_value(0x400)
    6690                      .dwendtag $C$DW$T$184
    6691              
    6692              $C$DW$T$185     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_CTRL0A_DcCalMode_e")
    6693                      .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$184)
    6694                      .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    6695              $C$DW$671       .dwtag  DW_TAG_TI_far_type
    6696                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$185)
    6697              $C$DW$T$186     .dwtag  DW_TAG_const_type
    6698                      .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$671)
    6699              
    6700              $C$DW$T$187     .dwtag  DW_TAG_enumeration_type
    6701                      .dwattr $C$DW$T$187, DW_AT_byte_size(0x01)
    6702              $C$DW$672       .dwtag  DW_TAG_enumerator, DW_AT_name("ShuntAmpNumber_1"), DW_AT_const_value(0x01)
    6703              $C$DW$673       .dwtag  DW_TAG_enumerator, DW_AT_name("ShuntAmpNumber_2"), DW_AT_const_value(0x02)
    6704              $C$DW$674       .dwtag  DW_TAG_enumerator, DW_AT_name("ShuntAmpNumber_3"), DW_AT_const_value(0x03)
    6705                      .dwendtag $C$DW$T$187
    6706              
    6707              $C$DW$T$188     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_ShuntAmpNumber_e")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  129

    6708                      .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$187)
    6709                      .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    6710              $C$DW$675       .dwtag  DW_TAG_TI_far_type
    6711                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$188)
    6712              $C$DW$T$189     .dwtag  DW_TAG_const_type
    6713                      .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$675)
    6714              
    6715              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6716                      .dwattr $C$DW$T$26, DW_AT_name("_DRV8305_Obj_")
    6717                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    6718              $C$DW$676       .dwtag  DW_TAG_member
    6719                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$20)
    6720                      .dwattr $C$DW$676, DW_AT_name("spiHandle")
    6721                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_spiHandle")
    6722                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6724              $C$DW$677       .dwtag  DW_TAG_member
    6725                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$22)
    6726                      .dwattr $C$DW$677, DW_AT_name("gpioHandle")
    6727                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_gpioHandle")
    6728                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6729                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6730              $C$DW$678       .dwtag  DW_TAG_member
    6731                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$24)
    6732                      .dwattr $C$DW$678, DW_AT_name("gpioNumber")
    6733                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_gpioNumber")
    6734                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6735                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6736              $C$DW$679       .dwtag  DW_TAG_member
    6737                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$25)
    6738                      .dwattr $C$DW$679, DW_AT_name("RxTimeOut")
    6739                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_RxTimeOut")
    6740                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6741                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6742              $C$DW$680       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$25)
    6744                      .dwattr $C$DW$680, DW_AT_name("enableTimeOut")
    6745                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_enableTimeOut")
    6746                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6747                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6748                      .dwendtag $C$DW$T$26
    6749              
    6750              $C$DW$T$192     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Obj")
    6751                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$26)
    6752                      .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    6753              $C$DW$T$109     .dwtag  DW_TAG_pointer_type
    6754                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$26)
    6755                      .dwattr $C$DW$T$109, DW_AT_address_class(0x20)
    6756              $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Handle")
    6757                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
    6758                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    6759              $C$DW$681       .dwtag  DW_TAG_TI_far_type
    6760                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$110)
    6761              $C$DW$T$193     .dwtag  DW_TAG_const_type
    6762                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$681)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  130

    6763              
    6764              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6765                      .dwattr $C$DW$T$33, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    6766                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    6767              $C$DW$682       .dwtag  DW_TAG_member
    6768                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$28)
    6769                      .dwattr $C$DW$682, DW_AT_name("IDRIVEP_HS")
    6770                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    6771                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6772                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6773              $C$DW$683       .dwtag  DW_TAG_member
    6774                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$30)
    6775                      .dwattr $C$DW$683, DW_AT_name("IDRIVEN_HS")
    6776                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    6777                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6778                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6779              $C$DW$684       .dwtag  DW_TAG_member
    6780                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$32)
    6781                      .dwattr $C$DW$684, DW_AT_name("TDRIVEN")
    6782                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_TDRIVEN")
    6783                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6784                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6785              $C$DW$685       .dwtag  DW_TAG_member
    6786                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$25)
    6787                      .dwattr $C$DW$685, DW_AT_name("CTRL05_RSV1")
    6788                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    6789                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6790                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6791                      .dwendtag $C$DW$T$33
    6792              
    6793              $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    6794                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$33)
    6795                      .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    6796              
    6797              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6798                      .dwattr $C$DW$T$40, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    6799                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    6800              $C$DW$686       .dwtag  DW_TAG_member
    6801                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$35)
    6802                      .dwattr $C$DW$686, DW_AT_name("IDRIVEP_LS")
    6803                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    6804                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6805                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6806              $C$DW$687       .dwtag  DW_TAG_member
    6807                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$37)
    6808                      .dwattr $C$DW$687, DW_AT_name("IDRIVEN_LS")
    6809                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    6810                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6811                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6812              $C$DW$688       .dwtag  DW_TAG_member
    6813                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$39)
    6814                      .dwattr $C$DW$688, DW_AT_name("TDRIVEP")
    6815                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_TDRIVEP")
    6816                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6817                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  131

    6818              $C$DW$689       .dwtag  DW_TAG_member
    6819                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$25)
    6820                      .dwattr $C$DW$689, DW_AT_name("CTRL06_RSV1")
    6821                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    6822                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6823                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    6824                      .dwendtag $C$DW$T$40
    6825              
    6826              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    6827                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$40)
    6828                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    6829              
    6830              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6831                      .dwattr $C$DW$T$51, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    6832                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x06)
    6833              $C$DW$690       .dwtag  DW_TAG_member
    6834                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$42)
    6835                      .dwattr $C$DW$690, DW_AT_name("TVDS")
    6836                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_TVDS")
    6837                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6838                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    6839              $C$DW$691       .dwtag  DW_TAG_member
    6840                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$44)
    6841                      .dwattr $C$DW$691, DW_AT_name("TBLANK")
    6842                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_TBLANK")
    6843                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6844                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    6845              $C$DW$692       .dwtag  DW_TAG_member
    6846                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$46)
    6847                      .dwattr $C$DW$692, DW_AT_name("DEAD_TIME")
    6848                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_DEAD_TIME")
    6849                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6850                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    6851              $C$DW$693       .dwtag  DW_TAG_member
    6852                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$48)
    6853                      .dwattr $C$DW$693, DW_AT_name("PWM_MODE")
    6854                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_PWM_MODE")
    6855                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6856                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    6857              $C$DW$694       .dwtag  DW_TAG_member
    6858                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$50)
    6859                      .dwattr $C$DW$694, DW_AT_name("COMM_OPT")
    6860                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_COMM_OPT")
    6861                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6862                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    6863              $C$DW$695       .dwtag  DW_TAG_member
    6864                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$25)
    6865                      .dwattr $C$DW$695, DW_AT_name("CTRL07_RSV1")
    6866                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    6867                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6868                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    6869                      .dwendtag $C$DW$T$51
    6870              
    6871              $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    6872                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$51)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  132

    6873                      .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    6874              
    6875              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    6876                      .dwattr $C$DW$T$53, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    6877                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    6878              $C$DW$696       .dwtag  DW_TAG_member
    6879                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$52)
    6880                      .dwattr $C$DW$696, DW_AT_name("CTRL08_RSV1")
    6881                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    6882                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6883                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    6884                      .dwendtag $C$DW$T$53
    6885              
    6886              $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    6887                      .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$53)
    6888                      .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    6889              
    6890              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    6891                      .dwattr $C$DW$T$56, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    6892                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x0a)
    6893              $C$DW$697       .dwtag  DW_TAG_member
    6894                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$25)
    6895                      .dwattr $C$DW$697, DW_AT_name("SET_VCPH_UV")
    6896                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    6897                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6898                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    6899              $C$DW$698       .dwtag  DW_TAG_member
    6900                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$25)
    6901                      .dwattr $C$DW$698, DW_AT_name("CLR_FLTS")
    6902                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_CLR_FLTS")
    6903                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6904                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    6905              $C$DW$699       .dwtag  DW_TAG_member
    6906                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$25)
    6907                      .dwattr $C$DW$699, DW_AT_name("SLEEP")
    6908                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_SLEEP")
    6909                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6910                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    6911              $C$DW$700       .dwtag  DW_TAG_member
    6912                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$25)
    6913                      .dwattr $C$DW$700, DW_AT_name("WD_EN")
    6914                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_WD_EN")
    6915                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6916                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    6917              $C$DW$701       .dwtag  DW_TAG_member
    6918                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$25)
    6919                      .dwattr $C$DW$701, DW_AT_name("DIS_SNS_OCP")
    6920                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
    6921                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6922                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    6923              $C$DW$702       .dwtag  DW_TAG_member
    6924                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$55)
    6925                      .dwattr $C$DW$702, DW_AT_name("WD_DLY")
    6926                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_WD_DLY")
    6927                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  133

    6928                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    6929              $C$DW$703       .dwtag  DW_TAG_member
    6930                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$25)
    6931                      .dwattr $C$DW$703, DW_AT_name("EN_SNS_CLAMP")
    6932                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
    6933                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6934                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    6935              $C$DW$704       .dwtag  DW_TAG_member
    6936                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$25)
    6937                      .dwattr $C$DW$704, DW_AT_name("DIS_GDRV_FAULT")
    6938                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
    6939                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6940                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    6941              $C$DW$705       .dwtag  DW_TAG_member
    6942                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$25)
    6943                      .dwattr $C$DW$705, DW_AT_name("DISABLE")
    6944                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_DISABLE")
    6945                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6946                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    6947              $C$DW$706       .dwtag  DW_TAG_member
    6948                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$25)
    6949                      .dwattr $C$DW$706, DW_AT_name("FLIP_OTS")
    6950                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_FLIP_OTS")
    6951                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6952                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    6953                      .dwendtag $C$DW$T$56
    6954              
    6955              $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
    6956                      .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$56)
    6957                      .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    6958              
    6959              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    6960                      .dwattr $C$DW$T$65, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
    6961                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x07)
    6962              $C$DW$707       .dwtag  DW_TAG_member
    6963                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$58)
    6964                      .dwattr $C$DW$707, DW_AT_name("GAIN_CS1")
    6965                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_GAIN_CS1")
    6966                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6967                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    6968              $C$DW$708       .dwtag  DW_TAG_member
    6969                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$60)
    6970                      .dwattr $C$DW$708, DW_AT_name("GAIN_CS2")
    6971                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_GAIN_CS2")
    6972                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6973                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    6974              $C$DW$709       .dwtag  DW_TAG_member
    6975                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$62)
    6976                      .dwattr $C$DW$709, DW_AT_name("GAIN_CS3")
    6977                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_GAIN_CS3")
    6978                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6979                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    6980              $C$DW$710       .dwtag  DW_TAG_member
    6981                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$64)
    6982                      .dwattr $C$DW$710, DW_AT_name("CS_BLANK")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  134

    6983                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_CS_BLANK")
    6984                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6985                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    6986              $C$DW$711       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$25)
    6988                      .dwattr $C$DW$711, DW_AT_name("DC_CAL_CH1")
    6989                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_DC_CAL_CH1")
    6990                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6991                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    6992              $C$DW$712       .dwtag  DW_TAG_member
    6993                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$25)
    6994                      .dwattr $C$DW$712, DW_AT_name("DC_CAL_CH2")
    6995                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_DC_CAL_CH2")
    6996                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6997                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    6998              $C$DW$713       .dwtag  DW_TAG_member
    6999                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$25)
    7000                      .dwattr $C$DW$713, DW_AT_name("DC_CAL_CH3")
    7001                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_DC_CAL_CH3")
    7002                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7003                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7004                      .dwendtag $C$DW$T$65
    7005              
    7006              $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
    7007                      .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$65)
    7008                      .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    7009              
    7010              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7011                      .dwattr $C$DW$T$72, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
    7012                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x08)
    7013              $C$DW$714       .dwtag  DW_TAG_member
    7014                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$67)
    7015                      .dwattr $C$DW$714, DW_AT_name("VREG_UV_LEVEL")
    7016                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
    7017                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7018                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7019              $C$DW$715       .dwtag  DW_TAG_member
    7020                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    7021                      .dwattr $C$DW$715, DW_AT_name("DIS_PWRGD")
    7022                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_DIS_PWRGD")
    7023                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7024                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7025              $C$DW$716       .dwtag  DW_TAG_member
    7026                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$69)
    7027                      .dwattr $C$DW$716, DW_AT_name("SLP_DLY")
    7028                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_SLP_DLY")
    7029                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7030                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7031              $C$DW$717       .dwtag  DW_TAG_member
    7032                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$25)
    7033                      .dwattr $C$DW$717, DW_AT_name("CTRL0B_RSV1")
    7034                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
    7035                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7036                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7037              $C$DW$718       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  135

    7038                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$25)
    7039                      .dwattr $C$DW$718, DW_AT_name("CTRL0B_RSV2")
    7040                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
    7041                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7042                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7043              $C$DW$719       .dwtag  DW_TAG_member
    7044                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$25)
    7045                      .dwattr $C$DW$719, DW_AT_name("CTRL0B_RSV3")
    7046                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
    7047                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7048                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7049              $C$DW$720       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$71)
    7051                      .dwattr $C$DW$720, DW_AT_name("VREF_SCALING")
    7052                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_VREF_SCALING")
    7053                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7054                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7055              $C$DW$721       .dwtag  DW_TAG_member
    7056                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$25)
    7057                      .dwattr $C$DW$721, DW_AT_name("CTRL0B_RSV4")
    7058                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
    7059                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7060                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7061                      .dwendtag $C$DW$T$72
    7062              
    7063              $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
    7064                      .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$72)
    7065                      .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    7066              
    7067              $C$DW$T$77      .dwtag  DW_TAG_structure_type
    7068                      .dwattr $C$DW$T$77, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
    7069                      .dwattr $C$DW$T$77, DW_AT_byte_size(0x05)
    7070              $C$DW$722       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$74)
    7072                      .dwattr $C$DW$722, DW_AT_name("VDS_MODE")
    7073                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_VDS_MODE")
    7074                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7075                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7076              $C$DW$723       .dwtag  DW_TAG_member
    7077                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$76)
    7078                      .dwattr $C$DW$723, DW_AT_name("VDS_LEVEL")
    7079                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_VDS_LEVEL")
    7080                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7081                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7082              $C$DW$724       .dwtag  DW_TAG_member
    7083                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$25)
    7084                      .dwattr $C$DW$724, DW_AT_name("CTRL0C_RSV1")
    7085                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
    7086                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7087                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7088              $C$DW$725       .dwtag  DW_TAG_member
    7089                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$25)
    7090                      .dwattr $C$DW$725, DW_AT_name("CTRL0C_RSV2")
    7091                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
    7092                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  136

    7093                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7094              $C$DW$726       .dwtag  DW_TAG_member
    7095                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$25)
    7096                      .dwattr $C$DW$726, DW_AT_name("CTRL0C_RSV3")
    7097                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
    7098                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7099                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7100                      .dwendtag $C$DW$T$77
    7101              
    7102              $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
    7103                      .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$77)
    7104                      .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    7105              
    7106              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7107                      .dwattr $C$DW$T$78, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
    7108                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x0b)
    7109              $C$DW$727       .dwtag  DW_TAG_member
    7110                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$25)
    7111                      .dwattr $C$DW$727, DW_AT_name("OTW")
    7112                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_OTW")
    7113                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7114                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7115              $C$DW$728       .dwtag  DW_TAG_member
    7116                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$25)
    7117                      .dwattr $C$DW$728, DW_AT_name("TEMP_FLAG3")
    7118                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_TEMP_FLAG3")
    7119                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7120                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7121              $C$DW$729       .dwtag  DW_TAG_member
    7122                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$25)
    7123                      .dwattr $C$DW$729, DW_AT_name("TEMP_FLAG2")
    7124                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_TEMP_FLAG2")
    7125                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7126                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7127              $C$DW$730       .dwtag  DW_TAG_member
    7128                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$25)
    7129                      .dwattr $C$DW$730, DW_AT_name("TEMP_FLAG1")
    7130                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_TEMP_FLAG1")
    7131                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7132                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7133              $C$DW$731       .dwtag  DW_TAG_member
    7134                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$25)
    7135                      .dwattr $C$DW$731, DW_AT_name("VCPH_UVFL")
    7136                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_VCPH_UVFL")
    7137                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7138                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7139              $C$DW$732       .dwtag  DW_TAG_member
    7140                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$25)
    7141                      .dwattr $C$DW$732, DW_AT_name("VDS_STATUS")
    7142                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_VDS_STATUS")
    7143                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7144                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7145              $C$DW$733       .dwtag  DW_TAG_member
    7146                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$25)
    7147                      .dwattr $C$DW$733, DW_AT_name("PVDD_OVFL")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  137

    7148                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_PVDD_OVFL")
    7149                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7150                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7151              $C$DW$734       .dwtag  DW_TAG_member
    7152                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$25)
    7153                      .dwattr $C$DW$734, DW_AT_name("PVDD_UVFL")
    7154                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_PVDD_UVFL")
    7155                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7156                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7157              $C$DW$735       .dwtag  DW_TAG_member
    7158                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$25)
    7159                      .dwattr $C$DW$735, DW_AT_name("TEMP_FLAG4")
    7160                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_TEMP_FLAG4")
    7161                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7162                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    7163              $C$DW$736       .dwtag  DW_TAG_member
    7164                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$25)
    7165                      .dwattr $C$DW$736, DW_AT_name("STAT01_RSV1")
    7166                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_STAT01_RSV1")
    7167                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7168                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    7169              $C$DW$737       .dwtag  DW_TAG_member
    7170                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$25)
    7171                      .dwattr $C$DW$737, DW_AT_name("FAULT")
    7172                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_FAULT")
    7173                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7174                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    7175                      .dwendtag $C$DW$T$78
    7176              
    7177              $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat01_t_")
    7178                      .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$78)
    7179                      .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    7180              
    7181              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    7182                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
    7183                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x0b)
    7184              $C$DW$738       .dwtag  DW_TAG_member
    7185                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$25)
    7186                      .dwattr $C$DW$738, DW_AT_name("SNS_A_OCP")
    7187                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_SNS_A_OCP")
    7188                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7189                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    7190              $C$DW$739       .dwtag  DW_TAG_member
    7191                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$25)
    7192                      .dwattr $C$DW$739, DW_AT_name("SNS_B_OCP")
    7193                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_SNS_B_OCP")
    7194                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7195                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    7196              $C$DW$740       .dwtag  DW_TAG_member
    7197                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$25)
    7198                      .dwattr $C$DW$740, DW_AT_name("SNS_C_OCP")
    7199                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_SNS_C_OCP")
    7200                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7201                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    7202              $C$DW$741       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  138

    7203                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$25)
    7204                      .dwattr $C$DW$741, DW_AT_name("STAT02_RSV2")
    7205                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_STAT02_RSV2")
    7206                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7207                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    7208              $C$DW$742       .dwtag  DW_TAG_member
    7209                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$25)
    7210                      .dwattr $C$DW$742, DW_AT_name("STAT02_RSV1")
    7211                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_STAT02_RSV1")
    7212                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7213                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    7214              $C$DW$743       .dwtag  DW_TAG_member
    7215                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$25)
    7216                      .dwattr $C$DW$743, DW_AT_name("FETLC_VDS")
    7217                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_FETLC_VDS")
    7218                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7219                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    7220              $C$DW$744       .dwtag  DW_TAG_member
    7221                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$25)
    7222                      .dwattr $C$DW$744, DW_AT_name("FETHC_VDS")
    7223                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_FETHC_VDS")
    7224                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7225                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    7226              $C$DW$745       .dwtag  DW_TAG_member
    7227                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$25)
    7228                      .dwattr $C$DW$745, DW_AT_name("FETLB_VDS")
    7229                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_FETLB_VDS")
    7230                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7231                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    7232              $C$DW$746       .dwtag  DW_TAG_member
    7233                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$25)
    7234                      .dwattr $C$DW$746, DW_AT_name("FETHB_VDS")
    7235                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_FETHB_VDS")
    7236                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7237                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    7238              $C$DW$747       .dwtag  DW_TAG_member
    7239                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$25)
    7240                      .dwattr $C$DW$747, DW_AT_name("FETLA_VDS")
    7241                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_FETLA_VDS")
    7242                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7243                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    7244              $C$DW$748       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$25)
    7246                      .dwattr $C$DW$748, DW_AT_name("FETHA_VDS")
    7247                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_FETHA_VDS")
    7248                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7249                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    7250                      .dwendtag $C$DW$T$79
    7251              
    7252              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat02_t_")
    7253                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$79)
    7254                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    7255              
    7256              $C$DW$T$80      .dwtag  DW_TAG_structure_type
    7257                      .dwattr $C$DW$T$80, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  139

    7258                      .dwattr $C$DW$T$80, DW_AT_byte_size(0x0b)
    7259              $C$DW$749       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$25)
    7261                      .dwattr $C$DW$749, DW_AT_name("VCPH_OVLO_ABS")
    7262                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
    7263                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7264                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$750       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$25)
    7267                      .dwattr $C$DW$750, DW_AT_name("VCPH_OVLO")
    7268                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_VCPH_OVLO")
    7269                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7270                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    7271              $C$DW$751       .dwtag  DW_TAG_member
    7272                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$25)
    7273                      .dwattr $C$DW$751, DW_AT_name("VCPH_UVLO2")
    7274                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_VCPH_UVLO2")
    7275                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7276                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    7277              $C$DW$752       .dwtag  DW_TAG_member
    7278                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$25)
    7279                      .dwattr $C$DW$752, DW_AT_name("STAT03_RSV2")
    7280                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_STAT03_RSV2")
    7281                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7282                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    7283              $C$DW$753       .dwtag  DW_TAG_member
    7284                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$25)
    7285                      .dwattr $C$DW$753, DW_AT_name("VCP_LSD_UVLO2")
    7286                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
    7287                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7288                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    7289              $C$DW$754       .dwtag  DW_TAG_member
    7290                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$25)
    7291                      .dwattr $C$DW$754, DW_AT_name("AVDD_UVLO")
    7292                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_AVDD_UVLO")
    7293                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7294                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    7295              $C$DW$755       .dwtag  DW_TAG_member
    7296                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$25)
    7297                      .dwattr $C$DW$755, DW_AT_name("VREG_UV")
    7298                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_VREG_UV")
    7299                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7300                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    7301              $C$DW$756       .dwtag  DW_TAG_member
    7302                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$25)
    7303                      .dwattr $C$DW$756, DW_AT_name("STAT03_RSV1")
    7304                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_STAT03_RSV1")
    7305                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7306                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    7307              $C$DW$757       .dwtag  DW_TAG_member
    7308                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$25)
    7309                      .dwattr $C$DW$757, DW_AT_name("OTS")
    7310                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_OTS")
    7311                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7312                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  140

    7313              $C$DW$758       .dwtag  DW_TAG_member
    7314                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$25)
    7315                      .dwattr $C$DW$758, DW_AT_name("WD_FAULT")
    7316                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_WD_FAULT")
    7317                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7318                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    7319              $C$DW$759       .dwtag  DW_TAG_member
    7320                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$25)
    7321                      .dwattr $C$DW$759, DW_AT_name("PVDD_UVLO2")
    7322                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_PVDD_UVLO2")
    7323                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7324                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    7325                      .dwendtag $C$DW$T$80
    7326              
    7327              $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat03_t_")
    7328                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$80)
    7329                      .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    7330              
    7331              $C$DW$T$81      .dwtag  DW_TAG_structure_type
    7332                      .dwattr $C$DW$T$81, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
    7333                      .dwattr $C$DW$T$81, DW_AT_byte_size(0x0b)
    7334              $C$DW$760       .dwtag  DW_TAG_member
    7335                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$25)
    7336                      .dwattr $C$DW$760, DW_AT_name("STAT04_RSV5")
    7337                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_STAT04_RSV5")
    7338                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7339                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    7340              $C$DW$761       .dwtag  DW_TAG_member
    7341                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$25)
    7342                      .dwattr $C$DW$761, DW_AT_name("STAT04_RSV4")
    7343                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_STAT04_RSV4")
    7344                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7345                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    7346              $C$DW$762       .dwtag  DW_TAG_member
    7347                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$25)
    7348                      .dwattr $C$DW$762, DW_AT_name("STAT04_RSV3")
    7349                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_STAT04_RSV3")
    7350                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7351                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    7352              $C$DW$763       .dwtag  DW_TAG_member
    7353                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$25)
    7354                      .dwattr $C$DW$763, DW_AT_name("STAT04_RSV2")
    7355                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_STAT04_RSV2")
    7356                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7357                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    7358              $C$DW$764       .dwtag  DW_TAG_member
    7359                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$25)
    7360                      .dwattr $C$DW$764, DW_AT_name("STAT04_RSV1")
    7361                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_STAT04_RSV1")
    7362                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7363                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    7364              $C$DW$765       .dwtag  DW_TAG_member
    7365                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$25)
    7366                      .dwattr $C$DW$765, DW_AT_name("FETLC_VGS")
    7367                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_FETLC_VGS")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  141

    7368                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7369                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    7370              $C$DW$766       .dwtag  DW_TAG_member
    7371                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$25)
    7372                      .dwattr $C$DW$766, DW_AT_name("FETHC_VGS")
    7373                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_FETHC_VGS")
    7374                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7375                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    7376              $C$DW$767       .dwtag  DW_TAG_member
    7377                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$25)
    7378                      .dwattr $C$DW$767, DW_AT_name("FETLB_VGS")
    7379                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_FETLB_VGS")
    7380                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7381                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    7382              $C$DW$768       .dwtag  DW_TAG_member
    7383                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$25)
    7384                      .dwattr $C$DW$768, DW_AT_name("FETHB_VGS")
    7385                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_FETHB_VGS")
    7386                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7387                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    7388              $C$DW$769       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$25)
    7390                      .dwattr $C$DW$769, DW_AT_name("FETLA_VGS")
    7391                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_FETLA_VGS")
    7392                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7393                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    7394              $C$DW$770       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$25)
    7396                      .dwattr $C$DW$770, DW_AT_name("FETHA_VGS")
    7397                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_FETHA_VGS")
    7398                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7399                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    7400                      .dwendtag $C$DW$T$81
    7401              
    7402              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat04_t_")
    7403                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$81)
    7404                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    7405              
    7406              $C$DW$T$94      .dwtag  DW_TAG_structure_type
    7407                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Vars_t_")
    7408                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x61)
    7409              $C$DW$771       .dwtag  DW_TAG_member
    7410                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$82)
    7411                      .dwattr $C$DW$771, DW_AT_name("Stat_Reg_01")
    7412                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Stat_Reg_01")
    7413                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7414                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    7415              $C$DW$772       .dwtag  DW_TAG_member
    7416                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$83)
    7417                      .dwattr $C$DW$772, DW_AT_name("Stat_Reg_02")
    7418                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Stat_Reg_02")
    7419                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7420                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    7421              $C$DW$773       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$84)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  142

    7423                      .dwattr $C$DW$773, DW_AT_name("Stat_Reg_03")
    7424                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Stat_Reg_03")
    7425                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7426                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    7427              $C$DW$774       .dwtag  DW_TAG_member
    7428                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$85)
    7429                      .dwattr $C$DW$774, DW_AT_name("Stat_Reg_04")
    7430                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_Stat_Reg_04")
    7431                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7432                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    7433              $C$DW$775       .dwtag  DW_TAG_member
    7434                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$86)
    7435                      .dwattr $C$DW$775, DW_AT_name("Ctrl_Reg_05")
    7436                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
    7437                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7438                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    7439              $C$DW$776       .dwtag  DW_TAG_member
    7440                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$87)
    7441                      .dwattr $C$DW$776, DW_AT_name("Ctrl_Reg_06")
    7442                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
    7443                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7444                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    7445              $C$DW$777       .dwtag  DW_TAG_member
    7446                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$88)
    7447                      .dwattr $C$DW$777, DW_AT_name("Ctrl_Reg_07")
    7448                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
    7449                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    7450                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    7451              $C$DW$778       .dwtag  DW_TAG_member
    7452                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$89)
    7453                      .dwattr $C$DW$778, DW_AT_name("Ctrl_Reg_08")
    7454                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
    7455                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7456                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    7457              $C$DW$779       .dwtag  DW_TAG_member
    7458                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$90)
    7459                      .dwattr $C$DW$779, DW_AT_name("Ctrl_Reg_09")
    7460                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
    7461                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
    7462                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    7463              $C$DW$780       .dwtag  DW_TAG_member
    7464                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$91)
    7465                      .dwattr $C$DW$780, DW_AT_name("Ctrl_Reg_0A")
    7466                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
    7467                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
    7468                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    7469              $C$DW$781       .dwtag  DW_TAG_member
    7470                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$92)
    7471                      .dwattr $C$DW$781, DW_AT_name("Ctrl_Reg_0B")
    7472                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
    7473                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7474                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    7475              $C$DW$782       .dwtag  DW_TAG_member
    7476                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$93)
    7477                      .dwattr $C$DW$782, DW_AT_name("Ctrl_Reg_0C")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  143

    7478                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
    7479                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    7480                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    7481              $C$DW$783       .dwtag  DW_TAG_member
    7482                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$25)
    7483                      .dwattr $C$DW$783, DW_AT_name("WriteCmd")
    7484                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_WriteCmd")
    7485                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
    7486                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    7487              $C$DW$784       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$25)
    7489                      .dwattr $C$DW$784, DW_AT_name("ReadCmd")
    7490                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_ReadCmd")
    7491                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    7492                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    7493              $C$DW$785       .dwtag  DW_TAG_member
    7494                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$52)
    7495                      .dwattr $C$DW$785, DW_AT_name("ManWriteAddr")
    7496                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_ManWriteAddr")
    7497                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
    7498                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    7499              $C$DW$786       .dwtag  DW_TAG_member
    7500                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$52)
    7501                      .dwattr $C$DW$786, DW_AT_name("ManReadAddr")
    7502                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_ManReadAddr")
    7503                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7504                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    7505              $C$DW$787       .dwtag  DW_TAG_member
    7506                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$52)
    7507                      .dwattr $C$DW$787, DW_AT_name("ManWriteData")
    7508                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_ManWriteData")
    7509                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    7510                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    7511              $C$DW$788       .dwtag  DW_TAG_member
    7512                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$52)
    7513                      .dwattr $C$DW$788, DW_AT_name("ManReadData")
    7514                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_ManReadData")
    7515                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7516                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    7517              $C$DW$789       .dwtag  DW_TAG_member
    7518                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$25)
    7519                      .dwattr $C$DW$789, DW_AT_name("ManWriteCmd")
    7520                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_ManWriteCmd")
    7521                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7522                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    7523              $C$DW$790       .dwtag  DW_TAG_member
    7524                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$25)
    7525                      .dwattr $C$DW$790, DW_AT_name("ManReadCmd")
    7526                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_ManReadCmd")
    7527                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7528                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    7529                      .dwendtag $C$DW$T$94
    7530              
    7531              $C$DW$T$199     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Vars_t")
    7532                      .dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$94)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  144

    7533                      .dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
    7534              $C$DW$T$200     .dwtag  DW_TAG_pointer_type
    7535                      .dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
    7536                      .dwattr $C$DW$T$200, DW_AT_address_class(0x20)
    7537              $C$DW$791       .dwtag  DW_TAG_TI_far_type
    7538                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$200)
    7539              $C$DW$T$201     .dwtag  DW_TAG_const_type
    7540                      .dwattr $C$DW$T$201, DW_AT_type(*$C$DW$791)
    7541              
    7542              $C$DW$T$104     .dwtag  DW_TAG_structure_type
    7543                      .dwattr $C$DW$T$104, DW_AT_name("_GPIO_Obj_")
    7544                      .dwattr $C$DW$T$104, DW_AT_byte_size(0x6a)
    7545              $C$DW$792       .dwtag  DW_TAG_member
    7546                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$96)
    7547                      .dwattr $C$DW$792, DW_AT_name("GPACTRL")
    7548                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_GPACTRL")
    7549                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7550                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    7551              $C$DW$793       .dwtag  DW_TAG_member
    7552                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$96)
    7553                      .dwattr $C$DW$793, DW_AT_name("GPAQSEL1")
    7554                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_GPAQSEL1")
    7555                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7556                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    7557              $C$DW$794       .dwtag  DW_TAG_member
    7558                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$96)
    7559                      .dwattr $C$DW$794, DW_AT_name("GPAQSEL2")
    7560                      .dwattr $C$DW$794, DW_AT_TI_symbol_name("_GPAQSEL2")
    7561                      .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7562                      .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    7563              $C$DW$795       .dwtag  DW_TAG_member
    7564                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$96)
    7565                      .dwattr $C$DW$795, DW_AT_name("GPAMUX1")
    7566                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_GPAMUX1")
    7567                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7568                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    7569              $C$DW$796       .dwtag  DW_TAG_member
    7570                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$96)
    7571                      .dwattr $C$DW$796, DW_AT_name("GPAMUX2")
    7572                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_GPAMUX2")
    7573                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7574                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    7575              $C$DW$797       .dwtag  DW_TAG_member
    7576                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$96)
    7577                      .dwattr $C$DW$797, DW_AT_name("GPADIR")
    7578                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_GPADIR")
    7579                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7580                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    7581              $C$DW$798       .dwtag  DW_TAG_member
    7582                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$96)
    7583                      .dwattr $C$DW$798, DW_AT_name("GPAPUD")
    7584                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_GPAPUD")
    7585                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7586                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    7587              $C$DW$799       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  145

    7588                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$98)
    7589                      .dwattr $C$DW$799, DW_AT_name("rsvd_1")
    7590                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_rsvd_1")
    7591                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7592                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    7593              $C$DW$800       .dwtag  DW_TAG_member
    7594                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$96)
    7595                      .dwattr $C$DW$800, DW_AT_name("GPBCTRL")
    7596                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_GPBCTRL")
    7597                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7598                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    7599              $C$DW$801       .dwtag  DW_TAG_member
    7600                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$96)
    7601                      .dwattr $C$DW$801, DW_AT_name("GPBQSEL1")
    7602                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_GPBQSEL1")
    7603                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7604                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    7605              $C$DW$802       .dwtag  DW_TAG_member
    7606                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$98)
    7607                      .dwattr $C$DW$802, DW_AT_name("rsvd_2")
    7608                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_rsvd_2")
    7609                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7610                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    7611              $C$DW$803       .dwtag  DW_TAG_member
    7612                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$96)
    7613                      .dwattr $C$DW$803, DW_AT_name("GPBMUX1")
    7614                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_GPBMUX1")
    7615                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7616                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    7617              $C$DW$804       .dwtag  DW_TAG_member
    7618                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$98)
    7619                      .dwattr $C$DW$804, DW_AT_name("rsvd_3")
    7620                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_rsvd_3")
    7621                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7622                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    7623              $C$DW$805       .dwtag  DW_TAG_member
    7624                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$96)
    7625                      .dwattr $C$DW$805, DW_AT_name("GPBDIR")
    7626                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_GPBDIR")
    7627                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7628                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    7629              $C$DW$806       .dwtag  DW_TAG_member
    7630                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$96)
    7631                      .dwattr $C$DW$806, DW_AT_name("GPBPUD")
    7632                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_GPBPUD")
    7633                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7634                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    7635              $C$DW$807       .dwtag  DW_TAG_member
    7636                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$99)
    7637                      .dwattr $C$DW$807, DW_AT_name("rsvd_4")
    7638                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_rsvd_4")
    7639                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7640                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    7641              $C$DW$808       .dwtag  DW_TAG_member
    7642                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$96)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  146

    7643                      .dwattr $C$DW$808, DW_AT_name("AIOMUX1")
    7644                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_AIOMUX1")
    7645                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    7646                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    7647              $C$DW$809       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$98)
    7649                      .dwattr $C$DW$809, DW_AT_name("rsvd_5")
    7650                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_rsvd_5")
    7651                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7652                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$810       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$96)
    7655                      .dwattr $C$DW$810, DW_AT_name("AIODIR")
    7656                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_AIODIR")
    7657                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    7658                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$811       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$100)
    7661                      .dwattr $C$DW$811, DW_AT_name("rsvd_6")
    7662                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_rsvd_6")
    7663                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7664                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$812       .dwtag  DW_TAG_member
    7666                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$96)
    7667                      .dwattr $C$DW$812, DW_AT_name("GPADAT")
    7668                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_GPADAT")
    7669                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7670                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    7671              $C$DW$813       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$96)
    7673                      .dwattr $C$DW$813, DW_AT_name("GPASET")
    7674                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_GPASET")
    7675                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    7676                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$814       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$96)
    7679                      .dwattr $C$DW$814, DW_AT_name("GPACLEAR")
    7680                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_GPACLEAR")
    7681                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7682                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    7683              $C$DW$815       .dwtag  DW_TAG_member
    7684                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$96)
    7685                      .dwattr $C$DW$815, DW_AT_name("GPATOGGLE")
    7686                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_GPATOGGLE")
    7687                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    7688                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    7689              $C$DW$816       .dwtag  DW_TAG_member
    7690                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$96)
    7691                      .dwattr $C$DW$816, DW_AT_name("GPBDAT")
    7692                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_GPBDAT")
    7693                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7694                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    7695              $C$DW$817       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$96)
    7697                      .dwattr $C$DW$817, DW_AT_name("GPBSET")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  147

    7698                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_GPBSET")
    7699                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    7700                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    7701              $C$DW$818       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$96)
    7703                      .dwattr $C$DW$818, DW_AT_name("GPBCLEAR")
    7704                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_GPBCLEAR")
    7705                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7706                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    7707              $C$DW$819       .dwtag  DW_TAG_member
    7708                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$96)
    7709                      .dwattr $C$DW$819, DW_AT_name("GPBTOGGLE")
    7710                      .dwattr $C$DW$819, DW_AT_TI_symbol_name("_GPBTOGGLE")
    7711                      .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    7712                      .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    7713              $C$DW$820       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$820, DW_AT_type(*$C$DW$T$101)
    7715                      .dwattr $C$DW$820, DW_AT_name("rsvd_7")
    7716                      .dwattr $C$DW$820, DW_AT_TI_symbol_name("_rsvd_7")
    7717                      .dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7718                      .dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
    7719              $C$DW$821       .dwtag  DW_TAG_member
    7720                      .dwattr $C$DW$821, DW_AT_type(*$C$DW$T$96)
    7721                      .dwattr $C$DW$821, DW_AT_name("AIODAT")
    7722                      .dwattr $C$DW$821, DW_AT_TI_symbol_name("_AIODAT")
    7723                      .dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7724                      .dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
    7725              $C$DW$822       .dwtag  DW_TAG_member
    7726                      .dwattr $C$DW$822, DW_AT_type(*$C$DW$T$96)
    7727                      .dwattr $C$DW$822, DW_AT_name("AIOSET")
    7728                      .dwattr $C$DW$822, DW_AT_TI_symbol_name("_AIOSET")
    7729                      .dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    7730                      .dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
    7731              $C$DW$823       .dwtag  DW_TAG_member
    7732                      .dwattr $C$DW$823, DW_AT_type(*$C$DW$T$96)
    7733                      .dwattr $C$DW$823, DW_AT_name("AIOCLEAR")
    7734                      .dwattr $C$DW$823, DW_AT_TI_symbol_name("_AIOCLEAR")
    7735                      .dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7736                      .dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
    7737              $C$DW$824       .dwtag  DW_TAG_member
    7738                      .dwattr $C$DW$824, DW_AT_type(*$C$DW$T$96)
    7739                      .dwattr $C$DW$824, DW_AT_name("AIOTOGGLE")
    7740                      .dwattr $C$DW$824, DW_AT_TI_symbol_name("_AIOTOGGLE")
    7741                      .dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7742                      .dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
    7743              $C$DW$825       .dwtag  DW_TAG_member
    7744                      .dwattr $C$DW$825, DW_AT_type(*$C$DW$T$102)
    7745                      .dwattr $C$DW$825, DW_AT_name("GPIOXINTnSEL")
    7746                      .dwattr $C$DW$825, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    7747                      .dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7748                      .dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
    7749              $C$DW$826       .dwtag  DW_TAG_member
    7750                      .dwattr $C$DW$826, DW_AT_type(*$C$DW$T$103)
    7751                      .dwattr $C$DW$826, DW_AT_name("rsvd_8")
    7752                      .dwattr $C$DW$826, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  148

    7753                      .dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    7754                      .dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
    7755              $C$DW$827       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$827, DW_AT_type(*$C$DW$T$96)
    7757                      .dwattr $C$DW$827, DW_AT_name("GPIOLPMSEL")
    7758                      .dwattr $C$DW$827, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    7759                      .dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    7760                      .dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
    7761                      .dwendtag $C$DW$T$104
    7762              
    7763              $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    7764                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$104)
    7765                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    7766              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    7767                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    7768                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    7769              $C$DW$828       .dwtag  DW_TAG_TI_far_type
    7770                      .dwattr $C$DW$828, DW_AT_type(*$C$DW$T$22)
    7771              $C$DW$T$204     .dwtag  DW_TAG_const_type
    7772                      .dwattr $C$DW$T$204, DW_AT_type(*$C$DW$828)
    7773              
    7774              $C$DW$T$105     .dwtag  DW_TAG_structure_type
    7775                      .dwattr $C$DW$T$105, DW_AT_name("_SPI_Obj_")
    7776                      .dwattr $C$DW$T$105, DW_AT_byte_size(0x10)
    7777              $C$DW$829       .dwtag  DW_TAG_member
    7778                      .dwattr $C$DW$829, DW_AT_type(*$C$DW$T$97)
    7779                      .dwattr $C$DW$829, DW_AT_name("SPICCR")
    7780                      .dwattr $C$DW$829, DW_AT_TI_symbol_name("_SPICCR")
    7781                      .dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7782                      .dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
    7783              $C$DW$830       .dwtag  DW_TAG_member
    7784                      .dwattr $C$DW$830, DW_AT_type(*$C$DW$T$97)
    7785                      .dwattr $C$DW$830, DW_AT_name("SPICTL")
    7786                      .dwattr $C$DW$830, DW_AT_TI_symbol_name("_SPICTL")
    7787                      .dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7788                      .dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
    7789              $C$DW$831       .dwtag  DW_TAG_member
    7790                      .dwattr $C$DW$831, DW_AT_type(*$C$DW$T$97)
    7791                      .dwattr $C$DW$831, DW_AT_name("SPIST")
    7792                      .dwattr $C$DW$831, DW_AT_TI_symbol_name("_SPIST")
    7793                      .dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7794                      .dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
    7795              $C$DW$832       .dwtag  DW_TAG_member
    7796                      .dwattr $C$DW$832, DW_AT_type(*$C$DW$T$97)
    7797                      .dwattr $C$DW$832, DW_AT_name("rsvd_1")
    7798                      .dwattr $C$DW$832, DW_AT_TI_symbol_name("_rsvd_1")
    7799                      .dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7800                      .dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
    7801              $C$DW$833       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$833, DW_AT_type(*$C$DW$T$97)
    7803                      .dwattr $C$DW$833, DW_AT_name("SPIBRR")
    7804                      .dwattr $C$DW$833, DW_AT_TI_symbol_name("_SPIBRR")
    7805                      .dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7806                      .dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
    7807              $C$DW$834       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  149

    7808                      .dwattr $C$DW$834, DW_AT_type(*$C$DW$T$97)
    7809                      .dwattr $C$DW$834, DW_AT_name("rsvd_2")
    7810                      .dwattr $C$DW$834, DW_AT_TI_symbol_name("_rsvd_2")
    7811                      .dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7812                      .dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
    7813              $C$DW$835       .dwtag  DW_TAG_member
    7814                      .dwattr $C$DW$835, DW_AT_type(*$C$DW$T$97)
    7815                      .dwattr $C$DW$835, DW_AT_name("SPIEMU")
    7816                      .dwattr $C$DW$835, DW_AT_TI_symbol_name("_SPIEMU")
    7817                      .dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7818                      .dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
    7819              $C$DW$836       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$836, DW_AT_type(*$C$DW$T$97)
    7821                      .dwattr $C$DW$836, DW_AT_name("SPIRXBUF")
    7822                      .dwattr $C$DW$836, DW_AT_TI_symbol_name("_SPIRXBUF")
    7823                      .dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7824                      .dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
    7825              $C$DW$837       .dwtag  DW_TAG_member
    7826                      .dwattr $C$DW$837, DW_AT_type(*$C$DW$T$97)
    7827                      .dwattr $C$DW$837, DW_AT_name("SPITXBUF")
    7828                      .dwattr $C$DW$837, DW_AT_TI_symbol_name("_SPITXBUF")
    7829                      .dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7830                      .dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
    7831              $C$DW$838       .dwtag  DW_TAG_member
    7832                      .dwattr $C$DW$838, DW_AT_type(*$C$DW$T$97)
    7833                      .dwattr $C$DW$838, DW_AT_name("SPIDAT")
    7834                      .dwattr $C$DW$838, DW_AT_TI_symbol_name("_SPIDAT")
    7835                      .dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7836                      .dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
    7837              $C$DW$839       .dwtag  DW_TAG_member
    7838                      .dwattr $C$DW$839, DW_AT_type(*$C$DW$T$97)
    7839                      .dwattr $C$DW$839, DW_AT_name("SPIFFTX")
    7840                      .dwattr $C$DW$839, DW_AT_TI_symbol_name("_SPIFFTX")
    7841                      .dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7842                      .dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
    7843              $C$DW$840       .dwtag  DW_TAG_member
    7844                      .dwattr $C$DW$840, DW_AT_type(*$C$DW$T$97)
    7845                      .dwattr $C$DW$840, DW_AT_name("SPIFFRX")
    7846                      .dwattr $C$DW$840, DW_AT_TI_symbol_name("_SPIFFRX")
    7847                      .dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7848                      .dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
    7849              $C$DW$841       .dwtag  DW_TAG_member
    7850                      .dwattr $C$DW$841, DW_AT_type(*$C$DW$T$97)
    7851                      .dwattr $C$DW$841, DW_AT_name("SPIFFCT")
    7852                      .dwattr $C$DW$841, DW_AT_TI_symbol_name("_SPIFFCT")
    7853                      .dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7854                      .dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
    7855              $C$DW$842       .dwtag  DW_TAG_member
    7856                      .dwattr $C$DW$842, DW_AT_type(*$C$DW$T$98)
    7857                      .dwattr $C$DW$842, DW_AT_name("rsvd_3")
    7858                      .dwattr $C$DW$842, DW_AT_TI_symbol_name("_rsvd_3")
    7859                      .dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7860                      .dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
    7861              $C$DW$843       .dwtag  DW_TAG_member
    7862                      .dwattr $C$DW$843, DW_AT_type(*$C$DW$T$97)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:11 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0850810                          PAGE  150

    7863                      .dwattr $C$DW$843, DW_AT_name("SPIPRI")
    7864                      .dwattr $C$DW$843, DW_AT_TI_symbol_name("_SPIPRI")
