TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:12 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/gpio/src/32b/f28x/f2802
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem

    1600              $C$DW$218       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1601              $C$DW$219       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_SDAA"), DW_AT_const_value(0x01)
    1602              $C$DW$220       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_EPWMSYNCI"), DW_AT_const_value(0x02)
    1603              $C$DW$221       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_32_Mode_ADCSOCAO_NOT"), DW_AT_const_value(0x03)
    1604              $C$DW$222       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1605              $C$DW$223       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_SCLA"), DW_AT_const_value(0x01)
    1606              $C$DW$224       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_EPWMSYNCO"), DW_AT_const_value(0x02)
    1607              $C$DW$225       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_33_Mode_ADCSOCBO_NOT"), DW_AT_const_value(0x03)
    1608              $C$DW$226       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_GeneralPurpose"), DW_AT_const_value(0x00)
    1609              $C$DW$227       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_COMP2OUT"), DW_AT_const_value(0x01)
    1610              $C$DW$228       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1611              $C$DW$229       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_34_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1612              $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_JTAG_TDI"), DW_AT_const_value(0x00)
    1613              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1614              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_2"), DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   31

    1615              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_35_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1616              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_JTAG_TMS"), DW_AT_const_value(0x00)
    1617              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1618              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1619              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_36_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1620              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_JTAG_TDO"), DW_AT_const_value(0x00)
    1621              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1622              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1623              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_37_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1624              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_JTAG_TCK"), DW_AT_const_value(0x00)
    1625              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_1"), DW_AT_const_value(0x01)
    1626              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_2"), DW_AT_const_value(0x02)
    1627              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_38_Mode_Rsvd_3"), DW_AT_const_value(0x03)
    1628                      .dwendtag $C$DW$T$45
    1629              
    1630              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Mode_e")
    1631                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1632                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1633              $C$DW$246       .dwtag  DW_TAG_TI_far_type
    1634                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$46)
    1635              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1636                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$246)
    1637              
    1638              $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
    1639                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1640              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sync"), DW_AT_const_value(0x00)
    1641              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_3"), DW_AT_const_value(0x01)
    1642              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_Sample_6"), DW_AT_const_value(0x02)
    1643              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("GPIO_Qual_ASync"), DW_AT_const_value(0x03)
    1644                      .dwendtag $C$DW$T$48
    1645              
    1646              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Qual_e")
    1647                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1648                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1649              $C$DW$251       .dwtag  DW_TAG_TI_far_type
    1650                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$49)
    1651              $C$DW$T$50      .dwtag  DW_TAG_const_type
    1652                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$251)
    1653              
    1654              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1655                      .dwattr $C$DW$T$29, DW_AT_name("_GPIO_Obj_")
    1656                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6a)
    1657              $C$DW$252       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$20)
    1659                      .dwattr $C$DW$252, DW_AT_name("GPACTRL")
    1660                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPACTRL")
    1661                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$253       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    1665                      .dwattr $C$DW$253, DW_AT_name("GPAQSEL1")
    1666                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPAQSEL1")
    1667                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1668                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$254       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   32

    1670                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    1671                      .dwattr $C$DW$254, DW_AT_name("GPAQSEL2")
    1672                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPAQSEL2")
    1673                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1674                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$255       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    1677                      .dwattr $C$DW$255, DW_AT_name("GPAMUX1")
    1678                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPAMUX1")
    1679                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1680                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$256       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    1683                      .dwattr $C$DW$256, DW_AT_name("GPAMUX2")
    1684                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPAMUX2")
    1685                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1686                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$257       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    1689                      .dwattr $C$DW$257, DW_AT_name("GPADIR")
    1690                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPADIR")
    1691                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1692                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$258       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$20)
    1695                      .dwattr $C$DW$258, DW_AT_name("GPAPUD")
    1696                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_GPAPUD")
    1697                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1698                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$259       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$23)
    1701                      .dwattr $C$DW$259, DW_AT_name("rsvd_1")
    1702                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd_1")
    1703                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1704                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$260       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$20)
    1707                      .dwattr $C$DW$260, DW_AT_name("GPBCTRL")
    1708                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPBCTRL")
    1709                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1710                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$261       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    1713                      .dwattr $C$DW$261, DW_AT_name("GPBQSEL1")
    1714                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPBQSEL1")
    1715                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1716                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$262       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$23)
    1719                      .dwattr $C$DW$262, DW_AT_name("rsvd_2")
    1720                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_rsvd_2")
    1721                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1722                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$263       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   33

    1725                      .dwattr $C$DW$263, DW_AT_name("GPBMUX1")
    1726                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPBMUX1")
    1727                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1728                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$264       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$23)
    1731                      .dwattr $C$DW$264, DW_AT_name("rsvd_3")
    1732                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_rsvd_3")
    1733                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1734                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$265       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    1737                      .dwattr $C$DW$265, DW_AT_name("GPBDIR")
    1738                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPBDIR")
    1739                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1740                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$266       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    1743                      .dwattr $C$DW$266, DW_AT_name("GPBPUD")
    1744                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPBPUD")
    1745                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1746                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$267       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$24)
    1749                      .dwattr $C$DW$267, DW_AT_name("rsvd_4")
    1750                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd_4")
    1751                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1752                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$268       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$20)
    1755                      .dwattr $C$DW$268, DW_AT_name("AIOMUX1")
    1756                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_AIOMUX1")
    1757                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1758                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$269       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$23)
    1761                      .dwattr $C$DW$269, DW_AT_name("rsvd_5")
    1762                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_rsvd_5")
    1763                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1764                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$270       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$20)
    1767                      .dwattr $C$DW$270, DW_AT_name("AIODIR")
    1768                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_AIODIR")
    1769                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1770                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$271       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
    1773                      .dwattr $C$DW$271, DW_AT_name("rsvd_6")
    1774                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_rsvd_6")
    1775                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1776                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$272       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    1779                      .dwattr $C$DW$272, DW_AT_name("GPADAT")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   34

    1780                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPADAT")
    1781                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1782                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$273       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    1785                      .dwattr $C$DW$273, DW_AT_name("GPASET")
    1786                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_GPASET")
    1787                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1788                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$274       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    1791                      .dwattr $C$DW$274, DW_AT_name("GPACLEAR")
    1792                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPACLEAR")
    1793                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1794                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$275       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$20)
    1797                      .dwattr $C$DW$275, DW_AT_name("GPATOGGLE")
    1798                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPATOGGLE")
    1799                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1800                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$276       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    1803                      .dwattr $C$DW$276, DW_AT_name("GPBDAT")
    1804                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPBDAT")
    1805                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1806                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$277       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    1809                      .dwattr $C$DW$277, DW_AT_name("GPBSET")
    1810                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPBSET")
    1811                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1812                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$278       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$20)
    1815                      .dwattr $C$DW$278, DW_AT_name("GPBCLEAR")
    1816                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPBCLEAR")
    1817                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1818                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$279       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$20)
    1821                      .dwattr $C$DW$279, DW_AT_name("GPBTOGGLE")
    1822                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_GPBTOGGLE")
    1823                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1824                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$280       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$26)
    1827                      .dwattr $C$DW$280, DW_AT_name("rsvd_7")
    1828                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd_7")
    1829                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1830                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$281       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    1833                      .dwattr $C$DW$281, DW_AT_name("AIODAT")
    1834                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_AIODAT")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   35

    1835                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1836                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$282       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$20)
    1839                      .dwattr $C$DW$282, DW_AT_name("AIOSET")
    1840                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_AIOSET")
    1841                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1842                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$283       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$20)
    1845                      .dwattr $C$DW$283, DW_AT_name("AIOCLEAR")
    1846                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_AIOCLEAR")
    1847                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1848                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$284       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    1851                      .dwattr $C$DW$284, DW_AT_name("AIOTOGGLE")
    1852                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_AIOTOGGLE")
    1853                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1854                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$285       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$27)
    1857                      .dwattr $C$DW$285, DW_AT_name("GPIOXINTnSEL")
    1858                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_GPIOXINTnSEL")
    1859                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1860                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$286       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$28)
    1863                      .dwattr $C$DW$286, DW_AT_name("rsvd_8")
    1864                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_rsvd_8")
    1865                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x63]
    1866                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$287       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    1869                      .dwattr $C$DW$287, DW_AT_name("GPIOLPMSEL")
    1870                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_GPIOLPMSEL")
    1871                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1872                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    1873                      .dwendtag $C$DW$T$29
    1874              
    1875              $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Obj")
    1876                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$29)
    1877                      .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1878              $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1879                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$29)
    1880                      .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    1881              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle")
    1882                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1883                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1884              $C$DW$288       .dwtag  DW_TAG_TI_far_type
    1885                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$53)
    1886              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1887                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$288)
    1888              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1889                      .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:12 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0046810                          PAGE   36

    1890              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1891                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1892                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1893              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1894                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1895                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1896                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1897              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1898                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1899                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1900                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1901              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1902                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1903                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1904                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1905              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1906                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1907                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1908                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1909              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1910                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1911                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1912                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1913              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1914                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1915                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1916                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1917              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1918                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1919                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1920                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1921              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1922                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1923                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
