TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Tue Sep 15 13:02:09 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/hal/boards/boostxldrv83
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a\Flash")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SPI_reset")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SPI_reset")

    9435                      .dwattr $C$DW$1748, DW_AT_type(*$C$DW$T$350)
    9436              $C$DW$T$351     .dwtag  DW_TAG_const_type
    9437                      .dwattr $C$DW$T$351, DW_AT_type(*$C$DW$1748)
    9438              
    9439              $C$DW$T$352     .dwtag  DW_TAG_enumeration_type
    9440                      .dwattr $C$DW$T$352, DW_AT_byte_size(0x01)
    9441              $C$DW$1749      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputRisingEdge_InputFallingEdge"), D
    9442              $C$DW$1750      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_ClkPolarity_OutputFallingEdge_InputRisingEdge"), D
    9443                      .dwendtag $C$DW$T$352
    9444              
    9445              $C$DW$T$353     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_ClkPolarity_e")
    9446                      .dwattr $C$DW$T$353, DW_AT_type(*$C$DW$T$352)
    9447                      .dwattr $C$DW$T$353, DW_AT_language(DW_LANG_C)
    9448              $C$DW$1751      .dwtag  DW_TAG_TI_far_type
    9449                      .dwattr $C$DW$1751, DW_AT_type(*$C$DW$T$353)
    9450              $C$DW$T$354     .dwtag  DW_TAG_const_type
    9451                      .dwattr $C$DW$T$354, DW_AT_type(*$C$DW$1751)
    9452              
    9453              $C$DW$T$355     .dwtag  DW_TAG_enumeration_type
    9454                      .dwattr $C$DW$T$355, DW_AT_byte_size(0x01)
    9455              $C$DW$1752      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Slave"), DW_AT_const_value(0x00)
    9456              $C$DW$1753      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_Mode_Master"), DW_AT_const_value(0x04)
    9457                      .dwendtag $C$DW$T$355
    9458              
    9459              $C$DW$T$356     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_Mode_e")
    9460                      .dwattr $C$DW$T$356, DW_AT_type(*$C$DW$T$355)
    9461                      .dwattr $C$DW$T$356, DW_AT_language(DW_LANG_C)
    9462              $C$DW$1754      .dwtag  DW_TAG_TI_far_type
    9463                      .dwattr $C$DW$1754, DW_AT_type(*$C$DW$T$356)
    9464              $C$DW$T$357     .dwtag  DW_TAG_const_type
    9465                      .dwattr $C$DW$T$357, DW_AT_type(*$C$DW$1754)
    9466              
    9467              $C$DW$T$358     .dwtag  DW_TAG_enumeration_type
    9468                      .dwattr $C$DW$T$358, DW_AT_byte_size(0x01)
    9469              $C$DW$1755      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_00"), DW_AT_const_value(0x00)
    9470              $C$DW$1756      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_10"), DW_AT_const_value(0x20)
    9471              $C$DW$1757      .dwtag  DW_TAG_enumerator, DW_AT_name("SPI_TxSuspend_free"), DW_AT_const_value(0x10)
    9472                      .dwendtag $C$DW$T$358
    9473              
    9474              $C$DW$T$359     .dwtag  DW_TAG_typedef, DW_AT_name("SPI_EmulationSuspend_e")
    9475                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
    9476                      .dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
    9477              $C$DW$1758      .dwtag  DW_TAG_TI_far_type
    9478                      .dwattr $C$DW$1758, DW_AT_type(*$C$DW$T$359)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  182

    9479              $C$DW$T$360     .dwtag  DW_TAG_const_type
    9480                      .dwattr $C$DW$T$360, DW_AT_type(*$C$DW$1758)
    9481              
    9482              $C$DW$T$361     .dwtag  DW_TAG_enumeration_type
    9483                      .dwattr $C$DW$T$361, DW_AT_byte_size(0x01)
    9484              $C$DW$1759      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAfterNextDecrement"), DW_AT_co
    9485              $C$DW$1760      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_StopAtZero"), DW_AT_const_value(0x
    9486              $C$DW$1761      .dwtag  DW_TAG_enumerator, DW_AT_name("TIMER_EmulationMode_RunFree"), DW_AT_const_value(0x800
    9487                      .dwendtag $C$DW$T$361
    9488              
    9489              $C$DW$T$362     .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_EmulationMode_e")
    9490                      .dwattr $C$DW$T$362, DW_AT_type(*$C$DW$T$361)
    9491                      .dwattr $C$DW$T$362, DW_AT_language(DW_LANG_C)
    9492              $C$DW$1762      .dwtag  DW_TAG_TI_far_type
    9493                      .dwattr $C$DW$1762, DW_AT_type(*$C$DW$T$362)
    9494              $C$DW$T$363     .dwtag  DW_TAG_const_type
    9495                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$1762)
    9496              
    9497              $C$DW$T$364     .dwtag  DW_TAG_enumeration_type
    9498                      .dwattr $C$DW$T$364, DW_AT_byte_size(0x01)
    9499              $C$DW$1763      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    9500              $C$DW$1764      .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    9501                      .dwendtag $C$DW$T$364
    9502              
    9503              $C$DW$T$365     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    9504                      .dwattr $C$DW$T$365, DW_AT_type(*$C$DW$T$364)
    9505                      .dwattr $C$DW$T$365, DW_AT_language(DW_LANG_C)
    9506              
    9507              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    9508                      .dwattr $C$DW$T$29, DW_AT_name("_ADC_Obj_")
    9509                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x6650)
    9510              $C$DW$1765      .dwtag  DW_TAG_member
    9511                      .dwattr $C$DW$1765, DW_AT_type(*$C$DW$T$23)
    9512                      .dwattr $C$DW$1765, DW_AT_name("ADCRESULT")
    9513                      .dwattr $C$DW$1765, DW_AT_TI_symbol_name("_ADCRESULT")
    9514                      .dwattr $C$DW$1765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9515                      .dwattr $C$DW$1765, DW_AT_accessibility(DW_ACCESS_public)
    9516              $C$DW$1766      .dwtag  DW_TAG_member
    9517                      .dwattr $C$DW$1766, DW_AT_type(*$C$DW$T$24)
    9518                      .dwattr $C$DW$1766, DW_AT_name("resvd_1")
    9519                      .dwattr $C$DW$1766, DW_AT_TI_symbol_name("_resvd_1")
    9520                      .dwattr $C$DW$1766, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9521                      .dwattr $C$DW$1766, DW_AT_accessibility(DW_ACCESS_public)
    9522              $C$DW$1767      .dwtag  DW_TAG_member
    9523                      .dwattr $C$DW$1767, DW_AT_type(*$C$DW$T$22)
    9524                      .dwattr $C$DW$1767, DW_AT_name("ADCCTL1")
    9525                      .dwattr $C$DW$1767, DW_AT_TI_symbol_name("_ADCCTL1")
    9526                      .dwattr $C$DW$1767, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    9527                      .dwattr $C$DW$1767, DW_AT_accessibility(DW_ACCESS_public)
    9528              $C$DW$1768      .dwtag  DW_TAG_member
    9529                      .dwattr $C$DW$1768, DW_AT_type(*$C$DW$T$22)
    9530                      .dwattr $C$DW$1768, DW_AT_name("ADCCTL2")
    9531                      .dwattr $C$DW$1768, DW_AT_TI_symbol_name("_ADCCTL2")
    9532                      .dwattr $C$DW$1768, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    9533                      .dwattr $C$DW$1768, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  183

    9534              $C$DW$1769      .dwtag  DW_TAG_member
    9535                      .dwattr $C$DW$1769, DW_AT_type(*$C$DW$T$25)
    9536                      .dwattr $C$DW$1769, DW_AT_name("rsvd_2")
    9537                      .dwattr $C$DW$1769, DW_AT_TI_symbol_name("_rsvd_2")
    9538                      .dwattr $C$DW$1769, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    9539                      .dwattr $C$DW$1769, DW_AT_accessibility(DW_ACCESS_public)
    9540              $C$DW$1770      .dwtag  DW_TAG_member
    9541                      .dwattr $C$DW$1770, DW_AT_type(*$C$DW$T$22)
    9542                      .dwattr $C$DW$1770, DW_AT_name("ADCINTFLG")
    9543                      .dwattr $C$DW$1770, DW_AT_TI_symbol_name("_ADCINTFLG")
    9544                      .dwattr $C$DW$1770, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    9545                      .dwattr $C$DW$1770, DW_AT_accessibility(DW_ACCESS_public)
    9546              $C$DW$1771      .dwtag  DW_TAG_member
    9547                      .dwattr $C$DW$1771, DW_AT_type(*$C$DW$T$22)
    9548                      .dwattr $C$DW$1771, DW_AT_name("ADCINTFLGCLR")
    9549                      .dwattr $C$DW$1771, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    9550                      .dwattr $C$DW$1771, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    9551                      .dwattr $C$DW$1771, DW_AT_accessibility(DW_ACCESS_public)
    9552              $C$DW$1772      .dwtag  DW_TAG_member
    9553                      .dwattr $C$DW$1772, DW_AT_type(*$C$DW$T$22)
    9554                      .dwattr $C$DW$1772, DW_AT_name("ADCINTOVF")
    9555                      .dwattr $C$DW$1772, DW_AT_TI_symbol_name("_ADCINTOVF")
    9556                      .dwattr $C$DW$1772, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    9557                      .dwattr $C$DW$1772, DW_AT_accessibility(DW_ACCESS_public)
    9558              $C$DW$1773      .dwtag  DW_TAG_member
    9559                      .dwattr $C$DW$1773, DW_AT_type(*$C$DW$T$22)
    9560                      .dwattr $C$DW$1773, DW_AT_name("ADCINTOVFCLR")
    9561                      .dwattr $C$DW$1773, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    9562                      .dwattr $C$DW$1773, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    9563                      .dwattr $C$DW$1773, DW_AT_accessibility(DW_ACCESS_public)
    9564              $C$DW$1774      .dwtag  DW_TAG_member
    9565                      .dwattr $C$DW$1774, DW_AT_type(*$C$DW$T$26)
    9566                      .dwattr $C$DW$1774, DW_AT_name("INTSELxNy")
    9567                      .dwattr $C$DW$1774, DW_AT_TI_symbol_name("_INTSELxNy")
    9568                      .dwattr $C$DW$1774, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    9569                      .dwattr $C$DW$1774, DW_AT_accessibility(DW_ACCESS_public)
    9570              $C$DW$1775      .dwtag  DW_TAG_member
    9571                      .dwattr $C$DW$1775, DW_AT_type(*$C$DW$T$27)
    9572                      .dwattr $C$DW$1775, DW_AT_name("rsvd_3")
    9573                      .dwattr $C$DW$1775, DW_AT_TI_symbol_name("_rsvd_3")
    9574                      .dwattr $C$DW$1775, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    9575                      .dwattr $C$DW$1775, DW_AT_accessibility(DW_ACCESS_public)
    9576              $C$DW$1776      .dwtag  DW_TAG_member
    9577                      .dwattr $C$DW$1776, DW_AT_type(*$C$DW$T$22)
    9578                      .dwattr $C$DW$1776, DW_AT_name("SOCPRICTRL")
    9579                      .dwattr $C$DW$1776, DW_AT_TI_symbol_name("_SOCPRICTRL")
    9580                      .dwattr $C$DW$1776, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    9581                      .dwattr $C$DW$1776, DW_AT_accessibility(DW_ACCESS_public)
    9582              $C$DW$1777      .dwtag  DW_TAG_member
    9583                      .dwattr $C$DW$1777, DW_AT_type(*$C$DW$T$22)
    9584                      .dwattr $C$DW$1777, DW_AT_name("rsvd_4")
    9585                      .dwattr $C$DW$1777, DW_AT_TI_symbol_name("_rsvd_4")
    9586                      .dwattr $C$DW$1777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    9587                      .dwattr $C$DW$1777, DW_AT_accessibility(DW_ACCESS_public)
    9588              $C$DW$1778      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  184

    9589                      .dwattr $C$DW$1778, DW_AT_type(*$C$DW$T$22)
    9590                      .dwattr $C$DW$1778, DW_AT_name("ADCSAMPLEMODE")
    9591                      .dwattr $C$DW$1778, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    9592                      .dwattr $C$DW$1778, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    9593                      .dwattr $C$DW$1778, DW_AT_accessibility(DW_ACCESS_public)
    9594              $C$DW$1779      .dwtag  DW_TAG_member
    9595                      .dwattr $C$DW$1779, DW_AT_type(*$C$DW$T$22)
    9596                      .dwattr $C$DW$1779, DW_AT_name("rsvd_5")
    9597                      .dwattr $C$DW$1779, DW_AT_TI_symbol_name("_rsvd_5")
    9598                      .dwattr $C$DW$1779, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    9599                      .dwattr $C$DW$1779, DW_AT_accessibility(DW_ACCESS_public)
    9600              $C$DW$1780      .dwtag  DW_TAG_member
    9601                      .dwattr $C$DW$1780, DW_AT_type(*$C$DW$T$22)
    9602                      .dwattr $C$DW$1780, DW_AT_name("ADCINTSOCSEL1")
    9603                      .dwattr $C$DW$1780, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    9604                      .dwattr $C$DW$1780, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    9605                      .dwattr $C$DW$1780, DW_AT_accessibility(DW_ACCESS_public)
    9606              $C$DW$1781      .dwtag  DW_TAG_member
    9607                      .dwattr $C$DW$1781, DW_AT_type(*$C$DW$T$22)
    9608                      .dwattr $C$DW$1781, DW_AT_name("ADCINTSOCSEL2")
    9609                      .dwattr $C$DW$1781, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    9610                      .dwattr $C$DW$1781, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    9611                      .dwattr $C$DW$1781, DW_AT_accessibility(DW_ACCESS_public)
    9612              $C$DW$1782      .dwtag  DW_TAG_member
    9613                      .dwattr $C$DW$1782, DW_AT_type(*$C$DW$T$25)
    9614                      .dwattr $C$DW$1782, DW_AT_name("rsvd_6")
    9615                      .dwattr $C$DW$1782, DW_AT_TI_symbol_name("_rsvd_6")
    9616                      .dwattr $C$DW$1782, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    9617                      .dwattr $C$DW$1782, DW_AT_accessibility(DW_ACCESS_public)
    9618              $C$DW$1783      .dwtag  DW_TAG_member
    9619                      .dwattr $C$DW$1783, DW_AT_type(*$C$DW$T$22)
    9620                      .dwattr $C$DW$1783, DW_AT_name("ADCSOCFLG1")
    9621                      .dwattr $C$DW$1783, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    9622                      .dwattr $C$DW$1783, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    9623                      .dwattr $C$DW$1783, DW_AT_accessibility(DW_ACCESS_public)
    9624              $C$DW$1784      .dwtag  DW_TAG_member
    9625                      .dwattr $C$DW$1784, DW_AT_type(*$C$DW$T$22)
    9626                      .dwattr $C$DW$1784, DW_AT_name("rsvd_7")
    9627                      .dwattr $C$DW$1784, DW_AT_TI_symbol_name("_rsvd_7")
    9628                      .dwattr $C$DW$1784, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    9629                      .dwattr $C$DW$1784, DW_AT_accessibility(DW_ACCESS_public)
    9630              $C$DW$1785      .dwtag  DW_TAG_member
    9631                      .dwattr $C$DW$1785, DW_AT_type(*$C$DW$T$22)
    9632                      .dwattr $C$DW$1785, DW_AT_name("ADCSOCFRC1")
    9633                      .dwattr $C$DW$1785, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    9634                      .dwattr $C$DW$1785, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    9635                      .dwattr $C$DW$1785, DW_AT_accessibility(DW_ACCESS_public)
    9636              $C$DW$1786      .dwtag  DW_TAG_member
    9637                      .dwattr $C$DW$1786, DW_AT_type(*$C$DW$T$22)
    9638                      .dwattr $C$DW$1786, DW_AT_name("rsvd_8")
    9639                      .dwattr $C$DW$1786, DW_AT_TI_symbol_name("_rsvd_8")
    9640                      .dwattr $C$DW$1786, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    9641                      .dwattr $C$DW$1786, DW_AT_accessibility(DW_ACCESS_public)
    9642              $C$DW$1787      .dwtag  DW_TAG_member
    9643                      .dwattr $C$DW$1787, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  185

    9644                      .dwattr $C$DW$1787, DW_AT_name("ADCSOCOVF1")
    9645                      .dwattr $C$DW$1787, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    9646                      .dwattr $C$DW$1787, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    9647                      .dwattr $C$DW$1787, DW_AT_accessibility(DW_ACCESS_public)
    9648              $C$DW$1788      .dwtag  DW_TAG_member
    9649                      .dwattr $C$DW$1788, DW_AT_type(*$C$DW$T$22)
    9650                      .dwattr $C$DW$1788, DW_AT_name("rsvd_9")
    9651                      .dwattr $C$DW$1788, DW_AT_TI_symbol_name("_rsvd_9")
    9652                      .dwattr $C$DW$1788, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    9653                      .dwattr $C$DW$1788, DW_AT_accessibility(DW_ACCESS_public)
    9654              $C$DW$1789      .dwtag  DW_TAG_member
    9655                      .dwattr $C$DW$1789, DW_AT_type(*$C$DW$T$22)
    9656                      .dwattr $C$DW$1789, DW_AT_name("ADCSOCOVFCLR1")
    9657                      .dwattr $C$DW$1789, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    9658                      .dwattr $C$DW$1789, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    9659                      .dwattr $C$DW$1789, DW_AT_accessibility(DW_ACCESS_public)
    9660              $C$DW$1790      .dwtag  DW_TAG_member
    9661                      .dwattr $C$DW$1790, DW_AT_type(*$C$DW$T$22)
    9662                      .dwattr $C$DW$1790, DW_AT_name("rsvd_10")
    9663                      .dwattr $C$DW$1790, DW_AT_TI_symbol_name("_rsvd_10")
    9664                      .dwattr $C$DW$1790, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    9665                      .dwattr $C$DW$1790, DW_AT_accessibility(DW_ACCESS_public)
    9666              $C$DW$1791      .dwtag  DW_TAG_member
    9667                      .dwattr $C$DW$1791, DW_AT_type(*$C$DW$T$23)
    9668                      .dwattr $C$DW$1791, DW_AT_name("ADCSOCxCTL")
    9669                      .dwattr $C$DW$1791, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    9670                      .dwattr $C$DW$1791, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    9671                      .dwattr $C$DW$1791, DW_AT_accessibility(DW_ACCESS_public)
    9672              $C$DW$1792      .dwtag  DW_TAG_member
    9673                      .dwattr $C$DW$1792, DW_AT_type(*$C$DW$T$23)
    9674                      .dwattr $C$DW$1792, DW_AT_name("rsvd_11")
    9675                      .dwattr $C$DW$1792, DW_AT_TI_symbol_name("_rsvd_11")
    9676                      .dwattr $C$DW$1792, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    9677                      .dwattr $C$DW$1792, DW_AT_accessibility(DW_ACCESS_public)
    9678              $C$DW$1793      .dwtag  DW_TAG_member
    9679                      .dwattr $C$DW$1793, DW_AT_type(*$C$DW$T$22)
    9680                      .dwattr $C$DW$1793, DW_AT_name("ADCREFTRIM")
    9681                      .dwattr $C$DW$1793, DW_AT_TI_symbol_name("_ADCREFTRIM")
    9682                      .dwattr $C$DW$1793, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    9683                      .dwattr $C$DW$1793, DW_AT_accessibility(DW_ACCESS_public)
    9684              $C$DW$1794      .dwtag  DW_TAG_member
    9685                      .dwattr $C$DW$1794, DW_AT_type(*$C$DW$T$22)
    9686                      .dwattr $C$DW$1794, DW_AT_name("ADCOFFTRIM")
    9687                      .dwattr $C$DW$1794, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    9688                      .dwattr $C$DW$1794, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    9689                      .dwattr $C$DW$1794, DW_AT_accessibility(DW_ACCESS_public)
    9690              $C$DW$1795      .dwtag  DW_TAG_member
    9691                      .dwattr $C$DW$1795, DW_AT_type(*$C$DW$T$28)
    9692                      .dwattr $C$DW$1795, DW_AT_name("resvd_12")
    9693                      .dwattr $C$DW$1795, DW_AT_TI_symbol_name("_resvd_12")
    9694                      .dwattr $C$DW$1795, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
    9695                      .dwattr $C$DW$1795, DW_AT_accessibility(DW_ACCESS_public)
    9696              $C$DW$1796      .dwtag  DW_TAG_member
    9697                      .dwattr $C$DW$1796, DW_AT_type(*$C$DW$T$22)
    9698                      .dwattr $C$DW$1796, DW_AT_name("ADCREV")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  186

    9699                      .dwattr $C$DW$1796, DW_AT_TI_symbol_name("_ADCREV")
    9700                      .dwattr $C$DW$1796, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    9701                      .dwattr $C$DW$1796, DW_AT_accessibility(DW_ACCESS_public)
    9702                      .dwendtag $C$DW$T$29
    9703              
    9704              $C$DW$T$367     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    9705                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$29)
    9706                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
    9707              $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    9708                      .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$29)
    9709                      .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    9710              $C$DW$T$120     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    9711                      .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    9712                      .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    9713              
    9714              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    9715                      .dwattr $C$DW$T$31, DW_AT_name("_CLK_Obj_")
    9716                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x11)
    9717              $C$DW$1797      .dwtag  DW_TAG_member
    9718                      .dwattr $C$DW$1797, DW_AT_type(*$C$DW$T$22)
    9719                      .dwattr $C$DW$1797, DW_AT_name("XCLK")
    9720                      .dwattr $C$DW$1797, DW_AT_TI_symbol_name("_XCLK")
    9721                      .dwattr $C$DW$1797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9722                      .dwattr $C$DW$1797, DW_AT_accessibility(DW_ACCESS_public)
    9723              $C$DW$1798      .dwtag  DW_TAG_member
    9724                      .dwattr $C$DW$1798, DW_AT_type(*$C$DW$T$22)
    9725                      .dwattr $C$DW$1798, DW_AT_name("rsvd_1")
    9726                      .dwattr $C$DW$1798, DW_AT_TI_symbol_name("_rsvd_1")
    9727                      .dwattr $C$DW$1798, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9728                      .dwattr $C$DW$1798, DW_AT_accessibility(DW_ACCESS_public)
    9729              $C$DW$1799      .dwtag  DW_TAG_member
    9730                      .dwattr $C$DW$1799, DW_AT_type(*$C$DW$T$22)
    9731                      .dwattr $C$DW$1799, DW_AT_name("CLKCTL")
    9732                      .dwattr $C$DW$1799, DW_AT_TI_symbol_name("_CLKCTL")
    9733                      .dwattr $C$DW$1799, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9734                      .dwattr $C$DW$1799, DW_AT_accessibility(DW_ACCESS_public)
    9735              $C$DW$1800      .dwtag  DW_TAG_member
    9736                      .dwattr $C$DW$1800, DW_AT_type(*$C$DW$T$30)
    9737                      .dwattr $C$DW$1800, DW_AT_name("rsvd_2")
    9738                      .dwattr $C$DW$1800, DW_AT_TI_symbol_name("_rsvd_2")
    9739                      .dwattr $C$DW$1800, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9740                      .dwattr $C$DW$1800, DW_AT_accessibility(DW_ACCESS_public)
    9741              $C$DW$1801      .dwtag  DW_TAG_member
    9742                      .dwattr $C$DW$1801, DW_AT_type(*$C$DW$T$22)
    9743                      .dwattr $C$DW$1801, DW_AT_name("LOSPCP")
    9744                      .dwattr $C$DW$1801, DW_AT_TI_symbol_name("_LOSPCP")
    9745                      .dwattr $C$DW$1801, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    9746                      .dwattr $C$DW$1801, DW_AT_accessibility(DW_ACCESS_public)
    9747              $C$DW$1802      .dwtag  DW_TAG_member
    9748                      .dwattr $C$DW$1802, DW_AT_type(*$C$DW$T$22)
    9749                      .dwattr $C$DW$1802, DW_AT_name("PCLKCR0")
    9750                      .dwattr $C$DW$1802, DW_AT_TI_symbol_name("_PCLKCR0")
    9751                      .dwattr $C$DW$1802, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9752                      .dwattr $C$DW$1802, DW_AT_accessibility(DW_ACCESS_public)
    9753              $C$DW$1803      .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  187

    9754                      .dwattr $C$DW$1803, DW_AT_type(*$C$DW$T$22)
    9755                      .dwattr $C$DW$1803, DW_AT_name("PCLKCR1")
    9756                      .dwattr $C$DW$1803, DW_AT_TI_symbol_name("_PCLKCR1")
    9757                      .dwattr $C$DW$1803, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    9758                      .dwattr $C$DW$1803, DW_AT_accessibility(DW_ACCESS_public)
    9759              $C$DW$1804      .dwtag  DW_TAG_member
    9760                      .dwattr $C$DW$1804, DW_AT_type(*$C$DW$T$25)
    9761                      .dwattr $C$DW$1804, DW_AT_name("rsvd_3")
    9762                      .dwattr $C$DW$1804, DW_AT_TI_symbol_name("_rsvd_3")
    9763                      .dwattr $C$DW$1804, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9764                      .dwattr $C$DW$1804, DW_AT_accessibility(DW_ACCESS_public)
    9765              $C$DW$1805      .dwtag  DW_TAG_member
    9766                      .dwattr $C$DW$1805, DW_AT_type(*$C$DW$T$22)
    9767                      .dwattr $C$DW$1805, DW_AT_name("PCLKCR3")
    9768                      .dwattr $C$DW$1805, DW_AT_TI_symbol_name("_PCLKCR3")
    9769                      .dwattr $C$DW$1805, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9770                      .dwattr $C$DW$1805, DW_AT_accessibility(DW_ACCESS_public)
    9771                      .dwendtag $C$DW$T$31
    9772              
    9773              $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    9774                      .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$31)
    9775                      .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    9776              $C$DW$T$122     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    9777                      .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$121)
    9778                      .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    9779              
    9780              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    9781                      .dwattr $C$DW$T$33, DW_AT_name("_CPU_Obj_")
    9782                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    9783              $C$DW$1806      .dwtag  DW_TAG_member
    9784                      .dwattr $C$DW$1806, DW_AT_type(*$C$DW$T$32)
    9785                      .dwattr $C$DW$1806, DW_AT_name("tmp")
    9786                      .dwattr $C$DW$1806, DW_AT_TI_symbol_name("_tmp")
    9787                      .dwattr $C$DW$1806, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9788                      .dwattr $C$DW$1806, DW_AT_accessibility(DW_ACCESS_public)
    9789                      .dwendtag $C$DW$T$33
    9790              
    9791              $C$DW$T$376     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Obj")
    9792                      .dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$33)
    9793                      .dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
    9794              $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    9795                      .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$33)
    9796                      .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    9797              $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    9798                      .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    9799                      .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    9800              
    9801              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    9802                      .dwattr $C$DW$T$41, DW_AT_name("_DRV8305_Obj_")
    9803                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x08)
    9804              $C$DW$1807      .dwtag  DW_TAG_member
    9805                      .dwattr $C$DW$1807, DW_AT_type(*$C$DW$T$35)
    9806                      .dwattr $C$DW$1807, DW_AT_name("spiHandle")
    9807                      .dwattr $C$DW$1807, DW_AT_TI_symbol_name("_spiHandle")
    9808                      .dwattr $C$DW$1807, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  188

    9809                      .dwattr $C$DW$1807, DW_AT_accessibility(DW_ACCESS_public)
    9810              $C$DW$1808      .dwtag  DW_TAG_member
    9811                      .dwattr $C$DW$1808, DW_AT_type(*$C$DW$T$37)
    9812                      .dwattr $C$DW$1808, DW_AT_name("gpioHandle")
    9813                      .dwattr $C$DW$1808, DW_AT_TI_symbol_name("_gpioHandle")
    9814                      .dwattr $C$DW$1808, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9815                      .dwattr $C$DW$1808, DW_AT_accessibility(DW_ACCESS_public)
    9816              $C$DW$1809      .dwtag  DW_TAG_member
    9817                      .dwattr $C$DW$1809, DW_AT_type(*$C$DW$T$39)
    9818                      .dwattr $C$DW$1809, DW_AT_name("gpioNumber")
    9819                      .dwattr $C$DW$1809, DW_AT_TI_symbol_name("_gpioNumber")
    9820                      .dwattr $C$DW$1809, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9821                      .dwattr $C$DW$1809, DW_AT_accessibility(DW_ACCESS_public)
    9822              $C$DW$1810      .dwtag  DW_TAG_member
    9823                      .dwattr $C$DW$1810, DW_AT_type(*$C$DW$T$40)
    9824                      .dwattr $C$DW$1810, DW_AT_name("RxTimeOut")
    9825                      .dwattr $C$DW$1810, DW_AT_TI_symbol_name("_RxTimeOut")
    9826                      .dwattr $C$DW$1810, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9827                      .dwattr $C$DW$1810, DW_AT_accessibility(DW_ACCESS_public)
    9828              $C$DW$1811      .dwtag  DW_TAG_member
    9829                      .dwattr $C$DW$1811, DW_AT_type(*$C$DW$T$40)
    9830                      .dwattr $C$DW$1811, DW_AT_name("enableTimeOut")
    9831                      .dwattr $C$DW$1811, DW_AT_TI_symbol_name("_enableTimeOut")
    9832                      .dwattr $C$DW$1811, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9833                      .dwattr $C$DW$1811, DW_AT_accessibility(DW_ACCESS_public)
    9834                      .dwendtag $C$DW$T$41
    9835              
    9836              $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Obj")
    9837                      .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$41)
    9838                      .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    9839              $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    9840                      .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$41)
    9841                      .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
    9842              $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Handle")
    9843                      .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$150)
    9844                      .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    9845              
    9846              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    9847                      .dwattr $C$DW$T$48, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    9848                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    9849              $C$DW$1812      .dwtag  DW_TAG_member
    9850                      .dwattr $C$DW$1812, DW_AT_type(*$C$DW$T$43)
    9851                      .dwattr $C$DW$1812, DW_AT_name("IDRIVEP_HS")
    9852                      .dwattr $C$DW$1812, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    9853                      .dwattr $C$DW$1812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9854                      .dwattr $C$DW$1812, DW_AT_accessibility(DW_ACCESS_public)
    9855              $C$DW$1813      .dwtag  DW_TAG_member
    9856                      .dwattr $C$DW$1813, DW_AT_type(*$C$DW$T$45)
    9857                      .dwattr $C$DW$1813, DW_AT_name("IDRIVEN_HS")
    9858                      .dwattr $C$DW$1813, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    9859                      .dwattr $C$DW$1813, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9860                      .dwattr $C$DW$1813, DW_AT_accessibility(DW_ACCESS_public)
    9861              $C$DW$1814      .dwtag  DW_TAG_member
    9862                      .dwattr $C$DW$1814, DW_AT_type(*$C$DW$T$47)
    9863                      .dwattr $C$DW$1814, DW_AT_name("TDRIVEN")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  189

    9864                      .dwattr $C$DW$1814, DW_AT_TI_symbol_name("_TDRIVEN")
    9865                      .dwattr $C$DW$1814, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9866                      .dwattr $C$DW$1814, DW_AT_accessibility(DW_ACCESS_public)
    9867              $C$DW$1815      .dwtag  DW_TAG_member
    9868                      .dwattr $C$DW$1815, DW_AT_type(*$C$DW$T$40)
    9869                      .dwattr $C$DW$1815, DW_AT_name("CTRL05_RSV1")
    9870                      .dwattr $C$DW$1815, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    9871                      .dwattr $C$DW$1815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9872                      .dwattr $C$DW$1815, DW_AT_accessibility(DW_ACCESS_public)
    9873                      .dwendtag $C$DW$T$48
    9874              
    9875              $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    9876                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$48)
    9877                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    9878              
    9879              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    9880                      .dwattr $C$DW$T$55, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    9881                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    9882              $C$DW$1816      .dwtag  DW_TAG_member
    9883                      .dwattr $C$DW$1816, DW_AT_type(*$C$DW$T$50)
    9884                      .dwattr $C$DW$1816, DW_AT_name("IDRIVEP_LS")
    9885                      .dwattr $C$DW$1816, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    9886                      .dwattr $C$DW$1816, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9887                      .dwattr $C$DW$1816, DW_AT_accessibility(DW_ACCESS_public)
    9888              $C$DW$1817      .dwtag  DW_TAG_member
    9889                      .dwattr $C$DW$1817, DW_AT_type(*$C$DW$T$52)
    9890                      .dwattr $C$DW$1817, DW_AT_name("IDRIVEN_LS")
    9891                      .dwattr $C$DW$1817, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    9892                      .dwattr $C$DW$1817, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9893                      .dwattr $C$DW$1817, DW_AT_accessibility(DW_ACCESS_public)
    9894              $C$DW$1818      .dwtag  DW_TAG_member
    9895                      .dwattr $C$DW$1818, DW_AT_type(*$C$DW$T$54)
    9896                      .dwattr $C$DW$1818, DW_AT_name("TDRIVEP")
    9897                      .dwattr $C$DW$1818, DW_AT_TI_symbol_name("_TDRIVEP")
    9898                      .dwattr $C$DW$1818, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9899                      .dwattr $C$DW$1818, DW_AT_accessibility(DW_ACCESS_public)
    9900              $C$DW$1819      .dwtag  DW_TAG_member
    9901                      .dwattr $C$DW$1819, DW_AT_type(*$C$DW$T$40)
    9902                      .dwattr $C$DW$1819, DW_AT_name("CTRL06_RSV1")
    9903                      .dwattr $C$DW$1819, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    9904                      .dwattr $C$DW$1819, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9905                      .dwattr $C$DW$1819, DW_AT_accessibility(DW_ACCESS_public)
    9906                      .dwendtag $C$DW$T$55
    9907              
    9908              $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    9909                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$55)
    9910                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    9911              
    9912              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    9913                      .dwattr $C$DW$T$66, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    9914                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
    9915              $C$DW$1820      .dwtag  DW_TAG_member
    9916                      .dwattr $C$DW$1820, DW_AT_type(*$C$DW$T$57)
    9917                      .dwattr $C$DW$1820, DW_AT_name("TVDS")
    9918                      .dwattr $C$DW$1820, DW_AT_TI_symbol_name("_TVDS")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  190

    9919                      .dwattr $C$DW$1820, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9920                      .dwattr $C$DW$1820, DW_AT_accessibility(DW_ACCESS_public)
    9921              $C$DW$1821      .dwtag  DW_TAG_member
    9922                      .dwattr $C$DW$1821, DW_AT_type(*$C$DW$T$59)
    9923                      .dwattr $C$DW$1821, DW_AT_name("TBLANK")
    9924                      .dwattr $C$DW$1821, DW_AT_TI_symbol_name("_TBLANK")
    9925                      .dwattr $C$DW$1821, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9926                      .dwattr $C$DW$1821, DW_AT_accessibility(DW_ACCESS_public)
    9927              $C$DW$1822      .dwtag  DW_TAG_member
    9928                      .dwattr $C$DW$1822, DW_AT_type(*$C$DW$T$61)
    9929                      .dwattr $C$DW$1822, DW_AT_name("DEAD_TIME")
    9930                      .dwattr $C$DW$1822, DW_AT_TI_symbol_name("_DEAD_TIME")
    9931                      .dwattr $C$DW$1822, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9932                      .dwattr $C$DW$1822, DW_AT_accessibility(DW_ACCESS_public)
    9933              $C$DW$1823      .dwtag  DW_TAG_member
    9934                      .dwattr $C$DW$1823, DW_AT_type(*$C$DW$T$63)
    9935                      .dwattr $C$DW$1823, DW_AT_name("PWM_MODE")
    9936                      .dwattr $C$DW$1823, DW_AT_TI_symbol_name("_PWM_MODE")
    9937                      .dwattr $C$DW$1823, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9938                      .dwattr $C$DW$1823, DW_AT_accessibility(DW_ACCESS_public)
    9939              $C$DW$1824      .dwtag  DW_TAG_member
    9940                      .dwattr $C$DW$1824, DW_AT_type(*$C$DW$T$65)
    9941                      .dwattr $C$DW$1824, DW_AT_name("COMM_OPT")
    9942                      .dwattr $C$DW$1824, DW_AT_TI_symbol_name("_COMM_OPT")
    9943                      .dwattr $C$DW$1824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9944                      .dwattr $C$DW$1824, DW_AT_accessibility(DW_ACCESS_public)
    9945              $C$DW$1825      .dwtag  DW_TAG_member
    9946                      .dwattr $C$DW$1825, DW_AT_type(*$C$DW$T$40)
    9947                      .dwattr $C$DW$1825, DW_AT_name("CTRL07_RSV1")
    9948                      .dwattr $C$DW$1825, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    9949                      .dwattr $C$DW$1825, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9950                      .dwattr $C$DW$1825, DW_AT_accessibility(DW_ACCESS_public)
    9951                      .dwendtag $C$DW$T$66
    9952              
    9953              $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    9954                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$66)
    9955                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    9956              
    9957              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    9958                      .dwattr $C$DW$T$67, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    9959                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    9960              $C$DW$1826      .dwtag  DW_TAG_member
    9961                      .dwattr $C$DW$1826, DW_AT_type(*$C$DW$T$21)
    9962                      .dwattr $C$DW$1826, DW_AT_name("CTRL08_RSV1")
    9963                      .dwattr $C$DW$1826, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    9964                      .dwattr $C$DW$1826, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9965                      .dwattr $C$DW$1826, DW_AT_accessibility(DW_ACCESS_public)
    9966                      .dwendtag $C$DW$T$67
    9967              
    9968              $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    9969                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$67)
    9970                      .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    9971              
    9972              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    9973                      .dwattr $C$DW$T$70, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  191

    9974                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    9975              $C$DW$1827      .dwtag  DW_TAG_member
    9976                      .dwattr $C$DW$1827, DW_AT_type(*$C$DW$T$40)
    9977                      .dwattr $C$DW$1827, DW_AT_name("SET_VCPH_UV")
    9978                      .dwattr $C$DW$1827, DW_AT_TI_symbol_name("_SET_VCPH_UV")
    9979                      .dwattr $C$DW$1827, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9980                      .dwattr $C$DW$1827, DW_AT_accessibility(DW_ACCESS_public)
    9981              $C$DW$1828      .dwtag  DW_TAG_member
    9982                      .dwattr $C$DW$1828, DW_AT_type(*$C$DW$T$40)
    9983                      .dwattr $C$DW$1828, DW_AT_name("CLR_FLTS")
    9984                      .dwattr $C$DW$1828, DW_AT_TI_symbol_name("_CLR_FLTS")
    9985                      .dwattr $C$DW$1828, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9986                      .dwattr $C$DW$1828, DW_AT_accessibility(DW_ACCESS_public)
    9987              $C$DW$1829      .dwtag  DW_TAG_member
    9988                      .dwattr $C$DW$1829, DW_AT_type(*$C$DW$T$40)
    9989                      .dwattr $C$DW$1829, DW_AT_name("SLEEP")
    9990                      .dwattr $C$DW$1829, DW_AT_TI_symbol_name("_SLEEP")
    9991                      .dwattr $C$DW$1829, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9992                      .dwattr $C$DW$1829, DW_AT_accessibility(DW_ACCESS_public)
    9993              $C$DW$1830      .dwtag  DW_TAG_member
    9994                      .dwattr $C$DW$1830, DW_AT_type(*$C$DW$T$40)
    9995                      .dwattr $C$DW$1830, DW_AT_name("WD_EN")
    9996                      .dwattr $C$DW$1830, DW_AT_TI_symbol_name("_WD_EN")
    9997                      .dwattr $C$DW$1830, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9998                      .dwattr $C$DW$1830, DW_AT_accessibility(DW_ACCESS_public)
    9999              $C$DW$1831      .dwtag  DW_TAG_member
   10000                      .dwattr $C$DW$1831, DW_AT_type(*$C$DW$T$40)
   10001                      .dwattr $C$DW$1831, DW_AT_name("DIS_SNS_OCP")
   10002                      .dwattr $C$DW$1831, DW_AT_TI_symbol_name("_DIS_SNS_OCP")
   10003                      .dwattr $C$DW$1831, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10004                      .dwattr $C$DW$1831, DW_AT_accessibility(DW_ACCESS_public)
   10005              $C$DW$1832      .dwtag  DW_TAG_member
   10006                      .dwattr $C$DW$1832, DW_AT_type(*$C$DW$T$69)
   10007                      .dwattr $C$DW$1832, DW_AT_name("WD_DLY")
   10008                      .dwattr $C$DW$1832, DW_AT_TI_symbol_name("_WD_DLY")
   10009                      .dwattr $C$DW$1832, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10010                      .dwattr $C$DW$1832, DW_AT_accessibility(DW_ACCESS_public)
   10011              $C$DW$1833      .dwtag  DW_TAG_member
   10012                      .dwattr $C$DW$1833, DW_AT_type(*$C$DW$T$40)
   10013                      .dwattr $C$DW$1833, DW_AT_name("EN_SNS_CLAMP")
   10014                      .dwattr $C$DW$1833, DW_AT_TI_symbol_name("_EN_SNS_CLAMP")
   10015                      .dwattr $C$DW$1833, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10016                      .dwattr $C$DW$1833, DW_AT_accessibility(DW_ACCESS_public)
   10017              $C$DW$1834      .dwtag  DW_TAG_member
   10018                      .dwattr $C$DW$1834, DW_AT_type(*$C$DW$T$40)
   10019                      .dwattr $C$DW$1834, DW_AT_name("DIS_GDRV_FAULT")
   10020                      .dwattr $C$DW$1834, DW_AT_TI_symbol_name("_DIS_GDRV_FAULT")
   10021                      .dwattr $C$DW$1834, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10022                      .dwattr $C$DW$1834, DW_AT_accessibility(DW_ACCESS_public)
   10023              $C$DW$1835      .dwtag  DW_TAG_member
   10024                      .dwattr $C$DW$1835, DW_AT_type(*$C$DW$T$40)
   10025                      .dwattr $C$DW$1835, DW_AT_name("DISABLE")
   10026                      .dwattr $C$DW$1835, DW_AT_TI_symbol_name("_DISABLE")
   10027                      .dwattr $C$DW$1835, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10028                      .dwattr $C$DW$1835, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  192

   10029              $C$DW$1836      .dwtag  DW_TAG_member
   10030                      .dwattr $C$DW$1836, DW_AT_type(*$C$DW$T$40)
   10031                      .dwattr $C$DW$1836, DW_AT_name("FLIP_OTS")
   10032                      .dwattr $C$DW$1836, DW_AT_TI_symbol_name("_FLIP_OTS")
   10033                      .dwattr $C$DW$1836, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10034                      .dwattr $C$DW$1836, DW_AT_accessibility(DW_ACCESS_public)
   10035                      .dwendtag $C$DW$T$70
   10036              
   10037              $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl09_t_")
   10038                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$70)
   10039                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
   10040              
   10041              $C$DW$T$79      .dwtag  DW_TAG_structure_type
   10042                      .dwattr $C$DW$T$79, DW_AT_name("_DRV_SPI_8305_Ctrl0A_t_")
   10043                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x07)
   10044              $C$DW$1837      .dwtag  DW_TAG_member
   10045                      .dwattr $C$DW$1837, DW_AT_type(*$C$DW$T$72)
   10046                      .dwattr $C$DW$1837, DW_AT_name("GAIN_CS1")
   10047                      .dwattr $C$DW$1837, DW_AT_TI_symbol_name("_GAIN_CS1")
   10048                      .dwattr $C$DW$1837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10049                      .dwattr $C$DW$1837, DW_AT_accessibility(DW_ACCESS_public)
   10050              $C$DW$1838      .dwtag  DW_TAG_member
   10051                      .dwattr $C$DW$1838, DW_AT_type(*$C$DW$T$74)
   10052                      .dwattr $C$DW$1838, DW_AT_name("GAIN_CS2")
   10053                      .dwattr $C$DW$1838, DW_AT_TI_symbol_name("_GAIN_CS2")
   10054                      .dwattr $C$DW$1838, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10055                      .dwattr $C$DW$1838, DW_AT_accessibility(DW_ACCESS_public)
   10056              $C$DW$1839      .dwtag  DW_TAG_member
   10057                      .dwattr $C$DW$1839, DW_AT_type(*$C$DW$T$76)
   10058                      .dwattr $C$DW$1839, DW_AT_name("GAIN_CS3")
   10059                      .dwattr $C$DW$1839, DW_AT_TI_symbol_name("_GAIN_CS3")
   10060                      .dwattr $C$DW$1839, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10061                      .dwattr $C$DW$1839, DW_AT_accessibility(DW_ACCESS_public)
   10062              $C$DW$1840      .dwtag  DW_TAG_member
   10063                      .dwattr $C$DW$1840, DW_AT_type(*$C$DW$T$78)
   10064                      .dwattr $C$DW$1840, DW_AT_name("CS_BLANK")
   10065                      .dwattr $C$DW$1840, DW_AT_TI_symbol_name("_CS_BLANK")
   10066                      .dwattr $C$DW$1840, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10067                      .dwattr $C$DW$1840, DW_AT_accessibility(DW_ACCESS_public)
   10068              $C$DW$1841      .dwtag  DW_TAG_member
   10069                      .dwattr $C$DW$1841, DW_AT_type(*$C$DW$T$40)
   10070                      .dwattr $C$DW$1841, DW_AT_name("DC_CAL_CH1")
   10071                      .dwattr $C$DW$1841, DW_AT_TI_symbol_name("_DC_CAL_CH1")
   10072                      .dwattr $C$DW$1841, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10073                      .dwattr $C$DW$1841, DW_AT_accessibility(DW_ACCESS_public)
   10074              $C$DW$1842      .dwtag  DW_TAG_member
   10075                      .dwattr $C$DW$1842, DW_AT_type(*$C$DW$T$40)
   10076                      .dwattr $C$DW$1842, DW_AT_name("DC_CAL_CH2")
   10077                      .dwattr $C$DW$1842, DW_AT_TI_symbol_name("_DC_CAL_CH2")
   10078                      .dwattr $C$DW$1842, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10079                      .dwattr $C$DW$1842, DW_AT_accessibility(DW_ACCESS_public)
   10080              $C$DW$1843      .dwtag  DW_TAG_member
   10081                      .dwattr $C$DW$1843, DW_AT_type(*$C$DW$T$40)
   10082                      .dwattr $C$DW$1843, DW_AT_name("DC_CAL_CH3")
   10083                      .dwattr $C$DW$1843, DW_AT_TI_symbol_name("_DC_CAL_CH3")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  193

   10084                      .dwattr $C$DW$1843, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10085                      .dwattr $C$DW$1843, DW_AT_accessibility(DW_ACCESS_public)
   10086                      .dwendtag $C$DW$T$79
   10087              
   10088              $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0A_t_")
   10089                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$79)
   10090                      .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
   10091              
   10092              $C$DW$T$86      .dwtag  DW_TAG_structure_type
   10093                      .dwattr $C$DW$T$86, DW_AT_name("_DRV_SPI_8305_Ctrl0B_t_")
   10094                      .dwattr $C$DW$T$86, DW_AT_byte_size(0x08)
   10095              $C$DW$1844      .dwtag  DW_TAG_member
   10096                      .dwattr $C$DW$1844, DW_AT_type(*$C$DW$T$81)
   10097                      .dwattr $C$DW$1844, DW_AT_name("VREG_UV_LEVEL")
   10098                      .dwattr $C$DW$1844, DW_AT_TI_symbol_name("_VREG_UV_LEVEL")
   10099                      .dwattr $C$DW$1844, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10100                      .dwattr $C$DW$1844, DW_AT_accessibility(DW_ACCESS_public)
   10101              $C$DW$1845      .dwtag  DW_TAG_member
   10102                      .dwattr $C$DW$1845, DW_AT_type(*$C$DW$T$40)
   10103                      .dwattr $C$DW$1845, DW_AT_name("DIS_PWRGD")
   10104                      .dwattr $C$DW$1845, DW_AT_TI_symbol_name("_DIS_PWRGD")
   10105                      .dwattr $C$DW$1845, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10106                      .dwattr $C$DW$1845, DW_AT_accessibility(DW_ACCESS_public)
   10107              $C$DW$1846      .dwtag  DW_TAG_member
   10108                      .dwattr $C$DW$1846, DW_AT_type(*$C$DW$T$83)
   10109                      .dwattr $C$DW$1846, DW_AT_name("SLP_DLY")
   10110                      .dwattr $C$DW$1846, DW_AT_TI_symbol_name("_SLP_DLY")
   10111                      .dwattr $C$DW$1846, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10112                      .dwattr $C$DW$1846, DW_AT_accessibility(DW_ACCESS_public)
   10113              $C$DW$1847      .dwtag  DW_TAG_member
   10114                      .dwattr $C$DW$1847, DW_AT_type(*$C$DW$T$40)
   10115                      .dwattr $C$DW$1847, DW_AT_name("CTRL0B_RSV1")
   10116                      .dwattr $C$DW$1847, DW_AT_TI_symbol_name("_CTRL0B_RSV1")
   10117                      .dwattr $C$DW$1847, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10118                      .dwattr $C$DW$1847, DW_AT_accessibility(DW_ACCESS_public)
   10119              $C$DW$1848      .dwtag  DW_TAG_member
   10120                      .dwattr $C$DW$1848, DW_AT_type(*$C$DW$T$40)
   10121                      .dwattr $C$DW$1848, DW_AT_name("CTRL0B_RSV2")
   10122                      .dwattr $C$DW$1848, DW_AT_TI_symbol_name("_CTRL0B_RSV2")
   10123                      .dwattr $C$DW$1848, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10124                      .dwattr $C$DW$1848, DW_AT_accessibility(DW_ACCESS_public)
   10125              $C$DW$1849      .dwtag  DW_TAG_member
   10126                      .dwattr $C$DW$1849, DW_AT_type(*$C$DW$T$40)
   10127                      .dwattr $C$DW$1849, DW_AT_name("CTRL0B_RSV3")
   10128                      .dwattr $C$DW$1849, DW_AT_TI_symbol_name("_CTRL0B_RSV3")
   10129                      .dwattr $C$DW$1849, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10130                      .dwattr $C$DW$1849, DW_AT_accessibility(DW_ACCESS_public)
   10131              $C$DW$1850      .dwtag  DW_TAG_member
   10132                      .dwattr $C$DW$1850, DW_AT_type(*$C$DW$T$85)
   10133                      .dwattr $C$DW$1850, DW_AT_name("VREF_SCALING")
   10134                      .dwattr $C$DW$1850, DW_AT_TI_symbol_name("_VREF_SCALING")
   10135                      .dwattr $C$DW$1850, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10136                      .dwattr $C$DW$1850, DW_AT_accessibility(DW_ACCESS_public)
   10137              $C$DW$1851      .dwtag  DW_TAG_member
   10138                      .dwattr $C$DW$1851, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  194

   10139                      .dwattr $C$DW$1851, DW_AT_name("CTRL0B_RSV4")
   10140                      .dwattr $C$DW$1851, DW_AT_TI_symbol_name("_CTRL0B_RSV4")
   10141                      .dwattr $C$DW$1851, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10142                      .dwattr $C$DW$1851, DW_AT_accessibility(DW_ACCESS_public)
   10143                      .dwendtag $C$DW$T$86
   10144              
   10145              $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0B_t_")
   10146                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$86)
   10147                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
   10148              
   10149              $C$DW$T$91      .dwtag  DW_TAG_structure_type
   10150                      .dwattr $C$DW$T$91, DW_AT_name("_DRV_SPI_8305_Ctrl0C_t_")
   10151                      .dwattr $C$DW$T$91, DW_AT_byte_size(0x05)
   10152              $C$DW$1852      .dwtag  DW_TAG_member
   10153                      .dwattr $C$DW$1852, DW_AT_type(*$C$DW$T$88)
   10154                      .dwattr $C$DW$1852, DW_AT_name("VDS_MODE")
   10155                      .dwattr $C$DW$1852, DW_AT_TI_symbol_name("_VDS_MODE")
   10156                      .dwattr $C$DW$1852, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10157                      .dwattr $C$DW$1852, DW_AT_accessibility(DW_ACCESS_public)
   10158              $C$DW$1853      .dwtag  DW_TAG_member
   10159                      .dwattr $C$DW$1853, DW_AT_type(*$C$DW$T$90)
   10160                      .dwattr $C$DW$1853, DW_AT_name("VDS_LEVEL")
   10161                      .dwattr $C$DW$1853, DW_AT_TI_symbol_name("_VDS_LEVEL")
   10162                      .dwattr $C$DW$1853, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10163                      .dwattr $C$DW$1853, DW_AT_accessibility(DW_ACCESS_public)
   10164              $C$DW$1854      .dwtag  DW_TAG_member
   10165                      .dwattr $C$DW$1854, DW_AT_type(*$C$DW$T$40)
   10166                      .dwattr $C$DW$1854, DW_AT_name("CTRL0C_RSV1")
   10167                      .dwattr $C$DW$1854, DW_AT_TI_symbol_name("_CTRL0C_RSV1")
   10168                      .dwattr $C$DW$1854, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10169                      .dwattr $C$DW$1854, DW_AT_accessibility(DW_ACCESS_public)
   10170              $C$DW$1855      .dwtag  DW_TAG_member
   10171                      .dwattr $C$DW$1855, DW_AT_type(*$C$DW$T$40)
   10172                      .dwattr $C$DW$1855, DW_AT_name("CTRL0C_RSV2")
   10173                      .dwattr $C$DW$1855, DW_AT_TI_symbol_name("_CTRL0C_RSV2")
   10174                      .dwattr $C$DW$1855, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10175                      .dwattr $C$DW$1855, DW_AT_accessibility(DW_ACCESS_public)
   10176              $C$DW$1856      .dwtag  DW_TAG_member
   10177                      .dwattr $C$DW$1856, DW_AT_type(*$C$DW$T$40)
   10178                      .dwattr $C$DW$1856, DW_AT_name("CTRL0C_RSV3")
   10179                      .dwattr $C$DW$1856, DW_AT_TI_symbol_name("_CTRL0C_RSV3")
   10180                      .dwattr $C$DW$1856, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10181                      .dwattr $C$DW$1856, DW_AT_accessibility(DW_ACCESS_public)
   10182                      .dwendtag $C$DW$T$91
   10183              
   10184              $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl0C_t_")
   10185                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$91)
   10186                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
   10187              
   10188              $C$DW$T$92      .dwtag  DW_TAG_structure_type
   10189                      .dwattr $C$DW$T$92, DW_AT_name("_DRV_SPI_8305_Stat01_t_")
   10190                      .dwattr $C$DW$T$92, DW_AT_byte_size(0x0b)
   10191              $C$DW$1857      .dwtag  DW_TAG_member
   10192                      .dwattr $C$DW$1857, DW_AT_type(*$C$DW$T$40)
   10193                      .dwattr $C$DW$1857, DW_AT_name("OTW")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  195

   10194                      .dwattr $C$DW$1857, DW_AT_TI_symbol_name("_OTW")
   10195                      .dwattr $C$DW$1857, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10196                      .dwattr $C$DW$1857, DW_AT_accessibility(DW_ACCESS_public)
   10197              $C$DW$1858      .dwtag  DW_TAG_member
   10198                      .dwattr $C$DW$1858, DW_AT_type(*$C$DW$T$40)
   10199                      .dwattr $C$DW$1858, DW_AT_name("TEMP_FLAG3")
   10200                      .dwattr $C$DW$1858, DW_AT_TI_symbol_name("_TEMP_FLAG3")
   10201                      .dwattr $C$DW$1858, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10202                      .dwattr $C$DW$1858, DW_AT_accessibility(DW_ACCESS_public)
   10203              $C$DW$1859      .dwtag  DW_TAG_member
   10204                      .dwattr $C$DW$1859, DW_AT_type(*$C$DW$T$40)
   10205                      .dwattr $C$DW$1859, DW_AT_name("TEMP_FLAG2")
   10206                      .dwattr $C$DW$1859, DW_AT_TI_symbol_name("_TEMP_FLAG2")
   10207                      .dwattr $C$DW$1859, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10208                      .dwattr $C$DW$1859, DW_AT_accessibility(DW_ACCESS_public)
   10209              $C$DW$1860      .dwtag  DW_TAG_member
   10210                      .dwattr $C$DW$1860, DW_AT_type(*$C$DW$T$40)
   10211                      .dwattr $C$DW$1860, DW_AT_name("TEMP_FLAG1")
   10212                      .dwattr $C$DW$1860, DW_AT_TI_symbol_name("_TEMP_FLAG1")
   10213                      .dwattr $C$DW$1860, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10214                      .dwattr $C$DW$1860, DW_AT_accessibility(DW_ACCESS_public)
   10215              $C$DW$1861      .dwtag  DW_TAG_member
   10216                      .dwattr $C$DW$1861, DW_AT_type(*$C$DW$T$40)
   10217                      .dwattr $C$DW$1861, DW_AT_name("VCPH_UVFL")
   10218                      .dwattr $C$DW$1861, DW_AT_TI_symbol_name("_VCPH_UVFL")
   10219                      .dwattr $C$DW$1861, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10220                      .dwattr $C$DW$1861, DW_AT_accessibility(DW_ACCESS_public)
   10221              $C$DW$1862      .dwtag  DW_TAG_member
   10222                      .dwattr $C$DW$1862, DW_AT_type(*$C$DW$T$40)
   10223                      .dwattr $C$DW$1862, DW_AT_name("VDS_STATUS")
   10224                      .dwattr $C$DW$1862, DW_AT_TI_symbol_name("_VDS_STATUS")
   10225                      .dwattr $C$DW$1862, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10226                      .dwattr $C$DW$1862, DW_AT_accessibility(DW_ACCESS_public)
   10227              $C$DW$1863      .dwtag  DW_TAG_member
   10228                      .dwattr $C$DW$1863, DW_AT_type(*$C$DW$T$40)
   10229                      .dwattr $C$DW$1863, DW_AT_name("PVDD_OVFL")
   10230                      .dwattr $C$DW$1863, DW_AT_TI_symbol_name("_PVDD_OVFL")
   10231                      .dwattr $C$DW$1863, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10232                      .dwattr $C$DW$1863, DW_AT_accessibility(DW_ACCESS_public)
   10233              $C$DW$1864      .dwtag  DW_TAG_member
   10234                      .dwattr $C$DW$1864, DW_AT_type(*$C$DW$T$40)
   10235                      .dwattr $C$DW$1864, DW_AT_name("PVDD_UVFL")
   10236                      .dwattr $C$DW$1864, DW_AT_TI_symbol_name("_PVDD_UVFL")
   10237                      .dwattr $C$DW$1864, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10238                      .dwattr $C$DW$1864, DW_AT_accessibility(DW_ACCESS_public)
   10239              $C$DW$1865      .dwtag  DW_TAG_member
   10240                      .dwattr $C$DW$1865, DW_AT_type(*$C$DW$T$40)
   10241                      .dwattr $C$DW$1865, DW_AT_name("TEMP_FLAG4")
   10242                      .dwattr $C$DW$1865, DW_AT_TI_symbol_name("_TEMP_FLAG4")
   10243                      .dwattr $C$DW$1865, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10244                      .dwattr $C$DW$1865, DW_AT_accessibility(DW_ACCESS_public)
   10245              $C$DW$1866      .dwtag  DW_TAG_member
   10246                      .dwattr $C$DW$1866, DW_AT_type(*$C$DW$T$40)
   10247                      .dwattr $C$DW$1866, DW_AT_name("STAT01_RSV1")
   10248                      .dwattr $C$DW$1866, DW_AT_TI_symbol_name("_STAT01_RSV1")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  196

   10249                      .dwattr $C$DW$1866, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10250                      .dwattr $C$DW$1866, DW_AT_accessibility(DW_ACCESS_public)
   10251              $C$DW$1867      .dwtag  DW_TAG_member
   10252                      .dwattr $C$DW$1867, DW_AT_type(*$C$DW$T$40)
   10253                      .dwattr $C$DW$1867, DW_AT_name("FAULT")
   10254                      .dwattr $C$DW$1867, DW_AT_TI_symbol_name("_FAULT")
   10255                      .dwattr $C$DW$1867, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10256                      .dwattr $C$DW$1867, DW_AT_accessibility(DW_ACCESS_public)
   10257                      .dwendtag $C$DW$T$92
   10258              
   10259              $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat01_t_")
   10260                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$92)
   10261                      .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   10262              
   10263              $C$DW$T$93      .dwtag  DW_TAG_structure_type
   10264                      .dwattr $C$DW$T$93, DW_AT_name("_DRV_SPI_8305_Stat02_t_")
   10265                      .dwattr $C$DW$T$93, DW_AT_byte_size(0x0b)
   10266              $C$DW$1868      .dwtag  DW_TAG_member
   10267                      .dwattr $C$DW$1868, DW_AT_type(*$C$DW$T$40)
   10268                      .dwattr $C$DW$1868, DW_AT_name("SNS_A_OCP")
   10269                      .dwattr $C$DW$1868, DW_AT_TI_symbol_name("_SNS_A_OCP")
   10270                      .dwattr $C$DW$1868, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10271                      .dwattr $C$DW$1868, DW_AT_accessibility(DW_ACCESS_public)
   10272              $C$DW$1869      .dwtag  DW_TAG_member
   10273                      .dwattr $C$DW$1869, DW_AT_type(*$C$DW$T$40)
   10274                      .dwattr $C$DW$1869, DW_AT_name("SNS_B_OCP")
   10275                      .dwattr $C$DW$1869, DW_AT_TI_symbol_name("_SNS_B_OCP")
   10276                      .dwattr $C$DW$1869, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10277                      .dwattr $C$DW$1869, DW_AT_accessibility(DW_ACCESS_public)
   10278              $C$DW$1870      .dwtag  DW_TAG_member
   10279                      .dwattr $C$DW$1870, DW_AT_type(*$C$DW$T$40)
   10280                      .dwattr $C$DW$1870, DW_AT_name("SNS_C_OCP")
   10281                      .dwattr $C$DW$1870, DW_AT_TI_symbol_name("_SNS_C_OCP")
   10282                      .dwattr $C$DW$1870, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10283                      .dwattr $C$DW$1870, DW_AT_accessibility(DW_ACCESS_public)
   10284              $C$DW$1871      .dwtag  DW_TAG_member
   10285                      .dwattr $C$DW$1871, DW_AT_type(*$C$DW$T$40)
   10286                      .dwattr $C$DW$1871, DW_AT_name("STAT02_RSV2")
   10287                      .dwattr $C$DW$1871, DW_AT_TI_symbol_name("_STAT02_RSV2")
   10288                      .dwattr $C$DW$1871, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10289                      .dwattr $C$DW$1871, DW_AT_accessibility(DW_ACCESS_public)
   10290              $C$DW$1872      .dwtag  DW_TAG_member
   10291                      .dwattr $C$DW$1872, DW_AT_type(*$C$DW$T$40)
   10292                      .dwattr $C$DW$1872, DW_AT_name("STAT02_RSV1")
   10293                      .dwattr $C$DW$1872, DW_AT_TI_symbol_name("_STAT02_RSV1")
   10294                      .dwattr $C$DW$1872, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10295                      .dwattr $C$DW$1872, DW_AT_accessibility(DW_ACCESS_public)
   10296              $C$DW$1873      .dwtag  DW_TAG_member
   10297                      .dwattr $C$DW$1873, DW_AT_type(*$C$DW$T$40)
   10298                      .dwattr $C$DW$1873, DW_AT_name("FETLC_VDS")
   10299                      .dwattr $C$DW$1873, DW_AT_TI_symbol_name("_FETLC_VDS")
   10300                      .dwattr $C$DW$1873, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10301                      .dwattr $C$DW$1873, DW_AT_accessibility(DW_ACCESS_public)
   10302              $C$DW$1874      .dwtag  DW_TAG_member
   10303                      .dwattr $C$DW$1874, DW_AT_type(*$C$DW$T$40)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  197

   10304                      .dwattr $C$DW$1874, DW_AT_name("FETHC_VDS")
   10305                      .dwattr $C$DW$1874, DW_AT_TI_symbol_name("_FETHC_VDS")
   10306                      .dwattr $C$DW$1874, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10307                      .dwattr $C$DW$1874, DW_AT_accessibility(DW_ACCESS_public)
   10308              $C$DW$1875      .dwtag  DW_TAG_member
   10309                      .dwattr $C$DW$1875, DW_AT_type(*$C$DW$T$40)
   10310                      .dwattr $C$DW$1875, DW_AT_name("FETLB_VDS")
   10311                      .dwattr $C$DW$1875, DW_AT_TI_symbol_name("_FETLB_VDS")
   10312                      .dwattr $C$DW$1875, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10313                      .dwattr $C$DW$1875, DW_AT_accessibility(DW_ACCESS_public)
   10314              $C$DW$1876      .dwtag  DW_TAG_member
   10315                      .dwattr $C$DW$1876, DW_AT_type(*$C$DW$T$40)
   10316                      .dwattr $C$DW$1876, DW_AT_name("FETHB_VDS")
   10317                      .dwattr $C$DW$1876, DW_AT_TI_symbol_name("_FETHB_VDS")
   10318                      .dwattr $C$DW$1876, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10319                      .dwattr $C$DW$1876, DW_AT_accessibility(DW_ACCESS_public)
   10320              $C$DW$1877      .dwtag  DW_TAG_member
   10321                      .dwattr $C$DW$1877, DW_AT_type(*$C$DW$T$40)
   10322                      .dwattr $C$DW$1877, DW_AT_name("FETLA_VDS")
   10323                      .dwattr $C$DW$1877, DW_AT_TI_symbol_name("_FETLA_VDS")
   10324                      .dwattr $C$DW$1877, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10325                      .dwattr $C$DW$1877, DW_AT_accessibility(DW_ACCESS_public)
   10326              $C$DW$1878      .dwtag  DW_TAG_member
   10327                      .dwattr $C$DW$1878, DW_AT_type(*$C$DW$T$40)
   10328                      .dwattr $C$DW$1878, DW_AT_name("FETHA_VDS")
   10329                      .dwattr $C$DW$1878, DW_AT_TI_symbol_name("_FETHA_VDS")
   10330                      .dwattr $C$DW$1878, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10331                      .dwattr $C$DW$1878, DW_AT_accessibility(DW_ACCESS_public)
   10332                      .dwendtag $C$DW$T$93
   10333              
   10334              $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat02_t_")
   10335                      .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$93)
   10336                      .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   10337              
   10338              $C$DW$T$94      .dwtag  DW_TAG_structure_type
   10339                      .dwattr $C$DW$T$94, DW_AT_name("_DRV_SPI_8305_Stat03_t_")
   10340                      .dwattr $C$DW$T$94, DW_AT_byte_size(0x0b)
   10341              $C$DW$1879      .dwtag  DW_TAG_member
   10342                      .dwattr $C$DW$1879, DW_AT_type(*$C$DW$T$40)
   10343                      .dwattr $C$DW$1879, DW_AT_name("VCPH_OVLO_ABS")
   10344                      .dwattr $C$DW$1879, DW_AT_TI_symbol_name("_VCPH_OVLO_ABS")
   10345                      .dwattr $C$DW$1879, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10346                      .dwattr $C$DW$1879, DW_AT_accessibility(DW_ACCESS_public)
   10347              $C$DW$1880      .dwtag  DW_TAG_member
   10348                      .dwattr $C$DW$1880, DW_AT_type(*$C$DW$T$40)
   10349                      .dwattr $C$DW$1880, DW_AT_name("VCPH_OVLO")
   10350                      .dwattr $C$DW$1880, DW_AT_TI_symbol_name("_VCPH_OVLO")
   10351                      .dwattr $C$DW$1880, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10352                      .dwattr $C$DW$1880, DW_AT_accessibility(DW_ACCESS_public)
   10353              $C$DW$1881      .dwtag  DW_TAG_member
   10354                      .dwattr $C$DW$1881, DW_AT_type(*$C$DW$T$40)
   10355                      .dwattr $C$DW$1881, DW_AT_name("VCPH_UVLO2")
   10356                      .dwattr $C$DW$1881, DW_AT_TI_symbol_name("_VCPH_UVLO2")
   10357                      .dwattr $C$DW$1881, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10358                      .dwattr $C$DW$1881, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  198

   10359              $C$DW$1882      .dwtag  DW_TAG_member
   10360                      .dwattr $C$DW$1882, DW_AT_type(*$C$DW$T$40)
   10361                      .dwattr $C$DW$1882, DW_AT_name("STAT03_RSV2")
   10362                      .dwattr $C$DW$1882, DW_AT_TI_symbol_name("_STAT03_RSV2")
   10363                      .dwattr $C$DW$1882, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10364                      .dwattr $C$DW$1882, DW_AT_accessibility(DW_ACCESS_public)
   10365              $C$DW$1883      .dwtag  DW_TAG_member
   10366                      .dwattr $C$DW$1883, DW_AT_type(*$C$DW$T$40)
   10367                      .dwattr $C$DW$1883, DW_AT_name("VCP_LSD_UVLO2")
   10368                      .dwattr $C$DW$1883, DW_AT_TI_symbol_name("_VCP_LSD_UVLO2")
   10369                      .dwattr $C$DW$1883, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10370                      .dwattr $C$DW$1883, DW_AT_accessibility(DW_ACCESS_public)
   10371              $C$DW$1884      .dwtag  DW_TAG_member
   10372                      .dwattr $C$DW$1884, DW_AT_type(*$C$DW$T$40)
   10373                      .dwattr $C$DW$1884, DW_AT_name("AVDD_UVLO")
   10374                      .dwattr $C$DW$1884, DW_AT_TI_symbol_name("_AVDD_UVLO")
   10375                      .dwattr $C$DW$1884, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10376                      .dwattr $C$DW$1884, DW_AT_accessibility(DW_ACCESS_public)
   10377              $C$DW$1885      .dwtag  DW_TAG_member
   10378                      .dwattr $C$DW$1885, DW_AT_type(*$C$DW$T$40)
   10379                      .dwattr $C$DW$1885, DW_AT_name("VREG_UV")
   10380                      .dwattr $C$DW$1885, DW_AT_TI_symbol_name("_VREG_UV")
   10381                      .dwattr $C$DW$1885, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10382                      .dwattr $C$DW$1885, DW_AT_accessibility(DW_ACCESS_public)
   10383              $C$DW$1886      .dwtag  DW_TAG_member
   10384                      .dwattr $C$DW$1886, DW_AT_type(*$C$DW$T$40)
   10385                      .dwattr $C$DW$1886, DW_AT_name("STAT03_RSV1")
   10386                      .dwattr $C$DW$1886, DW_AT_TI_symbol_name("_STAT03_RSV1")
   10387                      .dwattr $C$DW$1886, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10388                      .dwattr $C$DW$1886, DW_AT_accessibility(DW_ACCESS_public)
   10389              $C$DW$1887      .dwtag  DW_TAG_member
   10390                      .dwattr $C$DW$1887, DW_AT_type(*$C$DW$T$40)
   10391                      .dwattr $C$DW$1887, DW_AT_name("OTS")
   10392                      .dwattr $C$DW$1887, DW_AT_TI_symbol_name("_OTS")
   10393                      .dwattr $C$DW$1887, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   10394                      .dwattr $C$DW$1887, DW_AT_accessibility(DW_ACCESS_public)
   10395              $C$DW$1888      .dwtag  DW_TAG_member
   10396                      .dwattr $C$DW$1888, DW_AT_type(*$C$DW$T$40)
   10397                      .dwattr $C$DW$1888, DW_AT_name("WD_FAULT")
   10398                      .dwattr $C$DW$1888, DW_AT_TI_symbol_name("_WD_FAULT")
   10399                      .dwattr $C$DW$1888, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10400                      .dwattr $C$DW$1888, DW_AT_accessibility(DW_ACCESS_public)
   10401              $C$DW$1889      .dwtag  DW_TAG_member
   10402                      .dwattr $C$DW$1889, DW_AT_type(*$C$DW$T$40)
   10403                      .dwattr $C$DW$1889, DW_AT_name("PVDD_UVLO2")
   10404                      .dwattr $C$DW$1889, DW_AT_TI_symbol_name("_PVDD_UVLO2")
   10405                      .dwattr $C$DW$1889, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10406                      .dwattr $C$DW$1889, DW_AT_accessibility(DW_ACCESS_public)
   10407                      .dwendtag $C$DW$T$94
   10408              
   10409              $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat03_t_")
   10410                      .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$94)
   10411                      .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
   10412              
   10413              $C$DW$T$95      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  199

   10414                      .dwattr $C$DW$T$95, DW_AT_name("_DRV_SPI_8305_Stat04_t_")
   10415                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x0b)
   10416              $C$DW$1890      .dwtag  DW_TAG_member
   10417                      .dwattr $C$DW$1890, DW_AT_type(*$C$DW$T$40)
   10418                      .dwattr $C$DW$1890, DW_AT_name("STAT04_RSV5")
   10419                      .dwattr $C$DW$1890, DW_AT_TI_symbol_name("_STAT04_RSV5")
   10420                      .dwattr $C$DW$1890, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10421                      .dwattr $C$DW$1890, DW_AT_accessibility(DW_ACCESS_public)
   10422              $C$DW$1891      .dwtag  DW_TAG_member
   10423                      .dwattr $C$DW$1891, DW_AT_type(*$C$DW$T$40)
   10424                      .dwattr $C$DW$1891, DW_AT_name("STAT04_RSV4")
   10425                      .dwattr $C$DW$1891, DW_AT_TI_symbol_name("_STAT04_RSV4")
   10426                      .dwattr $C$DW$1891, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   10427                      .dwattr $C$DW$1891, DW_AT_accessibility(DW_ACCESS_public)
   10428              $C$DW$1892      .dwtag  DW_TAG_member
   10429                      .dwattr $C$DW$1892, DW_AT_type(*$C$DW$T$40)
   10430                      .dwattr $C$DW$1892, DW_AT_name("STAT04_RSV3")
   10431                      .dwattr $C$DW$1892, DW_AT_TI_symbol_name("_STAT04_RSV3")
   10432                      .dwattr $C$DW$1892, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   10433                      .dwattr $C$DW$1892, DW_AT_accessibility(DW_ACCESS_public)
   10434              $C$DW$1893      .dwtag  DW_TAG_member
   10435                      .dwattr $C$DW$1893, DW_AT_type(*$C$DW$T$40)
   10436                      .dwattr $C$DW$1893, DW_AT_name("STAT04_RSV2")
   10437                      .dwattr $C$DW$1893, DW_AT_TI_symbol_name("_STAT04_RSV2")
   10438                      .dwattr $C$DW$1893, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   10439                      .dwattr $C$DW$1893, DW_AT_accessibility(DW_ACCESS_public)
   10440              $C$DW$1894      .dwtag  DW_TAG_member
   10441                      .dwattr $C$DW$1894, DW_AT_type(*$C$DW$T$40)
   10442                      .dwattr $C$DW$1894, DW_AT_name("STAT04_RSV1")
   10443                      .dwattr $C$DW$1894, DW_AT_TI_symbol_name("_STAT04_RSV1")
   10444                      .dwattr $C$DW$1894, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10445                      .dwattr $C$DW$1894, DW_AT_accessibility(DW_ACCESS_public)
   10446              $C$DW$1895      .dwtag  DW_TAG_member
   10447                      .dwattr $C$DW$1895, DW_AT_type(*$C$DW$T$40)
   10448                      .dwattr $C$DW$1895, DW_AT_name("FETLC_VGS")
   10449                      .dwattr $C$DW$1895, DW_AT_TI_symbol_name("_FETLC_VGS")
   10450                      .dwattr $C$DW$1895, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
   10451                      .dwattr $C$DW$1895, DW_AT_accessibility(DW_ACCESS_public)
   10452              $C$DW$1896      .dwtag  DW_TAG_member
   10453                      .dwattr $C$DW$1896, DW_AT_type(*$C$DW$T$40)
   10454                      .dwattr $C$DW$1896, DW_AT_name("FETHC_VGS")
   10455                      .dwattr $C$DW$1896, DW_AT_TI_symbol_name("_FETHC_VGS")
   10456                      .dwattr $C$DW$1896, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10457                      .dwattr $C$DW$1896, DW_AT_accessibility(DW_ACCESS_public)
   10458              $C$DW$1897      .dwtag  DW_TAG_member
   10459                      .dwattr $C$DW$1897, DW_AT_type(*$C$DW$T$40)
   10460                      .dwattr $C$DW$1897, DW_AT_name("FETLB_VGS")
   10461                      .dwattr $C$DW$1897, DW_AT_TI_symbol_name("_FETLB_VGS")
   10462                      .dwattr $C$DW$1897, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   10463                      .dwattr $C$DW$1897, DW_AT_accessibility(DW_ACCESS_public)
   10464              $C$DW$1898      .dwtag  DW_TAG_member
   10465                      .dwattr $C$DW$1898, DW_AT_type(*$C$DW$T$40)
   10466                      .dwattr $C$DW$1898, DW_AT_name("FETHB_VGS")
   10467                      .dwattr $C$DW$1898, DW_AT_TI_symbol_name("_FETHB_VGS")
   10468                      .dwattr $C$DW$1898, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  200

   10469                      .dwattr $C$DW$1898, DW_AT_accessibility(DW_ACCESS_public)
   10470              $C$DW$1899      .dwtag  DW_TAG_member
   10471                      .dwattr $C$DW$1899, DW_AT_type(*$C$DW$T$40)
   10472                      .dwattr $C$DW$1899, DW_AT_name("FETLA_VGS")
   10473                      .dwattr $C$DW$1899, DW_AT_TI_symbol_name("_FETLA_VGS")
   10474                      .dwattr $C$DW$1899, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
   10475                      .dwattr $C$DW$1899, DW_AT_accessibility(DW_ACCESS_public)
   10476              $C$DW$1900      .dwtag  DW_TAG_member
   10477                      .dwattr $C$DW$1900, DW_AT_type(*$C$DW$T$40)
   10478                      .dwattr $C$DW$1900, DW_AT_name("FETHA_VGS")
   10479                      .dwattr $C$DW$1900, DW_AT_TI_symbol_name("_FETHA_VGS")
   10480                      .dwattr $C$DW$1900, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
   10481                      .dwattr $C$DW$1900, DW_AT_accessibility(DW_ACCESS_public)
   10482                      .dwendtag $C$DW$T$95
   10483              
   10484              $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Stat04_t_")
   10485                      .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$95)
   10486                      .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
   10487              
   10488              $C$DW$T$108     .dwtag  DW_TAG_structure_type
   10489                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8305_Vars_t_")
   10490                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x61)
   10491              $C$DW$1901      .dwtag  DW_TAG_member
   10492                      .dwattr $C$DW$1901, DW_AT_type(*$C$DW$T$96)
   10493                      .dwattr $C$DW$1901, DW_AT_name("Stat_Reg_01")
   10494                      .dwattr $C$DW$1901, DW_AT_TI_symbol_name("_Stat_Reg_01")
   10495                      .dwattr $C$DW$1901, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10496                      .dwattr $C$DW$1901, DW_AT_accessibility(DW_ACCESS_public)
   10497              $C$DW$1902      .dwtag  DW_TAG_member
   10498                      .dwattr $C$DW$1902, DW_AT_type(*$C$DW$T$97)
   10499                      .dwattr $C$DW$1902, DW_AT_name("Stat_Reg_02")
   10500                      .dwattr $C$DW$1902, DW_AT_TI_symbol_name("_Stat_Reg_02")
   10501                      .dwattr $C$DW$1902, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
   10502                      .dwattr $C$DW$1902, DW_AT_accessibility(DW_ACCESS_public)
   10503              $C$DW$1903      .dwtag  DW_TAG_member
   10504                      .dwattr $C$DW$1903, DW_AT_type(*$C$DW$T$98)
   10505                      .dwattr $C$DW$1903, DW_AT_name("Stat_Reg_03")
   10506                      .dwattr $C$DW$1903, DW_AT_TI_symbol_name("_Stat_Reg_03")
   10507                      .dwattr $C$DW$1903, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
   10508                      .dwattr $C$DW$1903, DW_AT_accessibility(DW_ACCESS_public)
   10509              $C$DW$1904      .dwtag  DW_TAG_member
   10510                      .dwattr $C$DW$1904, DW_AT_type(*$C$DW$T$99)
   10511                      .dwattr $C$DW$1904, DW_AT_name("Stat_Reg_04")
   10512                      .dwattr $C$DW$1904, DW_AT_TI_symbol_name("_Stat_Reg_04")
   10513                      .dwattr $C$DW$1904, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   10514                      .dwattr $C$DW$1904, DW_AT_accessibility(DW_ACCESS_public)
   10515              $C$DW$1905      .dwtag  DW_TAG_member
   10516                      .dwattr $C$DW$1905, DW_AT_type(*$C$DW$T$100)
   10517                      .dwattr $C$DW$1905, DW_AT_name("Ctrl_Reg_05")
   10518                      .dwattr $C$DW$1905, DW_AT_TI_symbol_name("_Ctrl_Reg_05")
   10519                      .dwattr $C$DW$1905, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   10520                      .dwattr $C$DW$1905, DW_AT_accessibility(DW_ACCESS_public)
   10521              $C$DW$1906      .dwtag  DW_TAG_member
   10522                      .dwattr $C$DW$1906, DW_AT_type(*$C$DW$T$101)
   10523                      .dwattr $C$DW$1906, DW_AT_name("Ctrl_Reg_06")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  201

   10524                      .dwattr $C$DW$1906, DW_AT_TI_symbol_name("_Ctrl_Reg_06")
   10525                      .dwattr $C$DW$1906, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
   10526                      .dwattr $C$DW$1906, DW_AT_accessibility(DW_ACCESS_public)
   10527              $C$DW$1907      .dwtag  DW_TAG_member
   10528                      .dwattr $C$DW$1907, DW_AT_type(*$C$DW$T$102)
   10529                      .dwattr $C$DW$1907, DW_AT_name("Ctrl_Reg_07")
   10530                      .dwattr $C$DW$1907, DW_AT_TI_symbol_name("_Ctrl_Reg_07")
   10531                      .dwattr $C$DW$1907, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
   10532                      .dwattr $C$DW$1907, DW_AT_accessibility(DW_ACCESS_public)
   10533              $C$DW$1908      .dwtag  DW_TAG_member
   10534                      .dwattr $C$DW$1908, DW_AT_type(*$C$DW$T$103)
   10535                      .dwattr $C$DW$1908, DW_AT_name("Ctrl_Reg_08")
   10536                      .dwattr $C$DW$1908, DW_AT_TI_symbol_name("_Ctrl_Reg_08")
   10537                      .dwattr $C$DW$1908, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
   10538                      .dwattr $C$DW$1908, DW_AT_accessibility(DW_ACCESS_public)
   10539              $C$DW$1909      .dwtag  DW_TAG_member
   10540                      .dwattr $C$DW$1909, DW_AT_type(*$C$DW$T$104)
   10541                      .dwattr $C$DW$1909, DW_AT_name("Ctrl_Reg_09")
   10542                      .dwattr $C$DW$1909, DW_AT_TI_symbol_name("_Ctrl_Reg_09")
   10543                      .dwattr $C$DW$1909, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
   10544                      .dwattr $C$DW$1909, DW_AT_accessibility(DW_ACCESS_public)
   10545              $C$DW$1910      .dwtag  DW_TAG_member
   10546                      .dwattr $C$DW$1910, DW_AT_type(*$C$DW$T$105)
   10547                      .dwattr $C$DW$1910, DW_AT_name("Ctrl_Reg_0A")
   10548                      .dwattr $C$DW$1910, DW_AT_TI_symbol_name("_Ctrl_Reg_0A")
   10549                      .dwattr $C$DW$1910, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
   10550                      .dwattr $C$DW$1910, DW_AT_accessibility(DW_ACCESS_public)
   10551              $C$DW$1911      .dwtag  DW_TAG_member
   10552                      .dwattr $C$DW$1911, DW_AT_type(*$C$DW$T$106)
   10553                      .dwattr $C$DW$1911, DW_AT_name("Ctrl_Reg_0B")
   10554                      .dwattr $C$DW$1911, DW_AT_TI_symbol_name("_Ctrl_Reg_0B")
   10555                      .dwattr $C$DW$1911, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
   10556                      .dwattr $C$DW$1911, DW_AT_accessibility(DW_ACCESS_public)
   10557              $C$DW$1912      .dwtag  DW_TAG_member
   10558                      .dwattr $C$DW$1912, DW_AT_type(*$C$DW$T$107)
   10559                      .dwattr $C$DW$1912, DW_AT_name("Ctrl_Reg_0C")
   10560                      .dwattr $C$DW$1912, DW_AT_TI_symbol_name("_Ctrl_Reg_0C")
   10561                      .dwattr $C$DW$1912, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
   10562                      .dwattr $C$DW$1912, DW_AT_accessibility(DW_ACCESS_public)
   10563              $C$DW$1913      .dwtag  DW_TAG_member
   10564                      .dwattr $C$DW$1913, DW_AT_type(*$C$DW$T$40)
   10565                      .dwattr $C$DW$1913, DW_AT_name("WriteCmd")
   10566                      .dwattr $C$DW$1913, DW_AT_TI_symbol_name("_WriteCmd")
   10567                      .dwattr $C$DW$1913, DW_AT_data_member_location[DW_OP_plus_uconst 0x59]
   10568                      .dwattr $C$DW$1913, DW_AT_accessibility(DW_ACCESS_public)
   10569              $C$DW$1914      .dwtag  DW_TAG_member
   10570                      .dwattr $C$DW$1914, DW_AT_type(*$C$DW$T$40)
   10571                      .dwattr $C$DW$1914, DW_AT_name("ReadCmd")
   10572                      .dwattr $C$DW$1914, DW_AT_TI_symbol_name("_ReadCmd")
   10573                      .dwattr $C$DW$1914, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
   10574                      .dwattr $C$DW$1914, DW_AT_accessibility(DW_ACCESS_public)
   10575              $C$DW$1915      .dwtag  DW_TAG_member
   10576                      .dwattr $C$DW$1915, DW_AT_type(*$C$DW$T$21)
   10577                      .dwattr $C$DW$1915, DW_AT_name("ManWriteAddr")
   10578                      .dwattr $C$DW$1915, DW_AT_TI_symbol_name("_ManWriteAddr")
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  202

   10579                      .dwattr $C$DW$1915, DW_AT_data_member_location[DW_OP_plus_uconst 0x5b]
   10580                      .dwattr $C$DW$1915, DW_AT_accessibility(DW_ACCESS_public)
   10581              $C$DW$1916      .dwtag  DW_TAG_member
   10582                      .dwattr $C$DW$1916, DW_AT_type(*$C$DW$T$21)
   10583                      .dwattr $C$DW$1916, DW_AT_name("ManReadAddr")
   10584                      .dwattr $C$DW$1916, DW_AT_TI_symbol_name("_ManReadAddr")
   10585                      .dwattr $C$DW$1916, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
   10586                      .dwattr $C$DW$1916, DW_AT_accessibility(DW_ACCESS_public)
   10587              $C$DW$1917      .dwtag  DW_TAG_member
   10588                      .dwattr $C$DW$1917, DW_AT_type(*$C$DW$T$21)
   10589                      .dwattr $C$DW$1917, DW_AT_name("ManWriteData")
   10590                      .dwattr $C$DW$1917, DW_AT_TI_symbol_name("_ManWriteData")
   10591                      .dwattr $C$DW$1917, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
   10592                      .dwattr $C$DW$1917, DW_AT_accessibility(DW_ACCESS_public)
   10593              $C$DW$1918      .dwtag  DW_TAG_member
   10594                      .dwattr $C$DW$1918, DW_AT_type(*$C$DW$T$21)
   10595                      .dwattr $C$DW$1918, DW_AT_name("ManReadData")
   10596                      .dwattr $C$DW$1918, DW_AT_TI_symbol_name("_ManReadData")
   10597                      .dwattr $C$DW$1918, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
   10598                      .dwattr $C$DW$1918, DW_AT_accessibility(DW_ACCESS_public)
   10599              $C$DW$1919      .dwtag  DW_TAG_member
   10600                      .dwattr $C$DW$1919, DW_AT_type(*$C$DW$T$40)
   10601                      .dwattr $C$DW$1919, DW_AT_name("ManWriteCmd")
   10602                      .dwattr $C$DW$1919, DW_AT_TI_symbol_name("_ManWriteCmd")
   10603                      .dwattr $C$DW$1919, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
   10604                      .dwattr $C$DW$1919, DW_AT_accessibility(DW_ACCESS_public)
   10605              $C$DW$1920      .dwtag  DW_TAG_member
   10606                      .dwattr $C$DW$1920, DW_AT_type(*$C$DW$T$40)
   10607                      .dwattr $C$DW$1920, DW_AT_name("ManReadCmd")
   10608                      .dwattr $C$DW$1920, DW_AT_TI_symbol_name("_ManReadCmd")
   10609                      .dwattr $C$DW$1920, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
   10610                      .dwattr $C$DW$1920, DW_AT_accessibility(DW_ACCESS_public)
   10611                      .dwendtag $C$DW$T$108
   10612              
   10613              $C$DW$T$383     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Vars_t")
   10614                      .dwattr $C$DW$T$383, DW_AT_type(*$C$DW$T$108)
   10615                      .dwattr $C$DW$T$383, DW_AT_language(DW_LANG_C)
   10616              $C$DW$T$384     .dwtag  DW_TAG_pointer_type
   10617                      .dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$383)
   10618                      .dwattr $C$DW$T$384, DW_AT_address_class(0x20)
   10619              
   10620              $C$DW$T$110     .dwtag  DW_TAG_structure_type
   10621                      .dwattr $C$DW$T$110, DW_AT_name("_FILTER_FO_")
   10622                      .dwattr $C$DW$T$110, DW_AT_byte_size(0x0a)
   10623              $C$DW$1921      .dwtag  DW_TAG_member
   10624                      .dwattr $C$DW$1921, DW_AT_type(*$C$DW$T$109)
   10625                      .dwattr $C$DW$1921, DW_AT_name("a1")
   10626                      .dwattr $C$DW$1921, DW_AT_TI_symbol_name("_a1")
   10627                      .dwattr $C$DW$1921, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   10628                      .dwattr $C$DW$1921, DW_AT_accessibility(DW_ACCESS_public)
   10629              $C$DW$1922      .dwtag  DW_TAG_member
   10630                      .dwattr $C$DW$1922, DW_AT_type(*$C$DW$T$109)
   10631                      .dwattr $C$DW$1922, DW_AT_name("b0")
   10632                      .dwattr $C$DW$1922, DW_AT_TI_symbol_name("_b0")
   10633                      .dwattr $C$DW$1922, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.6 Tue Sep 15 13:02:10 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\2976410                          PAGE  203

   10634                      .dwattr $C$DW$1922, DW_AT_accessibility(DW_ACCESS_public)
   10635              $C$DW$1923      .dwtag  DW_TAG_member
   10636                      .dwattr $C$DW$1923, DW_AT_type(*$C$DW$T$109)
   10637                      .dwattr $C$DW$1923, DW_AT_name("b1")
   10638                      .dwattr $C$DW$1923, DW_AT_TI_symbol_name("_b1")
   10639                      .dwattr $C$DW$1923, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   10640                      .dwattr $C$DW$1923, DW_AT_accessibility(DW_ACCESS_public)
   10641              $C$DW$1924      .dwtag  DW_TAG_member
   10642                      .dwattr $C$DW$1924, DW_AT_type(*$C$DW$T$109)
   10643                      .dwattr $C$DW$1924, DW_AT_name("x1")
   10644                      .dwattr $C$DW$1924, DW_AT_TI_symbol_name("_x1")
   10645                      .dwattr $C$DW$1924, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   10646                      .dwattr $C$DW$1924, DW_AT_accessibility(DW_ACCESS_public)
