TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:13 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0908810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:13 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/offset/src/32b/offset.c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("FILTER_FO_setNumCoeffs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_FILTER_FO_setNumCoeffs")

     440                      .dwattr $C$DW$48, DW_AT_location[DW_OP_reg12]
     441              
     442              ;***************************************************************
     443              ;* FNAME: _OFFSET_getBeta               FR SIZE:   6           *
     444              ;*                                                             *
     445              ;* FUNCTION ENVIRONMENT                                        *
     446              ;*                                                             *
     447              ;* FUNCTION PROPERTIES                                         *
     448              ;*                            2 Parameter,  4 Auto,  0 SOE     *
     449              ;***************************************************************
     450              
     451              _OFFSET_getBeta:
     452              ;* AR4   assigned to _handle
     453              $C$DW$49        .dwtag  DW_TAG_variable, DW_AT_name("handle")
     454                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_handle")
     455                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$37)
     456                      .dwattr $C$DW$49, DW_AT_location[DW_OP_reg12]
     457              $C$DW$50        .dwtag  DW_TAG_variable, DW_AT_name("b0")
     458                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_b0")
     459                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$21)
     460                      .dwattr $C$DW$50, DW_AT_location[DW_OP_breg20 -4]
     461              $C$DW$51        .dwtag  DW_TAG_variable, DW_AT_name("b1")
     462                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_b1")
     463                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     464                      .dwattr $C$DW$51, DW_AT_location[DW_OP_breg20 -6]
     465                      .dwcfi  cfa_offset, -2
     466                      .dwcfi  save_reg_to_mem, 26, 0
     467 00000039 FE06          ADDB      SP,#6                 ; [CPU_U] 
     468                      .dwcfi  cfa_offset, -8
     469                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_15/sw/modules/offset/src/32b/offset.c",line 64,column
     470 0000003a 5DAD          MOVZ      AR5,SP                ; [CPU_] |64| 
     471 0000003b DD86          SUBB      XAR5,#6               ; [CPU_U] |64| 
     472 0000003c 0EA5          MOVU      ACC,AR5               ; [CPU_] |64| 
     473 0000003d 5DAD          MOVZ      AR5,SP                ; [CPU_] |64| 
     474 0000003e D00E          MOVB      XAR0,#14              ; [CPU_] |64| 
     475 0000003f 1E42          MOVL      *-SP[2],ACC           ; [CPU_] |64| 
     476 00000040 8A94          MOVL      XAR4,*+XAR4[AR0]      ; [CPU_] |64| 
     477 00000041 DD84          SUBB      XAR5,#4               ; [CPU_U] |64| 
     478 00000042 5DA5          MOVZ      AR5,AR5               ; [CPU_] |64| 
     479              $C$DW$52        .dwtag  DW_TAG_TI_branch
     480                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     481                      .dwattr $C$DW$52, DW_AT_name("_FILTER_FO_getNumCoeffs")
     482                      .dwattr $C$DW$52, DW_AT_TI_call
     483 00000043 7640!         LCR       #_FILTER_FO_getNumCoeffs ; [CPU_] |64| 
         00000044 0000 
     484                      ; call occurs [#_FILTER_FO_getNumCoeffs] ; [] |64| 
     485                      .dwpsn  file "C:/ti/motorware/motorware_1_01_00_15/sw/modules/offset/src/32b/offset.c",line 66,column
     486 00000045 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |66| 
     487 00000046 FE86          SUBB      SP,#6                 ; [CPU_U] 
     488                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:13 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0908810                          PAGE   10

     489              $C$DW$53        .dwtag  DW_TAG_TI_branch
     490                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     491                      .dwattr $C$DW$53, DW_AT_TI_return
     492 00000047 0006          LRETR     ; [CPU_] 
     493                      ; return occurs ; [] 
     494                      .dwattr $C$DW$47, DW_AT_TI_end_file("C:/ti/motorware/motorware_1_01_00_15/sw/modules/offset/src/32b/o
     495                      .dwattr $C$DW$47, DW_AT_TI_end_line(0x43)
     496                      .dwattr $C$DW$47, DW_AT_TI_end_column(0x01)
     497                      .dwendentry
     498                      .dwendtag $C$DW$47
     499              
     500              ;**************************************************************
     501              ;* UNDEFINED EXTERNAL REFERENCES                              *
     502              ;**************************************************************
     503                      .global _FILTER_FO_setNumCoeffs
     504                      .global _FILTER_FO_setInitialConditions
     505                      .global _FILTER_FO_getNumCoeffs
     506                      .global _FILTER_FO_setDenCoeffs
     507                      .global _FILTER_FO_init
     508              
     509              ;***************************************************************
     510              ;* TYPE INFORMATION                                            *
     511              ;***************************************************************
     512              
     513              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     514                      .dwattr $C$DW$T$22, DW_AT_name("_FILTER_FO_")
     515                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0a)
     516              $C$DW$54        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$21)
     518                      .dwattr $C$DW$54, DW_AT_name("a1")
     519                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_a1")
     520                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     522              $C$DW$55        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     524                      .dwattr $C$DW$55, DW_AT_name("b0")
     525                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_b0")
     526                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     527                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     528              $C$DW$56        .dwtag  DW_TAG_member
     529                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     530                      .dwattr $C$DW$56, DW_AT_name("b1")
     531                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_b1")
     532                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     533                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     534              $C$DW$57        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     536                      .dwattr $C$DW$57, DW_AT_name("x1")
     537                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_x1")
     538                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     539                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     540              $C$DW$58        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     542                      .dwattr $C$DW$58, DW_AT_name("y1")
     543                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_y1")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:13 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0908810                          PAGE   11

     544                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     545                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     546                      .dwendtag $C$DW$T$22
     547              
     548              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Obj")
     549                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     550                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     551              
     552              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     553                      .dwattr $C$DW$T$19, DW_AT_name("_FILTER_FO_Obj_")
     554                      .dwattr $C$DW$T$19, DW_AT_declaration
     555                      .dwendtag $C$DW$T$19
     556              
     557              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     558                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
     559                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     560              $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("FILTER_FO_Handle")
     561                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     562                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     563              
     564              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     565                      .dwattr $C$DW$T$26, DW_AT_name("_OFFSET_")
     566                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     567              $C$DW$59        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     569                      .dwattr $C$DW$59, DW_AT_name("value")
     570                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_value")
     571                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$60        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     575                      .dwattr $C$DW$60, DW_AT_name("bias")
     576                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bias")
     577                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     578                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$61        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$23)
     581                      .dwattr $C$DW$61, DW_AT_name("filter")
     582                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_filter")
     583                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     584                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$62        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     587                      .dwattr $C$DW$62, DW_AT_name("filterHandle")
     588                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_filterHandle")
     589                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     590                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     591                      .dwendtag $C$DW$T$26
     592              
     593              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Obj")
     594                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$26)
     595                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
     596              
     597              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     598                      .dwattr $C$DW$T$20, DW_AT_name("_OFFSET_Obj_")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:13 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0908810                          PAGE   12

     599                      .dwattr $C$DW$T$20, DW_AT_declaration
     600                      .dwendtag $C$DW$T$20
     601              
     602              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     603                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$20)
     604                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     605              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("OFFSET_Handle")
     606                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     607                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     608              $C$DW$63        .dwtag  DW_TAG_TI_far_type
     609                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$36)
     610              $C$DW$T$37      .dwtag  DW_TAG_const_type
     611                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$63)
     612              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     613                      .dwattr $C$DW$T$2, DW_AT_name("void")
     614              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     615                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
     616                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     617              $C$DW$64        .dwtag  DW_TAG_TI_far_type
     618                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$3)
     619              $C$DW$T$41      .dwtag  DW_TAG_const_type
     620                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$64)
     621              $C$DW$T$4       .dwtag  DW_TAG_base_type
     622                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     623                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     624                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     625              $C$DW$T$5       .dwtag  DW_TAG_base_type
     626                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     627                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     628                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     629              $C$DW$T$6       .dwtag  DW_TAG_base_type
     630                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     631                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     632                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     633              $C$DW$T$7       .dwtag  DW_TAG_base_type
     634                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     635                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     636                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     637              $C$DW$T$8       .dwtag  DW_TAG_base_type
     638                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     639                      .dwattr $C$DW$T$8, DW_AT_name("short")
     640                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     641              $C$DW$T$9       .dwtag  DW_TAG_base_type
     642                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     643                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
