TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:14 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/drivers/pie/src/32b/f28x/f2802x
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.6\bin\opt2000.exe C:\\Users\\Admiral\\AppData\\Local\\Tem

C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   37

    1932              $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT6"), DW_AT_const_value(0x06)
    1933              $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT7"), DW_AT_const_value(0x07)
    1934              $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT8"), DW_AT_const_value(0x08)
    1935              $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT9"), DW_AT_const_value(0x09)
    1936              $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT10"), DW_AT_const_value(0x0a)
    1937              $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT11"), DW_AT_const_value(0x0b)
    1938              $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_INT12"), DW_AT_const_value(0x0c)
    1939              $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT1"), DW_AT_const_value(0x0d)
    1940              $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_TINT2"), DW_AT_const_value(0x0e)
    1941              $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_DATALOG"), DW_AT_const_value(0x0f
    1942              $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_RTOSINT"), DW_AT_const_value(0x10
    1943              $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_EMUINT"), DW_AT_const_value(0x11)
    1944              $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_NMI"), DW_AT_const_value(0x12)
    1945              $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_ILLEGAL"), DW_AT_const_value(0x13
    1946              $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER1"), DW_AT_const_value(0x14)
    1947              $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER2"), DW_AT_const_value(0x15)
    1948              $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER3"), DW_AT_const_value(0x16)
    1949              $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER4"), DW_AT_const_value(0x17)
    1950              $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER5"), DW_AT_const_value(0x18)
    1951              $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER6"), DW_AT_const_value(0x19)
    1952              $C$DW$250       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER7"), DW_AT_const_value(0x1a)
    1953              $C$DW$251       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER8"), DW_AT_const_value(0x1b)
    1954              $C$DW$252       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER9"), DW_AT_const_value(0x1c)
    1955              $C$DW$253       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER10"), DW_AT_const_value(0x1d)
    1956              $C$DW$254       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER11"), DW_AT_const_value(0x1e)
    1957              $C$DW$255       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_SystemInterrupts_USER12"), DW_AT_const_value(0x1f)
    1958                      .dwendtag $C$DW$T$52
    1959              
    1960              $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_SystemInterrupts_e")
    1961                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1962                      .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1963              $C$DW$256       .dwtag  DW_TAG_TI_far_type
    1964                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$53)
    1965              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1966                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$256)
    1967              
    1968              $C$DW$T$55      .dwtag  DW_TAG_enumeration_type
    1969                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1970              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_FallingEdge"), DW_AT_const_value(0x
    1971              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingEdge"), DW_AT_const_value(0x0
    1972              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_ExtIntPolarity_RisingAndFallingEdge"), DW_AT_const
    1973                      .dwendtag $C$DW$T$55
    1974              
    1975              $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_ExtIntPolarity_e")
    1976                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    1977                      .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1978              $C$DW$260       .dwtag  DW_TAG_TI_far_type
    1979                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$56)
    1980              $C$DW$T$57      .dwtag  DW_TAG_const_type
    1981                      .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$260)
    1982              
    1983              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1984                      .dwattr $C$DW$T$21, DW_AT_name("_PIE_IERIFR_t")
    1985                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
    1986              $C$DW$261       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   38

    1987                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    1988                      .dwattr $C$DW$261, DW_AT_name("IER")
    1989                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_IER")
    1990                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$262       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    1994                      .dwattr $C$DW$262, DW_AT_name("IFR")
    1995                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_IFR")
    1996                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1997                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    1998                      .dwendtag $C$DW$T$21
    1999              
    2000              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IERIFR_t")
    2001                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    2002                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2003              $C$DW$263       .dwtag  DW_TAG_TI_far_type
    2004                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$22)
    2005              $C$DW$T$23      .dwtag  DW_TAG_volatile_type
    2006                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$263)
    2007              
    2008              $C$DW$T$24      .dwtag  DW_TAG_array_type
    2009                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2010                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    2011                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x18)
    2012              $C$DW$264       .dwtag  DW_TAG_subrange_type
    2013                      .dwattr $C$DW$264, DW_AT_upper_bound(0x0b)
    2014                      .dwendtag $C$DW$T$24
    2015              
    2016              
    2017              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2018                      .dwattr $C$DW$T$33, DW_AT_name("_PIE_Obj_")
    2019                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x639c)
    2020              $C$DW$265       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2022                      .dwattr $C$DW$265, DW_AT_name("PIECTRL")
    2023                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_PIECTRL")
    2024                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2026              $C$DW$266       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    2028                      .dwattr $C$DW$266, DW_AT_name("PIEACK")
    2029                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PIEACK")
    2030                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2031                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2032              $C$DW$267       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$24)
    2034                      .dwattr $C$DW$267, DW_AT_name("PIEIER_PIEIFR")
    2035                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PIEIER_PIEIFR")
    2036                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2037                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$268       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
    2040                      .dwattr $C$DW$268, DW_AT_name("rsvd_1")
    2041                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd_1")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   39

    2042                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2043                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$269       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$29)
    2046                      .dwattr $C$DW$269, DW_AT_name("Reset")
    2047                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_Reset")
    2048                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2049                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2050              $C$DW$270       .dwtag  DW_TAG_member
    2051                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$29)
    2052                      .dwattr $C$DW$270, DW_AT_name("INT1")
    2053                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INT1")
    2054                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2055                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$271       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$29)
    2058                      .dwattr $C$DW$271, DW_AT_name("INT2")
    2059                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INT2")
    2060                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2061                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2062              $C$DW$272       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$29)
    2064                      .dwattr $C$DW$272, DW_AT_name("INT3")
    2065                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INT3")
    2066                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2067                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$273       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$29)
    2070                      .dwattr $C$DW$273, DW_AT_name("INT4")
    2071                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_INT4")
    2072                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2073                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$274       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$29)
    2076                      .dwattr $C$DW$274, DW_AT_name("INT5")
    2077                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT5")
    2078                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2079                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$275       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$29)
    2082                      .dwattr $C$DW$275, DW_AT_name("INT6")
    2083                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INT6")
    2084                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2085                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2086              $C$DW$276       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$29)
    2088                      .dwattr $C$DW$276, DW_AT_name("INT7")
    2089                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INT7")
    2090                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2091                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2092              $C$DW$277       .dwtag  DW_TAG_member
    2093                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$29)
    2094                      .dwattr $C$DW$277, DW_AT_name("INT8")
    2095                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT8")
    2096                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   40

    2097                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2098              $C$DW$278       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$29)
    2100                      .dwattr $C$DW$278, DW_AT_name("INT9")
    2101                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INT9")
    2102                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2103                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2104              $C$DW$279       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$29)
    2106                      .dwattr $C$DW$279, DW_AT_name("INT10")
    2107                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT10")
    2108                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2109                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$280       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$29)
    2112                      .dwattr $C$DW$280, DW_AT_name("INT11")
    2113                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INT11")
    2114                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2115                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$281       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
    2118                      .dwattr $C$DW$281, DW_AT_name("INT12")
    2119                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INT12")
    2120                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2121                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$282       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$29)
    2124                      .dwattr $C$DW$282, DW_AT_name("TINT1")
    2125                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_TINT1")
    2126                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2127                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$283       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$29)
    2130                      .dwattr $C$DW$283, DW_AT_name("TINT2")
    2131                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_TINT2")
    2132                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2133                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$284       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$29)
    2136                      .dwattr $C$DW$284, DW_AT_name("DATALOG")
    2137                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_DATALOG")
    2138                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2139                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$285       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$29)
    2142                      .dwattr $C$DW$285, DW_AT_name("RTOSINT")
    2143                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_RTOSINT")
    2144                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2145                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$286       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$29)
    2148                      .dwattr $C$DW$286, DW_AT_name("EMUINT")
    2149                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_EMUINT")
    2150                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2151                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   41

    2152              $C$DW$287       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$29)
    2154                      .dwattr $C$DW$287, DW_AT_name("NMI")
    2155                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_NMI")
    2156                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2157                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2158              $C$DW$288       .dwtag  DW_TAG_member
    2159                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$29)
    2160                      .dwattr $C$DW$288, DW_AT_name("ILLEGAL")
    2161                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_ILLEGAL")
    2162                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2163                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$289       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$29)
    2166                      .dwattr $C$DW$289, DW_AT_name("USER1")
    2167                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_USER1")
    2168                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2169                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$290       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$29)
    2172                      .dwattr $C$DW$290, DW_AT_name("USER2")
    2173                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_USER2")
    2174                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    2175                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2176              $C$DW$291       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$29)
    2178                      .dwattr $C$DW$291, DW_AT_name("USER3")
    2179                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_USER3")
    2180                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2181                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2182              $C$DW$292       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    2184                      .dwattr $C$DW$292, DW_AT_name("USER4")
    2185                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_USER4")
    2186                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    2187                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$293       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$29)
    2190                      .dwattr $C$DW$293, DW_AT_name("USER5")
    2191                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_USER5")
    2192                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2193                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$294       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$29)
    2196                      .dwattr $C$DW$294, DW_AT_name("USER6")
    2197                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_USER6")
    2198                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    2199                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$295       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$29)
    2202                      .dwattr $C$DW$295, DW_AT_name("USER7")
    2203                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_USER7")
    2204                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2205                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$296       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   42

    2207                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$29)
    2208                      .dwattr $C$DW$296, DW_AT_name("USER8")
    2209                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_USER8")
    2210                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    2211                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$297       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$29)
    2214                      .dwattr $C$DW$297, DW_AT_name("USER9")
    2215                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_USER9")
    2216                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2217                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$298       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$29)
    2220                      .dwattr $C$DW$298, DW_AT_name("USER10")
    2221                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_USER10")
    2222                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2223                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$299       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$29)
    2226                      .dwattr $C$DW$299, DW_AT_name("USER11")
    2227                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_USER11")
    2228                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    2229                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$300       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$29)
    2232                      .dwattr $C$DW$300, DW_AT_name("USER12")
    2233                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_USER12")
    2234                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    2235                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$301       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$29)
    2238                      .dwattr $C$DW$301, DW_AT_name("ADCINT1_HP")
    2239                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_ADCINT1_HP")
    2240                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    2241                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$302       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$29)
    2244                      .dwattr $C$DW$302, DW_AT_name("ADCINT2_HP")
    2245                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_ADCINT2_HP")
    2246                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    2247                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$303       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$29)
    2250                      .dwattr $C$DW$303, DW_AT_name("rsvd1_3")
    2251                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_rsvd1_3")
    2252                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2253                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$304       .dwtag  DW_TAG_member
    2255                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$29)
    2256                      .dwattr $C$DW$304, DW_AT_name("XINT1")
    2257                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_XINT1")
    2258                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    2259                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$305       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   43

    2262                      .dwattr $C$DW$305, DW_AT_name("XINT2")
    2263                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_XINT2")
    2264                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    2265                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$306       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$29)
    2268                      .dwattr $C$DW$306, DW_AT_name("ADCINT9")
    2269                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_ADCINT9")
    2270                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    2271                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$307       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$29)
    2274                      .dwattr $C$DW$307, DW_AT_name("TINT0")
    2275                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_TINT0")
    2276                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2277                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$308       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$29)
    2280                      .dwattr $C$DW$308, DW_AT_name("WAKEINT")
    2281                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_WAKEINT")
    2282                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    2283                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2284              $C$DW$309       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$29)
    2286                      .dwattr $C$DW$309, DW_AT_name("EPWM1_TZINT")
    2287                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    2288                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    2289                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2290              $C$DW$310       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$29)
    2292                      .dwattr $C$DW$310, DW_AT_name("EPWM2_TZINT")
    2293                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    2294                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2295                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$311       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$29)
    2298                      .dwattr $C$DW$311, DW_AT_name("EPWM3_TZINT")
    2299                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    2300                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2301                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$312       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    2304                      .dwattr $C$DW$312, DW_AT_name("EPWM4_TZINT")
    2305                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    2306                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2307                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    2308              $C$DW$313       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$29)
    2310                      .dwattr $C$DW$313, DW_AT_name("rsvd2_5")
    2311                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_rsvd2_5")
    2312                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2313                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    2314              $C$DW$314       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$29)
    2316                      .dwattr $C$DW$314, DW_AT_name("rsvd2_6")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   44

    2317                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_rsvd2_6")
    2318                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2319                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    2320              $C$DW$315       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$29)
    2322                      .dwattr $C$DW$315, DW_AT_name("rsvd2_7")
    2323                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_rsvd2_7")
    2324                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2325                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    2326              $C$DW$316       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$29)
    2328                      .dwattr $C$DW$316, DW_AT_name("rsvd2_8")
    2329                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd2_8")
    2330                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2331                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    2332              $C$DW$317       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$29)
    2334                      .dwattr $C$DW$317, DW_AT_name("EPWM1_INT")
    2335                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_EPWM1_INT")
    2336                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2337                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    2338              $C$DW$318       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$29)
    2340                      .dwattr $C$DW$318, DW_AT_name("EPWM2_INT")
    2341                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_EPWM2_INT")
    2342                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    2343                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    2344              $C$DW$319       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$29)
    2346                      .dwattr $C$DW$319, DW_AT_name("EPWM3_INT")
    2347                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_EPWM3_INT")
    2348                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    2349                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    2350              $C$DW$320       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$29)
    2352                      .dwattr $C$DW$320, DW_AT_name("EPWM4_INT")
    2353                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_EPWM4_INT")
    2354                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    2355                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    2356              $C$DW$321       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$29)
    2358                      .dwattr $C$DW$321, DW_AT_name("rsvd3_5")
    2359                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_rsvd3_5")
    2360                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    2361                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$322       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$29)
    2364                      .dwattr $C$DW$322, DW_AT_name("rsvd3_6")
    2365                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_rsvd3_6")
    2366                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    2367                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    2368              $C$DW$323       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$29)
    2370                      .dwattr $C$DW$323, DW_AT_name("rsvd3_7")
    2371                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_rsvd3_7")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   45

    2372                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    2373                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    2374              $C$DW$324       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$29)
    2376                      .dwattr $C$DW$324, DW_AT_name("rsvd3_8")
    2377                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_rsvd3_8")
    2378                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    2379                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$325       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$29)
    2382                      .dwattr $C$DW$325, DW_AT_name("ECAP1_INT")
    2383                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_ECAP1_INT")
    2384                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    2385                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$326       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$29)
    2388                      .dwattr $C$DW$326, DW_AT_name("rsvd4_2")
    2389                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_rsvd4_2")
    2390                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    2391                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    2392              $C$DW$327       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$29)
    2394                      .dwattr $C$DW$327, DW_AT_name("rsvd4_3")
    2395                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_rsvd4_3")
    2396                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    2397                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    2398              $C$DW$328       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$29)
    2400                      .dwattr $C$DW$328, DW_AT_name("rsvd4_4")
    2401                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd4_4")
    2402                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    2403                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    2404              $C$DW$329       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$29)
    2406                      .dwattr $C$DW$329, DW_AT_name("rsvd4_5")
    2407                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_rsvd4_5")
    2408                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    2409                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    2410              $C$DW$330       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$29)
    2412                      .dwattr $C$DW$330, DW_AT_name("rsvd4_6")
    2413                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_rsvd4_6")
    2414                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    2415                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    2416              $C$DW$331       .dwtag  DW_TAG_member
    2417                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$29)
    2418                      .dwattr $C$DW$331, DW_AT_name("rsvd4_7")
    2419                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_rsvd4_7")
    2420                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2421                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    2422              $C$DW$332       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$29)
    2424                      .dwattr $C$DW$332, DW_AT_name("rsvd4_8")
    2425                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd4_8")
    2426                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   46

    2427                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$333       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$29)
    2430                      .dwattr $C$DW$333, DW_AT_name("rsvd5_1")
    2431                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_rsvd5_1")
    2432                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2433                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    2434              $C$DW$334       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$29)
    2436                      .dwattr $C$DW$334, DW_AT_name("rsvd5_2")
    2437                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_rsvd5_2")
    2438                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    2439                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$335       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$29)
    2442                      .dwattr $C$DW$335, DW_AT_name("rsvd5_3")
    2443                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_rsvd5_3")
    2444                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2445                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    2446              $C$DW$336       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$29)
    2448                      .dwattr $C$DW$336, DW_AT_name("rsvd5_4")
    2449                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_rsvd5_4")
    2450                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    2451                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    2452              $C$DW$337       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    2454                      .dwattr $C$DW$337, DW_AT_name("rsvd5_5")
    2455                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd5_5")
    2456                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2457                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$338       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$29)
    2460                      .dwattr $C$DW$338, DW_AT_name("rsvd5_6")
    2461                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_rsvd5_6")
    2462                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    2463                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$339       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$29)
    2466                      .dwattr $C$DW$339, DW_AT_name("rsvd5_7")
    2467                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_rsvd5_7")
    2468                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2469                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$340       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$29)
    2472                      .dwattr $C$DW$340, DW_AT_name("rsvd5_8")
    2473                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_rsvd5_8")
    2474                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    2475                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    2476              $C$DW$341       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$29)
    2478                      .dwattr $C$DW$341, DW_AT_name("SPIRXINTA")
    2479                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_SPIRXINTA")
    2480                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2481                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   47

    2482              $C$DW$342       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$29)
    2484                      .dwattr $C$DW$342, DW_AT_name("SPITXINTA")
    2485                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_SPITXINTA")
    2486                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    2487                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$343       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$29)
    2490                      .dwattr $C$DW$343, DW_AT_name("rsvd6_3")
    2491                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_rsvd6_3")
    2492                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    2493                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$344       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    2496                      .dwattr $C$DW$344, DW_AT_name("rsvd6_4")
    2497                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_rsvd6_4")
    2498                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    2499                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    2500              $C$DW$345       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$29)
    2502                      .dwattr $C$DW$345, DW_AT_name("rsvd6_5")
    2503                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_rsvd6_5")
    2504                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2505                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$346       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$29)
    2508                      .dwattr $C$DW$346, DW_AT_name("rsvd6_6")
    2509                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_rsvd6_6")
    2510                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    2511                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$347       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$29)
    2514                      .dwattr $C$DW$347, DW_AT_name("rsvd6_7")
    2515                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd6_7")
    2516                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2517                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$348       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$29)
    2520                      .dwattr $C$DW$348, DW_AT_name("rsvd6_8")
    2521                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_rsvd6_8")
    2522                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    2523                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$349       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$29)
    2526                      .dwattr $C$DW$349, DW_AT_name("rsvd7_1")
    2527                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_rsvd7_1")
    2528                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2529                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$350       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$29)
    2532                      .dwattr $C$DW$350, DW_AT_name("rsvd7_2")
    2533                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_rsvd7_2")
    2534                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    2535                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$351       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   48

    2537                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$29)
    2538                      .dwattr $C$DW$351, DW_AT_name("rsvd7_3")
    2539                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_rsvd7_3")
    2540                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2541                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$352       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$29)
    2544                      .dwattr $C$DW$352, DW_AT_name("rsvd7_4")
    2545                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_rsvd7_4")
    2546                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    2547                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$353       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
    2550                      .dwattr $C$DW$353, DW_AT_name("rsvd7_5")
    2551                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_rsvd7_5")
    2552                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2553                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$354       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$29)
    2556                      .dwattr $C$DW$354, DW_AT_name("rsvd7_6")
    2557                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_rsvd7_6")
    2558                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    2559                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$355       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$29)
    2562                      .dwattr $C$DW$355, DW_AT_name("rsvd7_7")
    2563                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_rsvd7_7")
    2564                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2565                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$356       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$29)
    2568                      .dwattr $C$DW$356, DW_AT_name("rsvd7_8")
    2569                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_rsvd7_8")
    2570                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    2571                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$357       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$29)
    2574                      .dwattr $C$DW$357, DW_AT_name("I2CINT1A")
    2575                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_I2CINT1A")
    2576                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2577                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$358       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$29)
    2580                      .dwattr $C$DW$358, DW_AT_name("I2CINT2A")
    2581                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_I2CINT2A")
    2582                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    2583                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$359       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$29)
    2586                      .dwattr $C$DW$359, DW_AT_name("rsvd8_3")
    2587                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_rsvd8_3")
    2588                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2589                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$360       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   49

    2592                      .dwattr $C$DW$360, DW_AT_name("rsvd8_4")
    2593                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_rsvd8_4")
    2594                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    2595                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    2596              $C$DW$361       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$29)
    2598                      .dwattr $C$DW$361, DW_AT_name("rsvd8_5")
    2599                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_rsvd8_5")
    2600                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2601                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$362       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$29)
    2604                      .dwattr $C$DW$362, DW_AT_name("rsvd8_6")
    2605                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_rsvd8_6")
    2606                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    2607                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$363       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$29)
    2610                      .dwattr $C$DW$363, DW_AT_name("rsvd8_7")
    2611                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_rsvd8_7")
    2612                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2613                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    2614              $C$DW$364       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$29)
    2616                      .dwattr $C$DW$364, DW_AT_name("rsvd8_8")
    2617                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_rsvd8_8")
    2618                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    2619                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$365       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$29)
    2622                      .dwattr $C$DW$365, DW_AT_name("SCIRXINTA")
    2623                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_SCIRXINTA")
    2624                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2625                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$366       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$29)
    2628                      .dwattr $C$DW$366, DW_AT_name("SCITXINTA")
    2629                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_SCITXINTA")
    2630                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2631                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$367       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$29)
    2634                      .dwattr $C$DW$367, DW_AT_name("rsvd9_3")
    2635                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_rsvd9_3")
    2636                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2637                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$368       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$29)
    2640                      .dwattr $C$DW$368, DW_AT_name("rsvd9_4")
    2641                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd9_4")
    2642                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2643                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$369       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$29)
    2646                      .dwattr $C$DW$369, DW_AT_name("rsvd9_5")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   50

    2647                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_rsvd9_5")
    2648                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2649                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$370       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$29)
    2652                      .dwattr $C$DW$370, DW_AT_name("rsvd9_6")
    2653                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_rsvd9_6")
    2654                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    2655                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$371       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$29)
    2658                      .dwattr $C$DW$371, DW_AT_name("rsvd9_7")
    2659                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_rsvd9_7")
    2660                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    2661                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$372       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$29)
    2664                      .dwattr $C$DW$372, DW_AT_name("rsvd9_8")
    2665                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_rsvd9_8")
    2666                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    2667                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$373       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    2670                      .dwattr $C$DW$373, DW_AT_name("ADCINT1")
    2671                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_ADCINT1")
    2672                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    2673                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$374       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$29)
    2676                      .dwattr $C$DW$374, DW_AT_name("ADCINT2")
    2677                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_ADCINT2")
    2678                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    2679                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    2680              $C$DW$375       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$29)
    2682                      .dwattr $C$DW$375, DW_AT_name("ADCINT3")
    2683                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_ADCINT3")
    2684                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    2685                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$376       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
    2688                      .dwattr $C$DW$376, DW_AT_name("ADCINT4")
    2689                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_ADCINT4")
    2690                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    2691                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    2692              $C$DW$377       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    2694                      .dwattr $C$DW$377, DW_AT_name("ADCINT5")
    2695                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_ADCINT5")
    2696                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    2697                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$378       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    2700                      .dwattr $C$DW$378, DW_AT_name("ADCINT6")
    2701                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_ADCINT6")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   51

    2702                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    2703                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$379       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$29)
    2706                      .dwattr $C$DW$379, DW_AT_name("ADCINT7")
    2707                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_ADCINT7")
    2708                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    2709                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$380       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$29)
    2712                      .dwattr $C$DW$380, DW_AT_name("ADCINT8")
    2713                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_ADCINT8")
    2714                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    2715                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$381       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$29)
    2718                      .dwattr $C$DW$381, DW_AT_name("rsvd11_1")
    2719                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_rsvd11_1")
    2720                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    2721                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$382       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$29)
    2724                      .dwattr $C$DW$382, DW_AT_name("rsvd11_2")
    2725                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_rsvd11_2")
    2726                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    2727                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$383       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$29)
    2730                      .dwattr $C$DW$383, DW_AT_name("rsvd11_3")
    2731                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_rsvd11_3")
    2732                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2733                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    2734              $C$DW$384       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$29)
    2736                      .dwattr $C$DW$384, DW_AT_name("rsvd11_4")
    2737                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_rsvd11_4")
    2738                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    2739                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    2740              $C$DW$385       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$29)
    2742                      .dwattr $C$DW$385, DW_AT_name("rsvd11_5")
    2743                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_rsvd11_5")
    2744                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
    2745                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$386       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$29)
    2748                      .dwattr $C$DW$386, DW_AT_name("rsvd11_6")
    2749                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_rsvd11_6")
    2750                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
    2751                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$387       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$29)
    2754                      .dwattr $C$DW$387, DW_AT_name("rsvd11_7")
    2755                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_rsvd11_7")
    2756                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   52

    2757                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$388       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$29)
    2760                      .dwattr $C$DW$388, DW_AT_name("rsvd11_8")
    2761                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_rsvd11_8")
    2762                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
    2763                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$389       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$29)
    2766                      .dwattr $C$DW$389, DW_AT_name("XINT3")
    2767                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_XINT3")
    2768                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2769                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$390       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$29)
    2772                      .dwattr $C$DW$390, DW_AT_name("rsvd12_2")
    2773                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_rsvd12_2")
    2774                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
    2775                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$391       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$29)
    2778                      .dwattr $C$DW$391, DW_AT_name("rsvd12_3")
    2779                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_rsvd12_3")
    2780                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    2781                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$392       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$29)
    2784                      .dwattr $C$DW$392, DW_AT_name("rsvd12_4")
    2785                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_rsvd12_4")
    2786                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
    2787                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$393       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$29)
    2790                      .dwattr $C$DW$393, DW_AT_name("rsvd12_5")
    2791                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_rsvd12_5")
    2792                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
    2793                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    2794              $C$DW$394       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    2796                      .dwattr $C$DW$394, DW_AT_name("rsvd12_6")
    2797                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_rsvd12_6")
    2798                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
    2799                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    2800              $C$DW$395       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    2802                      .dwattr $C$DW$395, DW_AT_name("rsvd12_7")
    2803                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_rsvd12_7")
    2804                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
    2805                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    2806              $C$DW$396       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$29)
    2808                      .dwattr $C$DW$396, DW_AT_name("rsvd12_8")
    2809                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_rsvd12_8")
    2810                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
    2811                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   53

    2812              $C$DW$397       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$30)
    2814                      .dwattr $C$DW$397, DW_AT_name("rsvd13")
    2815                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_rsvd13")
    2816                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    2817                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$398       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$31)
    2820                      .dwattr $C$DW$398, DW_AT_name("XINTnCR")
    2821                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_XINTnCR")
    2822                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6390]
    2823                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    2824              $C$DW$399       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$32)
    2826                      .dwattr $C$DW$399, DW_AT_name("rsvd14")
    2827                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_rsvd14")
    2828                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6393]
    2829                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    2830              $C$DW$400       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$31)
    2832                      .dwattr $C$DW$400, DW_AT_name("XINTnCTR")
    2833                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_XINTnCTR")
    2834                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6398]
    2835                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    2836                      .dwendtag $C$DW$T$33
    2837              
    2838              $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Obj")
    2839                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$33)
    2840                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    2841              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    2842                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$33)
    2843                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    2844              $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_Handle")
    2845                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    2846                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2847              $C$DW$401       .dwtag  DW_TAG_TI_far_type
    2848                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$62)
    2849              $C$DW$T$63      .dwtag  DW_TAG_const_type
    2850                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$401)
    2851              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2852                      .dwattr $C$DW$T$2, DW_AT_name("void")
    2853              $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2854                      .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2855                      .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2856              
    2857              $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2858                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2859              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    2860                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2861                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    2862              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PIE_IntVec_t")
    2863                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2864                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2865              $C$DW$402       .dwtag  DW_TAG_TI_far_type
    2866                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:14 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0864810                          PAGE   54

    2867              $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    2868                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$402)
    2869              $C$DW$403       .dwtag  DW_TAG_TI_far_type
    2870                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$28)
    2871              $C$DW$T$70      .dwtag  DW_TAG_const_type
    2872                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$403)
    2873              $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    2874                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$28)
    2875                      .dwattr $C$DW$T$71, DW_AT_address_class(0x20)
    2876              $C$DW$T$4       .dwtag  DW_TAG_base_type
    2877                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2878                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    2879                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2880              $C$DW$T$5       .dwtag  DW_TAG_base_type
    2881                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2882                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2883                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2884              $C$DW$T$6       .dwtag  DW_TAG_base_type
    2885                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2886                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2887                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
