TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:15 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../proj_lab05a.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    3908              $C$DW$627       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CTR_CMP"), DW_AT_const_value(0x80)
    3909              $C$DW$628       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CTR_PRD"), DW_AT_const_value(0x40)
    3910              $C$DW$629       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CTR_OVF"), DW_AT_const_value(0x20)
    3911              $C$DW$630       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CEVT4"), DW_AT_const_value(0x10)
    3912              $C$DW$631       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CEVT3"), DW_AT_const_value(0x08)
    3913              $C$DW$632       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CEVT2"), DW_AT_const_value(0x04)
    3914              $C$DW$633       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_CEVT1"), DW_AT_const_value(0x02)
    3915              $C$DW$634       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_Global"), DW_AT_const_value(0x01)
    3916              $C$DW$635       .dwtag  DW_TAG_enumerator, DW_AT_name("CAP_Int_Type_All"), DW_AT_const_value(0xff)
    3917                      .dwendtag $C$DW$T$260
    3918              
    3919              $C$DW$T$261     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Int_Type_e")
    3920                      .dwattr $C$DW$T$261, DW_AT_type(*$C$DW$T$260)
    3921                      .dwattr $C$DW$T$261, DW_AT_language(DW_LANG_C)
    3922              
    3923              $C$DW$T$263     .dwtag  DW_TAG_enumeration_type
    3924                      .dwattr $C$DW$T$263, DW_AT_byte_size(0x01)
    3925              $C$DW$636       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_1"), DW_AT_const_value(0x00)
    3926              $C$DW$637       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_2"), DW_AT_const_value(0x01)
    3927              $C$DW$638       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_3"), DW_AT_const_value(0x02)
    3928              $C$DW$639       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_4"), DW_AT_const_value(0x03)
    3929              $C$DW$640       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_5"), DW_AT_const_value(0x04)
    3930              $C$DW$641       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_6"), DW_AT_const_value(0x05)
    3931              $C$DW$642       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_7"), DW_AT_const_value(0x06)
    3932              $C$DW$643       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_8"), DW_AT_const_value(0x07)
    3933              $C$DW$644       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_9"), DW_AT_const_value(0x08)
    3934              $C$DW$645       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_10"), DW_AT_const_value(0x09)
    3935              $C$DW$646       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_11"), DW_AT_const_value(0x0a)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   79

    3936              $C$DW$647       .dwtag  DW_TAG_enumerator, DW_AT_name("PIE_GroupNumber_12"), DW_AT_const_value(0x0b)
    3937                      .dwendtag $C$DW$T$263
    3938              
    3939              $C$DW$T$264     .dwtag  DW_TAG_typedef, DW_AT_name("PIE_GroupNumber_e")
    3940                      .dwattr $C$DW$T$264, DW_AT_type(*$C$DW$T$263)
    3941                      .dwattr $C$DW$T$264, DW_AT_language(DW_LANG_C)
    3942              $C$DW$648       .dwtag  DW_TAG_TI_far_type
    3943                      .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$264)
    3944              $C$DW$T$265     .dwtag  DW_TAG_const_type
    3945                      .dwattr $C$DW$T$265, DW_AT_type(*$C$DW$648)
    3946              
    3947              $C$DW$T$266     .dwtag  DW_TAG_enumeration_type
    3948                      .dwattr $C$DW$T$266, DW_AT_byte_size(0x01)
    3949              $C$DW$649       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3950              $C$DW$650       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3951              $C$DW$651       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3952                      .dwendtag $C$DW$T$266
    3953              
    3954              $C$DW$T$267     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3955                      .dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$266)
    3956                      .dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
    3957              
    3958              $C$DW$T$269     .dwtag  DW_TAG_enumeration_type
    3959                      .dwattr $C$DW$T$269, DW_AT_byte_size(0x01)
    3960              $C$DW$652       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Current"), DW_AT_const_value(0x00)
    3961              $C$DW$653       .dwtag  DW_TAG_enumerator, DW_AT_name("HAL_SensorType_Voltage"), DW_AT_const_value(0x01)
    3962                      .dwendtag $C$DW$T$269
    3963              
    3964              $C$DW$T$270     .dwtag  DW_TAG_typedef, DW_AT_name("HAL_SensorType_e")
    3965                      .dwattr $C$DW$T$270, DW_AT_type(*$C$DW$T$269)
    3966                      .dwattr $C$DW$T$270, DW_AT_language(DW_LANG_C)
    3967              
    3968              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3969                      .dwattr $C$DW$T$30, DW_AT_name("_ADC_Obj_")
    3970                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x6650)
    3971              $C$DW$654       .dwtag  DW_TAG_member
    3972                      .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    3973                      .dwattr $C$DW$654, DW_AT_name("ADCRESULT")
    3974                      .dwattr $C$DW$654, DW_AT_TI_symbol_name("_ADCRESULT")
    3975                      .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3976                      .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    3977              $C$DW$655       .dwtag  DW_TAG_member
    3978                      .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$25)
    3979                      .dwattr $C$DW$655, DW_AT_name("resvd_1")
    3980                      .dwattr $C$DW$655, DW_AT_TI_symbol_name("_resvd_1")
    3981                      .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3982                      .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    3983              $C$DW$656       .dwtag  DW_TAG_member
    3984                      .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$23)
    3985                      .dwattr $C$DW$656, DW_AT_name("ADCCTL1")
    3986                      .dwattr $C$DW$656, DW_AT_TI_symbol_name("_ADCCTL1")
    3987                      .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x6600]
    3988                      .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    3989              $C$DW$657       .dwtag  DW_TAG_member
    3990                      .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   80

    3991                      .dwattr $C$DW$657, DW_AT_name("ADCCTL2")
    3992                      .dwattr $C$DW$657, DW_AT_TI_symbol_name("_ADCCTL2")
    3993                      .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x6601]
    3994                      .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$658       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$26)
    3997                      .dwattr $C$DW$658, DW_AT_name("rsvd_2")
    3998                      .dwattr $C$DW$658, DW_AT_TI_symbol_name("_rsvd_2")
    3999                      .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6602]
    4000                      .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$659       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$23)
    4003                      .dwattr $C$DW$659, DW_AT_name("ADCINTFLG")
    4004                      .dwattr $C$DW$659, DW_AT_TI_symbol_name("_ADCINTFLG")
    4005                      .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x6604]
    4006                      .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    4007              $C$DW$660       .dwtag  DW_TAG_member
    4008                      .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$23)
    4009                      .dwattr $C$DW$660, DW_AT_name("ADCINTFLGCLR")
    4010                      .dwattr $C$DW$660, DW_AT_TI_symbol_name("_ADCINTFLGCLR")
    4011                      .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x6605]
    4012                      .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    4013              $C$DW$661       .dwtag  DW_TAG_member
    4014                      .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$23)
    4015                      .dwattr $C$DW$661, DW_AT_name("ADCINTOVF")
    4016                      .dwattr $C$DW$661, DW_AT_TI_symbol_name("_ADCINTOVF")
    4017                      .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x6606]
    4018                      .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    4019              $C$DW$662       .dwtag  DW_TAG_member
    4020                      .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$23)
    4021                      .dwattr $C$DW$662, DW_AT_name("ADCINTOVFCLR")
    4022                      .dwattr $C$DW$662, DW_AT_TI_symbol_name("_ADCINTOVFCLR")
    4023                      .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x6607]
    4024                      .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    4025              $C$DW$663       .dwtag  DW_TAG_member
    4026                      .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$27)
    4027                      .dwattr $C$DW$663, DW_AT_name("INTSELxNy")
    4028                      .dwattr $C$DW$663, DW_AT_TI_symbol_name("_INTSELxNy")
    4029                      .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x6608]
    4030                      .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    4031              $C$DW$664       .dwtag  DW_TAG_member
    4032                      .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$28)
    4033                      .dwattr $C$DW$664, DW_AT_name("rsvd_3")
    4034                      .dwattr $C$DW$664, DW_AT_TI_symbol_name("_rsvd_3")
    4035                      .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x660d]
    4036                      .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    4037              $C$DW$665       .dwtag  DW_TAG_member
    4038                      .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$23)
    4039                      .dwattr $C$DW$665, DW_AT_name("SOCPRICTRL")
    4040                      .dwattr $C$DW$665, DW_AT_TI_symbol_name("_SOCPRICTRL")
    4041                      .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x6610]
    4042                      .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    4043              $C$DW$666       .dwtag  DW_TAG_member
    4044                      .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$23)
    4045                      .dwattr $C$DW$666, DW_AT_name("rsvd_4")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   81

    4046                      .dwattr $C$DW$666, DW_AT_TI_symbol_name("_rsvd_4")
    4047                      .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x6611]
    4048                      .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    4049              $C$DW$667       .dwtag  DW_TAG_member
    4050                      .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$23)
    4051                      .dwattr $C$DW$667, DW_AT_name("ADCSAMPLEMODE")
    4052                      .dwattr $C$DW$667, DW_AT_TI_symbol_name("_ADCSAMPLEMODE")
    4053                      .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x6612]
    4054                      .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    4055              $C$DW$668       .dwtag  DW_TAG_member
    4056                      .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$23)
    4057                      .dwattr $C$DW$668, DW_AT_name("rsvd_5")
    4058                      .dwattr $C$DW$668, DW_AT_TI_symbol_name("_rsvd_5")
    4059                      .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x6613]
    4060                      .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    4061              $C$DW$669       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    4063                      .dwattr $C$DW$669, DW_AT_name("ADCINTSOCSEL1")
    4064                      .dwattr $C$DW$669, DW_AT_TI_symbol_name("_ADCINTSOCSEL1")
    4065                      .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6614]
    4066                      .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    4067              $C$DW$670       .dwtag  DW_TAG_member
    4068                      .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$23)
    4069                      .dwattr $C$DW$670, DW_AT_name("ADCINTSOCSEL2")
    4070                      .dwattr $C$DW$670, DW_AT_TI_symbol_name("_ADCINTSOCSEL2")
    4071                      .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x6615]
    4072                      .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    4073              $C$DW$671       .dwtag  DW_TAG_member
    4074                      .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$26)
    4075                      .dwattr $C$DW$671, DW_AT_name("rsvd_6")
    4076                      .dwattr $C$DW$671, DW_AT_TI_symbol_name("_rsvd_6")
    4077                      .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x6616]
    4078                      .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    4079              $C$DW$672       .dwtag  DW_TAG_member
    4080                      .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$23)
    4081                      .dwattr $C$DW$672, DW_AT_name("ADCSOCFLG1")
    4082                      .dwattr $C$DW$672, DW_AT_TI_symbol_name("_ADCSOCFLG1")
    4083                      .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x6618]
    4084                      .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    4085              $C$DW$673       .dwtag  DW_TAG_member
    4086                      .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
    4087                      .dwattr $C$DW$673, DW_AT_name("rsvd_7")
    4088                      .dwattr $C$DW$673, DW_AT_TI_symbol_name("_rsvd_7")
    4089                      .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x6619]
    4090                      .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    4091              $C$DW$674       .dwtag  DW_TAG_member
    4092                      .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$23)
    4093                      .dwattr $C$DW$674, DW_AT_name("ADCSOCFRC1")
    4094                      .dwattr $C$DW$674, DW_AT_TI_symbol_name("_ADCSOCFRC1")
    4095                      .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x661a]
    4096                      .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    4097              $C$DW$675       .dwtag  DW_TAG_member
    4098                      .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$23)
    4099                      .dwattr $C$DW$675, DW_AT_name("rsvd_8")
    4100                      .dwattr $C$DW$675, DW_AT_TI_symbol_name("_rsvd_8")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   82

    4101                      .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x661b]
    4102                      .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$676       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$23)
    4105                      .dwattr $C$DW$676, DW_AT_name("ADCSOCOVF1")
    4106                      .dwattr $C$DW$676, DW_AT_TI_symbol_name("_ADCSOCOVF1")
    4107                      .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x661c]
    4108                      .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    4109              $C$DW$677       .dwtag  DW_TAG_member
    4110                      .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    4111                      .dwattr $C$DW$677, DW_AT_name("rsvd_9")
    4112                      .dwattr $C$DW$677, DW_AT_TI_symbol_name("_rsvd_9")
    4113                      .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x661d]
    4114                      .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    4115              $C$DW$678       .dwtag  DW_TAG_member
    4116                      .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$23)
    4117                      .dwattr $C$DW$678, DW_AT_name("ADCSOCOVFCLR1")
    4118                      .dwattr $C$DW$678, DW_AT_TI_symbol_name("_ADCSOCOVFCLR1")
    4119                      .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x661e]
    4120                      .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    4121              $C$DW$679       .dwtag  DW_TAG_member
    4122                      .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$23)
    4123                      .dwattr $C$DW$679, DW_AT_name("rsvd_10")
    4124                      .dwattr $C$DW$679, DW_AT_TI_symbol_name("_rsvd_10")
    4125                      .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x661f]
    4126                      .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    4127              $C$DW$680       .dwtag  DW_TAG_member
    4128                      .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$24)
    4129                      .dwattr $C$DW$680, DW_AT_name("ADCSOCxCTL")
    4130                      .dwattr $C$DW$680, DW_AT_TI_symbol_name("_ADCSOCxCTL")
    4131                      .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6620]
    4132                      .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    4133              $C$DW$681       .dwtag  DW_TAG_member
    4134                      .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$24)
    4135                      .dwattr $C$DW$681, DW_AT_name("rsvd_11")
    4136                      .dwattr $C$DW$681, DW_AT_TI_symbol_name("_rsvd_11")
    4137                      .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x6630]
    4138                      .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    4139              $C$DW$682       .dwtag  DW_TAG_member
    4140                      .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$23)
    4141                      .dwattr $C$DW$682, DW_AT_name("ADCREFTRIM")
    4142                      .dwattr $C$DW$682, DW_AT_TI_symbol_name("_ADCREFTRIM")
    4143                      .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x6640]
    4144                      .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$683       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$23)
    4147                      .dwattr $C$DW$683, DW_AT_name("ADCOFFTRIM")
    4148                      .dwattr $C$DW$683, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    4149                      .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x6641]
    4150                      .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    4151              $C$DW$684       .dwtag  DW_TAG_member
    4152                      .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$29)
    4153                      .dwattr $C$DW$684, DW_AT_name("resvd_12")
    4154                      .dwattr $C$DW$684, DW_AT_TI_symbol_name("_resvd_12")
    4155                      .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x6642]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   83

    4156                      .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    4157              $C$DW$685       .dwtag  DW_TAG_member
    4158                      .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$23)
    4159                      .dwattr $C$DW$685, DW_AT_name("ADCREV")
    4160                      .dwattr $C$DW$685, DW_AT_TI_symbol_name("_ADCREV")
    4161                      .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x664f]
    4162                      .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    4163                      .dwendtag $C$DW$T$30
    4164              
    4165              $C$DW$T$272     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Obj")
    4166                      .dwattr $C$DW$T$272, DW_AT_type(*$C$DW$T$30)
    4167                      .dwattr $C$DW$T$272, DW_AT_language(DW_LANG_C)
    4168              $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    4169                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$30)
    4170                      .dwattr $C$DW$T$157, DW_AT_address_class(0x20)
    4171              $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("ADC_Handle")
    4172                      .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
    4173                      .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    4174              
    4175              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4176                      .dwattr $C$DW$T$34, DW_AT_name("_CAP_Obj_")
    4177                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x1a)
    4178              $C$DW$686       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$32)
    4180                      .dwattr $C$DW$686, DW_AT_name("TSCTR")
    4181                      .dwattr $C$DW$686, DW_AT_TI_symbol_name("_TSCTR")
    4182                      .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4183                      .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$687       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$32)
    4186                      .dwattr $C$DW$687, DW_AT_name("CTRPHS")
    4187                      .dwattr $C$DW$687, DW_AT_TI_symbol_name("_CTRPHS")
    4188                      .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4189                      .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$688       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    4192                      .dwattr $C$DW$688, DW_AT_name("CAP1")
    4193                      .dwattr $C$DW$688, DW_AT_TI_symbol_name("_CAP1")
    4194                      .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4195                      .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$689       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    4198                      .dwattr $C$DW$689, DW_AT_name("CAP2")
    4199                      .dwattr $C$DW$689, DW_AT_TI_symbol_name("_CAP2")
    4200                      .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4201                      .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$690       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$32)
    4204                      .dwattr $C$DW$690, DW_AT_name("CAP3")
    4205                      .dwattr $C$DW$690, DW_AT_TI_symbol_name("_CAP3")
    4206                      .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4207                      .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$691       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$32)
    4210                      .dwattr $C$DW$691, DW_AT_name("CAP4")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   84

    4211                      .dwattr $C$DW$691, DW_AT_TI_symbol_name("_CAP4")
    4212                      .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4213                      .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    4214              $C$DW$692       .dwtag  DW_TAG_member
    4215                      .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$33)
    4216                      .dwattr $C$DW$692, DW_AT_name("Rsvd_1")
    4217                      .dwattr $C$DW$692, DW_AT_TI_symbol_name("_Rsvd_1")
    4218                      .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4219                      .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    4220              $C$DW$693       .dwtag  DW_TAG_member
    4221                      .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$23)
    4222                      .dwattr $C$DW$693, DW_AT_name("ECCTL1")
    4223                      .dwattr $C$DW$693, DW_AT_TI_symbol_name("_ECCTL1")
    4224                      .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4225                      .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    4226              $C$DW$694       .dwtag  DW_TAG_member
    4227                      .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$23)
    4228                      .dwattr $C$DW$694, DW_AT_name("ECCTL2")
    4229                      .dwattr $C$DW$694, DW_AT_TI_symbol_name("_ECCTL2")
    4230                      .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    4231                      .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    4232              $C$DW$695       .dwtag  DW_TAG_member
    4233                      .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$23)
    4234                      .dwattr $C$DW$695, DW_AT_name("ECEINT")
    4235                      .dwattr $C$DW$695, DW_AT_TI_symbol_name("_ECEINT")
    4236                      .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4237                      .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    4238              $C$DW$696       .dwtag  DW_TAG_member
    4239                      .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$23)
    4240                      .dwattr $C$DW$696, DW_AT_name("ECEFLG")
    4241                      .dwattr $C$DW$696, DW_AT_TI_symbol_name("_ECEFLG")
    4242                      .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    4243                      .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    4244              $C$DW$697       .dwtag  DW_TAG_member
    4245                      .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$23)
    4246                      .dwattr $C$DW$697, DW_AT_name("ECECLR")
    4247                      .dwattr $C$DW$697, DW_AT_TI_symbol_name("_ECECLR")
    4248                      .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4249                      .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$698       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$23)
    4252                      .dwattr $C$DW$698, DW_AT_name("ECEFRC")
    4253                      .dwattr $C$DW$698, DW_AT_TI_symbol_name("_ECEFRC")
    4254                      .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4255                      .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    4256                      .dwendtag $C$DW$T$34
    4257              
    4258              $C$DW$T$273     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Obj")
    4259                      .dwattr $C$DW$T$273, DW_AT_type(*$C$DW$T$34)
    4260                      .dwattr $C$DW$T$273, DW_AT_language(DW_LANG_C)
    4261              $C$DW$T$159     .dwtag  DW_TAG_pointer_type
    4262                      .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$34)
    4263                      .dwattr $C$DW$T$159, DW_AT_address_class(0x20)
    4264              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("CAP_Handle")
    4265                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   85

    4266                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    4267              
    4268              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4269                      .dwattr $C$DW$T$37, DW_AT_name("_CLARKE_Obj_")
    4270                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x06)
    4271              $C$DW$699       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$35)
    4273                      .dwattr $C$DW$699, DW_AT_name("alpha_sf")
    4274                      .dwattr $C$DW$699, DW_AT_TI_symbol_name("_alpha_sf")
    4275                      .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4276                      .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    4277              $C$DW$700       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$35)
    4279                      .dwattr $C$DW$700, DW_AT_name("beta_sf")
    4280                      .dwattr $C$DW$700, DW_AT_TI_symbol_name("_beta_sf")
    4281                      .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4282                      .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    4283              $C$DW$701       .dwtag  DW_TAG_member
    4284                      .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$36)
    4285                      .dwattr $C$DW$701, DW_AT_name("numSensors")
    4286                      .dwattr $C$DW$701, DW_AT_TI_symbol_name("_numSensors")
    4287                      .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4288                      .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    4289                      .dwendtag $C$DW$T$37
    4290              
    4291              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    4292                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$37)
    4293                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4294              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4295                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$37)
    4296                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    4297              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    4298                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4299                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4300              
    4301              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4302                      .dwattr $C$DW$T$38, DW_AT_name("_CLK_Obj_")
    4303                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x11)
    4304              $C$DW$702       .dwtag  DW_TAG_member
    4305                      .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$23)
    4306                      .dwattr $C$DW$702, DW_AT_name("XCLK")
    4307                      .dwattr $C$DW$702, DW_AT_TI_symbol_name("_XCLK")
    4308                      .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4309                      .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    4310              $C$DW$703       .dwtag  DW_TAG_member
    4311                      .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$23)
    4312                      .dwattr $C$DW$703, DW_AT_name("rsvd_1")
    4313                      .dwattr $C$DW$703, DW_AT_TI_symbol_name("_rsvd_1")
    4314                      .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4315                      .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    4316              $C$DW$704       .dwtag  DW_TAG_member
    4317                      .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$23)
    4318                      .dwattr $C$DW$704, DW_AT_name("CLKCTL")
    4319                      .dwattr $C$DW$704, DW_AT_TI_symbol_name("_CLKCTL")
    4320                      .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   86

    4321                      .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    4322              $C$DW$705       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$33)
    4324                      .dwattr $C$DW$705, DW_AT_name("rsvd_2")
    4325                      .dwattr $C$DW$705, DW_AT_TI_symbol_name("_rsvd_2")
    4326                      .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4327                      .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$706       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$23)
    4330                      .dwattr $C$DW$706, DW_AT_name("LOSPCP")
    4331                      .dwattr $C$DW$706, DW_AT_TI_symbol_name("_LOSPCP")
    4332                      .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4333                      .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    4334              $C$DW$707       .dwtag  DW_TAG_member
    4335                      .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$23)
    4336                      .dwattr $C$DW$707, DW_AT_name("PCLKCR0")
    4337                      .dwattr $C$DW$707, DW_AT_TI_symbol_name("_PCLKCR0")
    4338                      .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4339                      .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    4340              $C$DW$708       .dwtag  DW_TAG_member
    4341                      .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$23)
    4342                      .dwattr $C$DW$708, DW_AT_name("PCLKCR1")
    4343                      .dwattr $C$DW$708, DW_AT_TI_symbol_name("_PCLKCR1")
    4344                      .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4345                      .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    4346              $C$DW$709       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$26)
    4348                      .dwattr $C$DW$709, DW_AT_name("rsvd_3")
    4349                      .dwattr $C$DW$709, DW_AT_TI_symbol_name("_rsvd_3")
    4350                      .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4351                      .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    4352              $C$DW$710       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$23)
    4354                      .dwattr $C$DW$710, DW_AT_name("PCLKCR3")
    4355                      .dwattr $C$DW$710, DW_AT_TI_symbol_name("_PCLKCR3")
    4356                      .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4357                      .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    4358                      .dwendtag $C$DW$T$38
    4359              
    4360              $C$DW$T$161     .dwtag  DW_TAG_pointer_type
    4361                      .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$38)
    4362                      .dwattr $C$DW$T$161, DW_AT_address_class(0x20)
    4363              $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("CLK_Handle")
    4364                      .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    4365                      .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    4366              
    4367              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4368                      .dwattr $C$DW$T$39, DW_AT_name("_CPU_Obj_")
    4369                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4370              $C$DW$711       .dwtag  DW_TAG_member
    4371                      .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$36)
    4372                      .dwattr $C$DW$711, DW_AT_name("tmp")
    4373                      .dwattr $C$DW$711, DW_AT_TI_symbol_name("_tmp")
    4374                      .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4375                      .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   87

    4376                      .dwendtag $C$DW$T$39
    4377              
    4378              $C$DW$T$163     .dwtag  DW_TAG_pointer_type
    4379                      .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$39)
    4380                      .dwattr $C$DW$T$163, DW_AT_address_class(0x20)
    4381              $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("CPU_Handle")
    4382                      .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$163)
    4383                      .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    4384              
    4385              $C$DW$T$72      .dwtag  DW_TAG_structure_type
    4386                      .dwattr $C$DW$T$72, DW_AT_name("_CTRL_Obj_")
    4387                      .dwattr $C$DW$T$72, DW_AT_byte_size(0x108)
    4388              $C$DW$712       .dwtag  DW_TAG_member
    4389                      .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$40)
    4390                      .dwattr $C$DW$712, DW_AT_name("version")
    4391                      .dwattr $C$DW$712, DW_AT_TI_symbol_name("_version")
    4392                      .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4393                      .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    4394              $C$DW$713       .dwtag  DW_TAG_member
    4395                      .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$42)
    4396                      .dwattr $C$DW$713, DW_AT_name("state")
    4397                      .dwattr $C$DW$713, DW_AT_TI_symbol_name("_state")
    4398                      .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4399                      .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    4400              $C$DW$714       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$42)
    4402                      .dwattr $C$DW$714, DW_AT_name("prevState")
    4403                      .dwattr $C$DW$714, DW_AT_TI_symbol_name("_prevState")
    4404                      .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4405                      .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    4406              $C$DW$715       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$44)
    4408                      .dwattr $C$DW$715, DW_AT_name("errorCode")
    4409                      .dwattr $C$DW$715, DW_AT_TI_symbol_name("_errorCode")
    4410                      .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4411                      .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    4412              $C$DW$716       .dwtag  DW_TAG_member
    4413                      .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$46)
    4414                      .dwattr $C$DW$716, DW_AT_name("clarkeHandle_I")
    4415                      .dwattr $C$DW$716, DW_AT_TI_symbol_name("_clarkeHandle_I")
    4416                      .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4417                      .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    4418              $C$DW$717       .dwtag  DW_TAG_member
    4419                      .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$47)
    4420                      .dwattr $C$DW$717, DW_AT_name("clarke_I")
    4421                      .dwattr $C$DW$717, DW_AT_TI_symbol_name("_clarke_I")
    4422                      .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4423                      .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$718       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$46)
    4426                      .dwattr $C$DW$718, DW_AT_name("clarkeHandle_V")
    4427                      .dwattr $C$DW$718, DW_AT_TI_symbol_name("_clarkeHandle_V")
    4428                      .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4429                      .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    4430              $C$DW$719       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   88

    4431                      .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$47)
    4432                      .dwattr $C$DW$719, DW_AT_name("clarke_V")
    4433                      .dwattr $C$DW$719, DW_AT_TI_symbol_name("_clarke_V")
    4434                      .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4435                      .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    4436              $C$DW$720       .dwtag  DW_TAG_member
    4437                      .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$49)
    4438                      .dwattr $C$DW$720, DW_AT_name("estHandle")
    4439                      .dwattr $C$DW$720, DW_AT_TI_symbol_name("_estHandle")
    4440                      .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4441                      .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    4442              $C$DW$721       .dwtag  DW_TAG_member
    4443                      .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$51)
    4444                      .dwattr $C$DW$721, DW_AT_name("parkHandle")
    4445                      .dwattr $C$DW$721, DW_AT_TI_symbol_name("_parkHandle")
    4446                      .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4447                      .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    4448              $C$DW$722       .dwtag  DW_TAG_member
    4449                      .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$52)
    4450                      .dwattr $C$DW$722, DW_AT_name("park")
    4451                      .dwattr $C$DW$722, DW_AT_TI_symbol_name("_park")
    4452                      .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4453                      .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    4454              $C$DW$723       .dwtag  DW_TAG_member
    4455                      .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$54)
    4456                      .dwattr $C$DW$723, DW_AT_name("pidHandle_Id")
    4457                      .dwattr $C$DW$723, DW_AT_TI_symbol_name("_pidHandle_Id")
    4458                      .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4459                      .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    4460              $C$DW$724       .dwtag  DW_TAG_member
    4461                      .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$55)
    4462                      .dwattr $C$DW$724, DW_AT_name("pid_Id")
    4463                      .dwattr $C$DW$724, DW_AT_TI_symbol_name("_pid_Id")
    4464                      .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4465                      .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$725       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$54)
    4468                      .dwattr $C$DW$725, DW_AT_name("pidHandle_Iq")
    4469                      .dwattr $C$DW$725, DW_AT_TI_symbol_name("_pidHandle_Iq")
    4470                      .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4471                      .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    4472              $C$DW$726       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$55)
    4474                      .dwattr $C$DW$726, DW_AT_name("pid_Iq")
    4475                      .dwattr $C$DW$726, DW_AT_TI_symbol_name("_pid_Iq")
    4476                      .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4477                      .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    4478              $C$DW$727       .dwtag  DW_TAG_member
    4479                      .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$54)
    4480                      .dwattr $C$DW$727, DW_AT_name("pidHandle_spd")
    4481                      .dwattr $C$DW$727, DW_AT_TI_symbol_name("_pidHandle_spd")
    4482                      .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4483                      .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    4484              $C$DW$728       .dwtag  DW_TAG_member
    4485                      .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   89

    4486                      .dwattr $C$DW$728, DW_AT_name("pid_spd")
    4487                      .dwattr $C$DW$728, DW_AT_TI_symbol_name("_pid_spd")
    4488                      .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4489                      .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    4490              $C$DW$729       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$57)
    4492                      .dwattr $C$DW$729, DW_AT_name("iparkHandle")
    4493                      .dwattr $C$DW$729, DW_AT_TI_symbol_name("_iparkHandle")
    4494                      .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    4495                      .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    4496              $C$DW$730       .dwtag  DW_TAG_member
    4497                      .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$58)
    4498                      .dwattr $C$DW$730, DW_AT_name("ipark")
    4499                      .dwattr $C$DW$730, DW_AT_TI_symbol_name("_ipark")
    4500                      .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    4501                      .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    4502              $C$DW$731       .dwtag  DW_TAG_member
    4503                      .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$60)
    4504                      .dwattr $C$DW$731, DW_AT_name("svgenHandle")
    4505                      .dwattr $C$DW$731, DW_AT_TI_symbol_name("_svgenHandle")
    4506                      .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4507                      .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    4508              $C$DW$732       .dwtag  DW_TAG_member
    4509                      .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$61)
    4510                      .dwattr $C$DW$732, DW_AT_name("svgen")
    4511                      .dwattr $C$DW$732, DW_AT_TI_symbol_name("_svgen")
    4512                      .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    4513                      .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    4514              $C$DW$733       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$63)
    4516                      .dwattr $C$DW$733, DW_AT_name("trajHandle_Id")
    4517                      .dwattr $C$DW$733, DW_AT_TI_symbol_name("_trajHandle_Id")
    4518                      .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    4519                      .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    4520              $C$DW$734       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$64)
    4522                      .dwattr $C$DW$734, DW_AT_name("traj_Id")
    4523                      .dwattr $C$DW$734, DW_AT_TI_symbol_name("_traj_Id")
    4524                      .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    4525                      .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    4526              $C$DW$735       .dwtag  DW_TAG_member
    4527                      .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$63)
    4528                      .dwattr $C$DW$735, DW_AT_name("trajHandle_spd")
    4529                      .dwattr $C$DW$735, DW_AT_TI_symbol_name("_trajHandle_spd")
    4530                      .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4531                      .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    4532              $C$DW$736       .dwtag  DW_TAG_member
    4533                      .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$64)
    4534                      .dwattr $C$DW$736, DW_AT_name("traj_spd")
    4535                      .dwattr $C$DW$736, DW_AT_TI_symbol_name("_traj_spd")
    4536                      .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    4537                      .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$737       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$63)
    4540                      .dwattr $C$DW$737, DW_AT_name("trajHandle_spdMax")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   90

    4541                      .dwattr $C$DW$737, DW_AT_TI_symbol_name("_trajHandle_spdMax")
    4542                      .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4543                      .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    4544              $C$DW$738       .dwtag  DW_TAG_member
    4545                      .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$64)
    4546                      .dwattr $C$DW$738, DW_AT_name("traj_spdMax")
    4547                      .dwattr $C$DW$738, DW_AT_TI_symbol_name("_traj_spdMax")
    4548                      .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    4549                      .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    4550              $C$DW$739       .dwtag  DW_TAG_member
    4551                      .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$65)
    4552                      .dwattr $C$DW$739, DW_AT_name("motorParams")
    4553                      .dwattr $C$DW$739, DW_AT_TI_symbol_name("_motorParams")
    4554                      .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    4555                      .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$740       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$67)
    4558                      .dwattr $C$DW$740, DW_AT_name("waitTimes")
    4559                      .dwattr $C$DW$740, DW_AT_TI_symbol_name("_waitTimes")
    4560                      .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    4561                      .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    4562              $C$DW$741       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$66)
    4564                      .dwattr $C$DW$741, DW_AT_name("counter_state")
    4565                      .dwattr $C$DW$741, DW_AT_TI_symbol_name("_counter_state")
    4566                      .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    4567                      .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    4568              $C$DW$742       .dwtag  DW_TAG_member
    4569                      .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$68)
    4570                      .dwattr $C$DW$742, DW_AT_name("numIsrTicksPerCtrlTick")
    4571                      .dwattr $C$DW$742, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    4572                      .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    4573                      .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    4574              $C$DW$743       .dwtag  DW_TAG_member
    4575                      .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$68)
    4576                      .dwattr $C$DW$743, DW_AT_name("numCtrlTicksPerCurrentTick")
    4577                      .dwattr $C$DW$743, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    4578                      .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    4579                      .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$744       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$68)
    4582                      .dwattr $C$DW$744, DW_AT_name("numCtrlTicksPerSpeedTick")
    4583                      .dwattr $C$DW$744, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    4584                      .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    4585                      .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    4586              $C$DW$745       .dwtag  DW_TAG_member
    4587                      .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$68)
    4588                      .dwattr $C$DW$745, DW_AT_name("numCtrlTicksPerTrajTick")
    4589                      .dwattr $C$DW$745, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    4590                      .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    4591                      .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    4592              $C$DW$746       .dwtag  DW_TAG_member
    4593                      .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$66)
    4594                      .dwattr $C$DW$746, DW_AT_name("ctrlFreq_Hz")
    4595                      .dwattr $C$DW$746, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   91

    4596                      .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    4597                      .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$747       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$66)
    4600                      .dwattr $C$DW$747, DW_AT_name("trajFreq_Hz")
    4601                      .dwattr $C$DW$747, DW_AT_TI_symbol_name("_trajFreq_Hz")
    4602                      .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    4603                      .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    4604              $C$DW$748       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$35)
    4606                      .dwattr $C$DW$748, DW_AT_name("trajPeriod_sec")
    4607                      .dwattr $C$DW$748, DW_AT_TI_symbol_name("_trajPeriod_sec")
    4608                      .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4609                      .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    4610              $C$DW$749       .dwtag  DW_TAG_member
    4611                      .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$69)
    4612                      .dwattr $C$DW$749, DW_AT_name("ctrlPeriod_sec")
    4613                      .dwattr $C$DW$749, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    4614                      .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    4615                      .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    4616              $C$DW$750       .dwtag  DW_TAG_member
    4617                      .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$35)
    4618                      .dwattr $C$DW$750, DW_AT_name("maxVsMag_pu")
    4619                      .dwattr $C$DW$750, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4620                      .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4621                      .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    4622              $C$DW$751       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$70)
    4624                      .dwattr $C$DW$751, DW_AT_name("Iab_in")
    4625                      .dwattr $C$DW$751, DW_AT_TI_symbol_name("_Iab_in")
    4626                      .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    4627                      .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    4628              $C$DW$752       .dwtag  DW_TAG_member
    4629                      .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$70)
    4630                      .dwattr $C$DW$752, DW_AT_name("Iab_filt")
    4631                      .dwattr $C$DW$752, DW_AT_TI_symbol_name("_Iab_filt")
    4632                      .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    4633                      .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    4634              $C$DW$753       .dwtag  DW_TAG_member
    4635                      .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$70)
    4636                      .dwattr $C$DW$753, DW_AT_name("Idq_in")
    4637                      .dwattr $C$DW$753, DW_AT_TI_symbol_name("_Idq_in")
    4638                      .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    4639                      .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$754       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$70)
    4642                      .dwattr $C$DW$754, DW_AT_name("Vab_in")
    4643                      .dwattr $C$DW$754, DW_AT_TI_symbol_name("_Vab_in")
    4644                      .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    4645                      .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    4646              $C$DW$755       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$35)
    4648                      .dwattr $C$DW$755, DW_AT_name("spd_out")
    4649                      .dwattr $C$DW$755, DW_AT_TI_symbol_name("_spd_out")
    4650                      .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   92

    4651                      .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    4652              $C$DW$756       .dwtag  DW_TAG_member
    4653                      .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$70)
    4654                      .dwattr $C$DW$756, DW_AT_name("Vab_out")
    4655                      .dwattr $C$DW$756, DW_AT_TI_symbol_name("_Vab_out")
    4656                      .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    4657                      .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    4658              $C$DW$757       .dwtag  DW_TAG_member
    4659                      .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$70)
    4660                      .dwattr $C$DW$757, DW_AT_name("Vdq_out")
    4661                      .dwattr $C$DW$757, DW_AT_TI_symbol_name("_Vdq_out")
    4662                      .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    4663                      .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    4664              $C$DW$758       .dwtag  DW_TAG_member
    4665                      .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$69)
    4666                      .dwattr $C$DW$758, DW_AT_name("Rhf")
    4667                      .dwattr $C$DW$758, DW_AT_TI_symbol_name("_Rhf")
    4668                      .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    4669                      .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    4670              $C$DW$759       .dwtag  DW_TAG_member
    4671                      .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$69)
    4672                      .dwattr $C$DW$759, DW_AT_name("Lhf")
    4673                      .dwattr $C$DW$759, DW_AT_TI_symbol_name("_Lhf")
    4674                      .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    4675                      .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    4676              $C$DW$760       .dwtag  DW_TAG_member
    4677                      .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$69)
    4678                      .dwattr $C$DW$760, DW_AT_name("RoverL")
    4679                      .dwattr $C$DW$760, DW_AT_TI_symbol_name("_RoverL")
    4680                      .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    4681                      .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    4682              $C$DW$761       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$35)
    4684                      .dwattr $C$DW$761, DW_AT_name("Kp_Id")
    4685                      .dwattr $C$DW$761, DW_AT_TI_symbol_name("_Kp_Id")
    4686                      .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    4687                      .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    4688              $C$DW$762       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$35)
    4690                      .dwattr $C$DW$762, DW_AT_name("Kp_Iq")
    4691                      .dwattr $C$DW$762, DW_AT_TI_symbol_name("_Kp_Iq")
    4692                      .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4693                      .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    4694              $C$DW$763       .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$35)
    4696                      .dwattr $C$DW$763, DW_AT_name("Kp_spd")
    4697                      .dwattr $C$DW$763, DW_AT_TI_symbol_name("_Kp_spd")
    4698                      .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    4699                      .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    4700              $C$DW$764       .dwtag  DW_TAG_member
    4701                      .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$35)
    4702                      .dwattr $C$DW$764, DW_AT_name("Ki_Id")
    4703                      .dwattr $C$DW$764, DW_AT_TI_symbol_name("_Ki_Id")
    4704                      .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    4705                      .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   93

    4706              $C$DW$765       .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$35)
    4708                      .dwattr $C$DW$765, DW_AT_name("Ki_Iq")
    4709                      .dwattr $C$DW$765, DW_AT_TI_symbol_name("_Ki_Iq")
    4710                      .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    4711                      .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    4712              $C$DW$766       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$35)
    4714                      .dwattr $C$DW$766, DW_AT_name("Ki_spd")
    4715                      .dwattr $C$DW$766, DW_AT_TI_symbol_name("_Ki_spd")
    4716                      .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    4717                      .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    4718              $C$DW$767       .dwtag  DW_TAG_member
    4719                      .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$35)
    4720                      .dwattr $C$DW$767, DW_AT_name("Kd_Id")
    4721                      .dwattr $C$DW$767, DW_AT_TI_symbol_name("_Kd_Id")
    4722                      .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    4723                      .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    4724              $C$DW$768       .dwtag  DW_TAG_member
    4725                      .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$35)
    4726                      .dwattr $C$DW$768, DW_AT_name("Kd_Iq")
    4727                      .dwattr $C$DW$768, DW_AT_TI_symbol_name("_Kd_Iq")
    4728                      .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    4729                      .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$769       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$35)
    4732                      .dwattr $C$DW$769, DW_AT_name("Kd_spd")
    4733                      .dwattr $C$DW$769, DW_AT_TI_symbol_name("_Kd_spd")
    4734                      .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    4735                      .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    4736              $C$DW$770       .dwtag  DW_TAG_member
    4737                      .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$35)
    4738                      .dwattr $C$DW$770, DW_AT_name("Ui_Id")
    4739                      .dwattr $C$DW$770, DW_AT_TI_symbol_name("_Ui_Id")
    4740                      .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    4741                      .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    4742              $C$DW$771       .dwtag  DW_TAG_member
    4743                      .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$35)
    4744                      .dwattr $C$DW$771, DW_AT_name("Ui_Iq")
    4745                      .dwattr $C$DW$771, DW_AT_TI_symbol_name("_Ui_Iq")
    4746                      .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    4747                      .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    4748              $C$DW$772       .dwtag  DW_TAG_member
    4749                      .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$35)
    4750                      .dwattr $C$DW$772, DW_AT_name("Ui_spd")
    4751                      .dwattr $C$DW$772, DW_AT_TI_symbol_name("_Ui_spd")
    4752                      .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    4753                      .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    4754              $C$DW$773       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$70)
    4756                      .dwattr $C$DW$773, DW_AT_name("Idq_ref")
    4757                      .dwattr $C$DW$773, DW_AT_TI_symbol_name("_Idq_ref")
    4758                      .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    4759                      .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    4760              $C$DW$774       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   94

    4761                      .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$35)
    4762                      .dwattr $C$DW$774, DW_AT_name("IdRated")
    4763                      .dwattr $C$DW$774, DW_AT_TI_symbol_name("_IdRated")
    4764                      .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    4765                      .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    4766              $C$DW$775       .dwtag  DW_TAG_member
    4767                      .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
    4768                      .dwattr $C$DW$775, DW_AT_name("spd_ref")
    4769                      .dwattr $C$DW$775, DW_AT_TI_symbol_name("_spd_ref")
    4770                      .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    4771                      .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$776       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$35)
    4774                      .dwattr $C$DW$776, DW_AT_name("spd_max")
    4775                      .dwattr $C$DW$776, DW_AT_TI_symbol_name("_spd_max")
    4776                      .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    4777                      .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    4778              $C$DW$777       .dwtag  DW_TAG_member
    4779                      .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$68)
    4780                      .dwattr $C$DW$777, DW_AT_name("counter_current")
    4781                      .dwattr $C$DW$777, DW_AT_TI_symbol_name("_counter_current")
    4782                      .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    4783                      .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    4784              $C$DW$778       .dwtag  DW_TAG_member
    4785                      .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$68)
    4786                      .dwattr $C$DW$778, DW_AT_name("counter_isr")
    4787                      .dwattr $C$DW$778, DW_AT_TI_symbol_name("_counter_isr")
    4788                      .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    4789                      .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    4790              $C$DW$779       .dwtag  DW_TAG_member
    4791                      .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$68)
    4792                      .dwattr $C$DW$779, DW_AT_name("counter_speed")
    4793                      .dwattr $C$DW$779, DW_AT_TI_symbol_name("_counter_speed")
    4794                      .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    4795                      .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    4796              $C$DW$780       .dwtag  DW_TAG_member
    4797                      .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$68)
    4798                      .dwattr $C$DW$780, DW_AT_name("counter_traj")
    4799                      .dwattr $C$DW$780, DW_AT_TI_symbol_name("_counter_traj")
    4800                      .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    4801                      .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    4802              $C$DW$781       .dwtag  DW_TAG_member
    4803                      .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$71)
    4804                      .dwattr $C$DW$781, DW_AT_name("flag_enableCtrl")
    4805                      .dwattr $C$DW$781, DW_AT_TI_symbol_name("_flag_enableCtrl")
    4806                      .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    4807                      .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    4808              $C$DW$782       .dwtag  DW_TAG_member
    4809                      .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$71)
    4810                      .dwattr $C$DW$782, DW_AT_name("flag_enableDcBusComp")
    4811                      .dwattr $C$DW$782, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    4812                      .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    4813                      .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    4814              $C$DW$783       .dwtag  DW_TAG_member
    4815                      .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   95

    4816                      .dwattr $C$DW$783, DW_AT_name("flag_enablePowerWarp")
    4817                      .dwattr $C$DW$783, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    4818                      .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    4819                      .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    4820              $C$DW$784       .dwtag  DW_TAG_member
    4821                      .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$71)
    4822                      .dwattr $C$DW$784, DW_AT_name("flag_enableOffset")
    4823                      .dwattr $C$DW$784, DW_AT_TI_symbol_name("_flag_enableOffset")
    4824                      .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    4825                      .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    4826              $C$DW$785       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$71)
    4828                      .dwattr $C$DW$785, DW_AT_name("flag_enableSpeedCtrl")
    4829                      .dwattr $C$DW$785, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    4830                      .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    4831                      .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    4832              $C$DW$786       .dwtag  DW_TAG_member
    4833                      .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$71)
    4834                      .dwattr $C$DW$786, DW_AT_name("flag_enableUserMotorParams")
    4835                      .dwattr $C$DW$786, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    4836                      .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    4837                      .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    4838              $C$DW$787       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$70)
    4840                      .dwattr $C$DW$787, DW_AT_name("Idq_offset_pu")
    4841                      .dwattr $C$DW$787, DW_AT_TI_symbol_name("_Idq_offset_pu")
    4842                      .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    4843                      .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    4844              $C$DW$788       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$70)
    4846                      .dwattr $C$DW$788, DW_AT_name("Vdq_offset_pu")
    4847                      .dwattr $C$DW$788, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    4848                      .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    4849                      .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    4850              $C$DW$789       .dwtag  DW_TAG_member
    4851                      .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$35)
    4852                      .dwattr $C$DW$789, DW_AT_name("angle_pu")
    4853                      .dwattr $C$DW$789, DW_AT_TI_symbol_name("_angle_pu")
    4854                      .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    4855                      .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    4856              $C$DW$790       .dwtag  DW_TAG_member
    4857                      .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$35)
    4858                      .dwattr $C$DW$790, DW_AT_name("speed_ref_pu")
    4859                      .dwattr $C$DW$790, DW_AT_TI_symbol_name("_speed_ref_pu")
    4860                      .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    4861                      .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    4862              $C$DW$791       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$35)
    4864                      .dwattr $C$DW$791, DW_AT_name("speed_fb_pu")
    4865                      .dwattr $C$DW$791, DW_AT_TI_symbol_name("_speed_fb_pu")
    4866                      .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    4867                      .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    4868              $C$DW$792       .dwtag  DW_TAG_member
    4869                      .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$35)
    4870                      .dwattr $C$DW$792, DW_AT_name("speed_outMax_pu")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   96

    4871                      .dwattr $C$DW$792, DW_AT_TI_symbol_name("_speed_outMax_pu")
    4872                      .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    4873                      .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    4874              $C$DW$793       .dwtag  DW_TAG_member
    4875                      .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$71)
    4876                      .dwattr $C$DW$793, DW_AT_name("flag_enableCurrentCtrl")
    4877                      .dwattr $C$DW$793, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    4878                      .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    4879                      .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    4880                      .dwendtag $C$DW$T$72
    4881              
    4882              $C$DW$T$274     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    4883                      .dwattr $C$DW$T$274, DW_AT_type(*$C$DW$T$72)
    4884                      .dwattr $C$DW$T$274, DW_AT_language(DW_LANG_C)
    4885              $C$DW$T$275     .dwtag  DW_TAG_pointer_type
    4886                      .dwattr $C$DW$T$275, DW_AT_type(*$C$DW$T$274)
    4887                      .dwattr $C$DW$T$275, DW_AT_address_class(0x20)
    4888              $C$DW$T$242     .dwtag  DW_TAG_pointer_type
    4889                      .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$72)
    4890                      .dwattr $C$DW$T$242, DW_AT_address_class(0x20)
    4891              $C$DW$T$243     .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    4892                      .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    4893                      .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    4894              $C$DW$794       .dwtag  DW_TAG_TI_far_type
    4895                      .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$243)
    4896              $C$DW$T$276     .dwtag  DW_TAG_const_type
    4897                      .dwattr $C$DW$T$276, DW_AT_type(*$C$DW$794)
    4898              
    4899              $C$DW$T$75      .dwtag  DW_TAG_structure_type
    4900                      .dwattr $C$DW$T$75, DW_AT_name("_CTRL_Version_")
    4901                      .dwattr $C$DW$T$75, DW_AT_byte_size(0x04)
    4902              $C$DW$795       .dwtag  DW_TAG_member
    4903                      .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$22)
    4904                      .dwattr $C$DW$795, DW_AT_name("rsvd")
    4905                      .dwattr $C$DW$795, DW_AT_TI_symbol_name("_rsvd")
    4906                      .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4907                      .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    4908              $C$DW$796       .dwtag  DW_TAG_member
    4909                      .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$74)
    4910                      .dwattr $C$DW$796, DW_AT_name("targetProc")
    4911                      .dwattr $C$DW$796, DW_AT_TI_symbol_name("_targetProc")
    4912                      .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4913                      .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    4914              $C$DW$797       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$22)
    4916                      .dwattr $C$DW$797, DW_AT_name("major")
    4917                      .dwattr $C$DW$797, DW_AT_TI_symbol_name("_major")
    4918                      .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4919                      .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    4920              $C$DW$798       .dwtag  DW_TAG_member
    4921                      .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$22)
    4922                      .dwattr $C$DW$798, DW_AT_name("minor")
    4923                      .dwattr $C$DW$798, DW_AT_TI_symbol_name("_minor")
    4924                      .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4925                      .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   97

    4926                      .dwendtag $C$DW$T$75
    4927              
    4928              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    4929                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$75)
    4930                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    4931              $C$DW$T$284     .dwtag  DW_TAG_pointer_type
    4932                      .dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$40)
    4933                      .dwattr $C$DW$T$284, DW_AT_address_class(0x20)
    4934              
    4935              $C$DW$T$82      .dwtag  DW_TAG_structure_type
    4936                      .dwattr $C$DW$T$82, DW_AT_name("_DRV8305_Obj_")
    4937                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x08)
    4938              $C$DW$799       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$77)
    4940                      .dwattr $C$DW$799, DW_AT_name("spiHandle")
    4941                      .dwattr $C$DW$799, DW_AT_TI_symbol_name("_spiHandle")
    4942                      .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4943                      .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    4944              $C$DW$800       .dwtag  DW_TAG_member
    4945                      .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$79)
    4946                      .dwattr $C$DW$800, DW_AT_name("gpioHandle")
    4947                      .dwattr $C$DW$800, DW_AT_TI_symbol_name("_gpioHandle")
    4948                      .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4949                      .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    4950              $C$DW$801       .dwtag  DW_TAG_member
    4951                      .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$81)
    4952                      .dwattr $C$DW$801, DW_AT_name("gpioNumber")
    4953                      .dwattr $C$DW$801, DW_AT_TI_symbol_name("_gpioNumber")
    4954                      .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4955                      .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    4956              $C$DW$802       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$71)
    4958                      .dwattr $C$DW$802, DW_AT_name("RxTimeOut")
    4959                      .dwattr $C$DW$802, DW_AT_TI_symbol_name("_RxTimeOut")
    4960                      .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4961                      .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    4962              $C$DW$803       .dwtag  DW_TAG_member
    4963                      .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$71)
    4964                      .dwattr $C$DW$803, DW_AT_name("enableTimeOut")
    4965                      .dwattr $C$DW$803, DW_AT_TI_symbol_name("_enableTimeOut")
    4966                      .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4967                      .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    4968                      .dwendtag $C$DW$T$82
    4969              
    4970              $C$DW$T$194     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Obj")
    4971                      .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$82)
    4972                      .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    4973              $C$DW$T$192     .dwtag  DW_TAG_pointer_type
    4974                      .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$82)
    4975                      .dwattr $C$DW$T$192, DW_AT_address_class(0x20)
    4976              $C$DW$T$193     .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Handle")
    4977                      .dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$192)
    4978                      .dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
    4979              
    4980              $C$DW$T$89      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   98

    4981                      .dwattr $C$DW$T$89, DW_AT_name("_DRV_SPI_8305_Ctrl05_t_")
    4982                      .dwattr $C$DW$T$89, DW_AT_byte_size(0x04)
    4983              $C$DW$804       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$84)
    4985                      .dwattr $C$DW$804, DW_AT_name("IDRIVEP_HS")
    4986                      .dwattr $C$DW$804, DW_AT_TI_symbol_name("_IDRIVEP_HS")
    4987                      .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4988                      .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    4989              $C$DW$805       .dwtag  DW_TAG_member
    4990                      .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$86)
    4991                      .dwattr $C$DW$805, DW_AT_name("IDRIVEN_HS")
    4992                      .dwattr $C$DW$805, DW_AT_TI_symbol_name("_IDRIVEN_HS")
    4993                      .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4994                      .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    4995              $C$DW$806       .dwtag  DW_TAG_member
    4996                      .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$88)
    4997                      .dwattr $C$DW$806, DW_AT_name("TDRIVEN")
    4998                      .dwattr $C$DW$806, DW_AT_TI_symbol_name("_TDRIVEN")
    4999                      .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5000                      .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$807       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$71)
    5003                      .dwattr $C$DW$807, DW_AT_name("CTRL05_RSV1")
    5004                      .dwattr $C$DW$807, DW_AT_TI_symbol_name("_CTRL05_RSV1")
    5005                      .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5006                      .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    5007                      .dwendtag $C$DW$T$89
    5008              
    5009              $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl05_t_")
    5010                      .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$89)
    5011                      .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    5012              
    5013              $C$DW$T$96      .dwtag  DW_TAG_structure_type
    5014                      .dwattr $C$DW$T$96, DW_AT_name("_DRV_SPI_8305_Ctrl06_t_")
    5015                      .dwattr $C$DW$T$96, DW_AT_byte_size(0x04)
    5016              $C$DW$808       .dwtag  DW_TAG_member
    5017                      .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$91)
    5018                      .dwattr $C$DW$808, DW_AT_name("IDRIVEP_LS")
    5019                      .dwattr $C$DW$808, DW_AT_TI_symbol_name("_IDRIVEP_LS")
    5020                      .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$809       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$93)
    5024                      .dwattr $C$DW$809, DW_AT_name("IDRIVEN_LS")
    5025                      .dwattr $C$DW$809, DW_AT_TI_symbol_name("_IDRIVEN_LS")
    5026                      .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5027                      .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    5028              $C$DW$810       .dwtag  DW_TAG_member
    5029                      .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$95)
    5030                      .dwattr $C$DW$810, DW_AT_name("TDRIVEP")
    5031                      .dwattr $C$DW$810, DW_AT_TI_symbol_name("_TDRIVEP")
    5032                      .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5033                      .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    5034              $C$DW$811       .dwtag  DW_TAG_member
    5035                      .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$71)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE   99

    5036                      .dwattr $C$DW$811, DW_AT_name("CTRL06_RSV1")
    5037                      .dwattr $C$DW$811, DW_AT_TI_symbol_name("_CTRL06_RSV1")
    5038                      .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5039                      .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    5040                      .dwendtag $C$DW$T$96
    5041              
    5042              $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl06_t_")
    5043                      .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$96)
    5044                      .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    5045              
    5046              $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5047                      .dwattr $C$DW$T$107, DW_AT_name("_DRV_SPI_8305_Ctrl07_t_")
    5048                      .dwattr $C$DW$T$107, DW_AT_byte_size(0x06)
    5049              $C$DW$812       .dwtag  DW_TAG_member
    5050                      .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$98)
    5051                      .dwattr $C$DW$812, DW_AT_name("TVDS")
    5052                      .dwattr $C$DW$812, DW_AT_TI_symbol_name("_TVDS")
    5053                      .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5054                      .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    5055              $C$DW$813       .dwtag  DW_TAG_member
    5056                      .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$100)
    5057                      .dwattr $C$DW$813, DW_AT_name("TBLANK")
    5058                      .dwattr $C$DW$813, DW_AT_TI_symbol_name("_TBLANK")
    5059                      .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5060                      .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    5061              $C$DW$814       .dwtag  DW_TAG_member
    5062                      .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$102)
    5063                      .dwattr $C$DW$814, DW_AT_name("DEAD_TIME")
    5064                      .dwattr $C$DW$814, DW_AT_TI_symbol_name("_DEAD_TIME")
    5065                      .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5066                      .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$815       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$104)
    5069                      .dwattr $C$DW$815, DW_AT_name("PWM_MODE")
    5070                      .dwattr $C$DW$815, DW_AT_TI_symbol_name("_PWM_MODE")
    5071                      .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    5072                      .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    5073              $C$DW$816       .dwtag  DW_TAG_member
    5074                      .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$106)
    5075                      .dwattr $C$DW$816, DW_AT_name("COMM_OPT")
    5076                      .dwattr $C$DW$816, DW_AT_TI_symbol_name("_COMM_OPT")
    5077                      .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5078                      .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    5079              $C$DW$817       .dwtag  DW_TAG_member
    5080                      .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$71)
    5081                      .dwattr $C$DW$817, DW_AT_name("CTRL07_RSV1")
    5082                      .dwattr $C$DW$817, DW_AT_TI_symbol_name("_CTRL07_RSV1")
    5083                      .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    5084                      .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    5085                      .dwendtag $C$DW$T$107
    5086              
    5087              $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl07_t_")
    5088                      .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$107)
    5089                      .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    5090              
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:15 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0215610                          PAGE  100

    5091              $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5092                      .dwattr $C$DW$T$108, DW_AT_name("_DRV_SPI_8305_Ctrl08_t_")
    5093                      .dwattr $C$DW$T$108, DW_AT_byte_size(0x01)
    5094              $C$DW$818       .dwtag  DW_TAG_member
    5095                      .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$22)
    5096                      .dwattr $C$DW$818, DW_AT_name("CTRL08_RSV1")
    5097                      .dwattr $C$DW$818, DW_AT_TI_symbol_name("_CTRL08_RSV1")
    5098                      .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5099                      .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    5100                      .dwendtag $C$DW$T$108
    5101              
    5102              $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("DRV_SPI_8305_Ctrl08_t_")
    5103                      .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$108)
    5104                      .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    5105              
    5106              $C$DW$T$111     .dwtag  DW_TAG_structure_type
    5107                      .dwattr $C$DW$T$111, DW_AT_name("_DRV_SPI_8305_Ctrl09_t_")
    5108                      .dwattr $C$DW$T$111, DW_AT_byte_size(0x0a)
    5109              $C$DW$819       .dwtag  DW_TAG_member
    5110                      .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$71)
