TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.6 *
       3              ;* Date/Time created: Thu Sep 17 14:11:17 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=softlib --hll_source=on --mem_model:code=flat --mem_model:data=large -
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/motorware/motorware_1_01_00_15/sw/modules/user/src/32b/user.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.6 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Admiral\workspace2_v6_1\proj_lab05a_with_SCI_and_CAP\Flash
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CTRL_setGains")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CTRL_setGains")

    3002              $C$DW$339       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_High"), DW_AT_const_val
    3003              $C$DW$340       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_Low"), DW_AT_const_valu
    3004              $C$DW$341       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_High"), DW_AT
    3005              $C$DW$342       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxCurrentSlope_powerWarp_Low"), DW_AT_
    3006              $C$DW$343       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_High"), DW_AT_const_value(0x54)
    3007              $C$DW$344       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_Low"), DW_AT_const_value(0x55)
    3008              $C$DW$345       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_High"), DW_AT_co
    3009              $C$DW$346       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_indEst_Low"), DW_AT_con
    3010              $C$DW$347       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_High"), DW_AT
    3011              $C$DW$348       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRatedFraction_ratedFlux_Low"), DW_AT_
    3012              $C$DW$349       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_High"), DW_AT_const_value
    3013              $C$DW$350       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_IdRated_delta_Low"), DW_AT_const_value(
    3014              $C$DW$351       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_High"), DW_AT_const_valu
    3015              $C$DW$352       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_fluxEstFreq_Hz_Low"), DW_AT_const_value
    3016              $C$DW$353       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_High"), DW_AT_const_value(0
    3017              $C$DW$354       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlFreq_Hz_Low"), DW_AT_const_value(0x
    3018              $C$DW$355       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_High"), DW_AT_const_value(0x
    3019              $C$DW$356       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_estFreq_Hz_Low"), DW_AT_const_value(0x6
    3020              $C$DW$357       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_High"), DW_AT_const_v
    3021              $C$DW$358       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_RoverL_estFreq_Hz_Low"), DW_AT_const_va
    3022              $C$DW$359       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_High"), DW_AT_const_value(0
    3023              $C$DW$360       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_trajFreq_Hz_Low"), DW_AT_const_value(0x
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   61

    3024              $C$DW$361       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_High"), DW_AT_const_valu
    3025              $C$DW$362       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_ctrlPeriod_sec_Low"), DW_AT_const_value
    3026              $C$DW$363       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_High"), DW_AT_co
    3027              $C$DW$364       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_ErrorCode_maxNegativeIdCurrent_a_Low"), DW_AT_con
    3028              $C$DW$365       .dwtag  DW_TAG_enumerator, DW_AT_name("USER_numErrorCodes"), DW_AT_const_value(0x6a)
    3029                      .dwendtag $C$DW$T$74
    3030              
    3031              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("USER_ErrorCode_e")
    3032                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3033                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3034              $C$DW$366       .dwtag  DW_TAG_TI_far_type
    3035                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$75)
    3036              $C$DW$T$77      .dwtag  DW_TAG_const_type
    3037                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$366)
    3038              
    3039              $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
    3040                      .dwattr $C$DW$T$82, DW_AT_byte_size(0x01)
    3041              $C$DW$367       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_spd"), DW_AT_const_value(0x00)
    3042              $C$DW$368       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Id"), DW_AT_const_value(0x01)
    3043              $C$DW$369       .dwtag  DW_TAG_enumerator, DW_AT_name("CTRL_Type_PID_Iq"), DW_AT_const_value(0x02)
    3044                      .dwendtag $C$DW$T$82
    3045              
    3046              $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Type_e")
    3047                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3048                      .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3049              $C$DW$370       .dwtag  DW_TAG_TI_far_type
    3050                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$83)
    3051              $C$DW$T$84      .dwtag  DW_TAG_const_type
    3052                      .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$370)
    3053              
    3054              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3055                      .dwattr $C$DW$T$23, DW_AT_name("_CLARKE_Obj_")
    3056                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    3057              $C$DW$371       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$20)
    3059                      .dwattr $C$DW$371, DW_AT_name("alpha_sf")
    3060                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_alpha_sf")
    3061                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3062                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3063              $C$DW$372       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$20)
    3065                      .dwattr $C$DW$372, DW_AT_name("beta_sf")
    3066                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_beta_sf")
    3067                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3068                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3069              $C$DW$373       .dwtag  DW_TAG_member
    3070                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$22)
    3071                      .dwattr $C$DW$373, DW_AT_name("numSensors")
    3072                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_numSensors")
    3073                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3074                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3075                      .dwendtag $C$DW$T$23
    3076              
    3077              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Obj")
    3078                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   62

    3079                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3080              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3081                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$23)
    3082                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3083              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE_Handle")
    3084                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    3085                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3086              
    3087              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3088                      .dwattr $C$DW$T$57, DW_AT_name("_CTRL_Obj_")
    3089                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x108)
    3090              $C$DW$374       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$24)
    3092                      .dwattr $C$DW$374, DW_AT_name("version")
    3093                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_version")
    3094                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3095                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$375       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$26)
    3098                      .dwattr $C$DW$375, DW_AT_name("state")
    3099                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_state")
    3100                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3101                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$376       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$26)
    3104                      .dwattr $C$DW$376, DW_AT_name("prevState")
    3105                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_prevState")
    3106                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3107                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3108              $C$DW$377       .dwtag  DW_TAG_member
    3109                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$28)
    3110                      .dwattr $C$DW$377, DW_AT_name("errorCode")
    3111                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_errorCode")
    3112                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3113                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3114              $C$DW$378       .dwtag  DW_TAG_member
    3115                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$30)
    3116                      .dwattr $C$DW$378, DW_AT_name("clarkeHandle_I")
    3117                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_clarkeHandle_I")
    3118                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3119                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$379       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$31)
    3122                      .dwattr $C$DW$379, DW_AT_name("clarke_I")
    3123                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_clarke_I")
    3124                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3125                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$380       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$30)
    3128                      .dwattr $C$DW$380, DW_AT_name("clarkeHandle_V")
    3129                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_clarkeHandle_V")
    3130                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3131                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$381       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   63

    3134                      .dwattr $C$DW$381, DW_AT_name("clarke_V")
    3135                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_clarke_V")
    3136                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3137                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$382       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$33)
    3140                      .dwattr $C$DW$382, DW_AT_name("estHandle")
    3141                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_estHandle")
    3142                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3143                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$383       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$35)
    3146                      .dwattr $C$DW$383, DW_AT_name("parkHandle")
    3147                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_parkHandle")
    3148                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3149                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$384       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$36)
    3152                      .dwattr $C$DW$384, DW_AT_name("park")
    3153                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_park")
    3154                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3155                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$385       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$38)
    3158                      .dwattr $C$DW$385, DW_AT_name("pidHandle_Id")
    3159                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_pidHandle_Id")
    3160                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3161                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$386       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$39)
    3164                      .dwattr $C$DW$386, DW_AT_name("pid_Id")
    3165                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_pid_Id")
    3166                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3167                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    3168              $C$DW$387       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$38)
    3170                      .dwattr $C$DW$387, DW_AT_name("pidHandle_Iq")
    3171                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_pidHandle_Iq")
    3172                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3173                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$388       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$39)
    3176                      .dwattr $C$DW$388, DW_AT_name("pid_Iq")
    3177                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_pid_Iq")
    3178                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3179                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    3180              $C$DW$389       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$38)
    3182                      .dwattr $C$DW$389, DW_AT_name("pidHandle_spd")
    3183                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_pidHandle_spd")
    3184                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3185                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$390       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$39)
    3188                      .dwattr $C$DW$390, DW_AT_name("pid_spd")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   64

    3189                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_pid_spd")
    3190                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3191                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$391       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$41)
    3194                      .dwattr $C$DW$391, DW_AT_name("iparkHandle")
    3195                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_iparkHandle")
    3196                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    3197                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$392       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$42)
    3200                      .dwattr $C$DW$392, DW_AT_name("ipark")
    3201                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_ipark")
    3202                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3203                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$393       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$44)
    3206                      .dwattr $C$DW$393, DW_AT_name("svgenHandle")
    3207                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_svgenHandle")
    3208                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3209                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$394       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$45)
    3212                      .dwattr $C$DW$394, DW_AT_name("svgen")
    3213                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_svgen")
    3214                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    3215                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$395       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$47)
    3218                      .dwattr $C$DW$395, DW_AT_name("trajHandle_Id")
    3219                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_trajHandle_Id")
    3220                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3221                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$396       .dwtag  DW_TAG_member
    3223                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$48)
    3224                      .dwattr $C$DW$396, DW_AT_name("traj_Id")
    3225                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_traj_Id")
    3226                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    3227                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    3228              $C$DW$397       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$47)
    3230                      .dwattr $C$DW$397, DW_AT_name("trajHandle_spd")
    3231                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_trajHandle_spd")
    3232                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3233                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    3234              $C$DW$398       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$48)
    3236                      .dwattr $C$DW$398, DW_AT_name("traj_spd")
    3237                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_traj_spd")
    3238                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    3239                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    3240              $C$DW$399       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$47)
    3242                      .dwattr $C$DW$399, DW_AT_name("trajHandle_spdMax")
    3243                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_trajHandle_spdMax")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   65

    3244                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3245                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$400       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$48)
    3248                      .dwattr $C$DW$400, DW_AT_name("traj_spdMax")
    3249                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_traj_spdMax")
    3250                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3251                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$401       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$49)
    3254                      .dwattr $C$DW$401, DW_AT_name("motorParams")
    3255                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_motorParams")
    3256                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    3257                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    3258              $C$DW$402       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$52)
    3260                      .dwattr $C$DW$402, DW_AT_name("waitTimes")
    3261                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_waitTimes")
    3262                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    3263                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    3264              $C$DW$403       .dwtag  DW_TAG_member
    3265                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$51)
    3266                      .dwattr $C$DW$403, DW_AT_name("counter_state")
    3267                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_counter_state")
    3268                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    3269                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    3270              $C$DW$404       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$53)
    3272                      .dwattr $C$DW$404, DW_AT_name("numIsrTicksPerCtrlTick")
    3273                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3274                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    3275                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    3276              $C$DW$405       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$53)
    3278                      .dwattr $C$DW$405, DW_AT_name("numCtrlTicksPerCurrentTick")
    3279                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3280                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x9d]
    3281                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    3282              $C$DW$406       .dwtag  DW_TAG_member
    3283                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$53)
    3284                      .dwattr $C$DW$406, DW_AT_name("numCtrlTicksPerSpeedTick")
    3285                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3286                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    3287                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$407       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$53)
    3290                      .dwattr $C$DW$407, DW_AT_name("numCtrlTicksPerTrajTick")
    3291                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3292                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x9f]
    3293                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$408       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$51)
    3296                      .dwattr $C$DW$408, DW_AT_name("ctrlFreq_Hz")
    3297                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ctrlFreq_Hz")
    3298                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   66

    3299                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    3300              $C$DW$409       .dwtag  DW_TAG_member
    3301                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$51)
    3302                      .dwattr $C$DW$409, DW_AT_name("trajFreq_Hz")
    3303                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_trajFreq_Hz")
    3304                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    3305                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    3306              $C$DW$410       .dwtag  DW_TAG_member
    3307                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$20)
    3308                      .dwattr $C$DW$410, DW_AT_name("trajPeriod_sec")
    3309                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_trajPeriod_sec")
    3310                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    3311                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    3312              $C$DW$411       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$54)
    3314                      .dwattr $C$DW$411, DW_AT_name("ctrlPeriod_sec")
    3315                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ctrlPeriod_sec")
    3316                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    3317                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    3318              $C$DW$412       .dwtag  DW_TAG_member
    3319                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$20)
    3320                      .dwattr $C$DW$412, DW_AT_name("maxVsMag_pu")
    3321                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_maxVsMag_pu")
    3322                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    3323                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    3324              $C$DW$413       .dwtag  DW_TAG_member
    3325                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$55)
    3326                      .dwattr $C$DW$413, DW_AT_name("Iab_in")
    3327                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Iab_in")
    3328                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    3329                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$414       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$55)
    3332                      .dwattr $C$DW$414, DW_AT_name("Iab_filt")
    3333                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Iab_filt")
    3334                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    3335                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    3336              $C$DW$415       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$55)
    3338                      .dwattr $C$DW$415, DW_AT_name("Idq_in")
    3339                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_Idq_in")
    3340                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    3341                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    3342              $C$DW$416       .dwtag  DW_TAG_member
    3343                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$55)
    3344                      .dwattr $C$DW$416, DW_AT_name("Vab_in")
    3345                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_Vab_in")
    3346                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    3347                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    3348              $C$DW$417       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$20)
    3350                      .dwattr $C$DW$417, DW_AT_name("spd_out")
    3351                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_spd_out")
    3352                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    3353                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   67

    3354              $C$DW$418       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$55)
    3356                      .dwattr $C$DW$418, DW_AT_name("Vab_out")
    3357                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Vab_out")
    3358                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    3359                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    3360              $C$DW$419       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$55)
    3362                      .dwattr $C$DW$419, DW_AT_name("Vdq_out")
    3363                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Vdq_out")
    3364                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    3365                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    3366              $C$DW$420       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$54)
    3368                      .dwattr $C$DW$420, DW_AT_name("Rhf")
    3369                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Rhf")
    3370                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    3371                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$421       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$54)
    3374                      .dwattr $C$DW$421, DW_AT_name("Lhf")
    3375                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Lhf")
    3376                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    3377                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    3378              $C$DW$422       .dwtag  DW_TAG_member
    3379                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$54)
    3380                      .dwattr $C$DW$422, DW_AT_name("RoverL")
    3381                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_RoverL")
    3382                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    3383                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    3384              $C$DW$423       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    3386                      .dwattr $C$DW$423, DW_AT_name("Kp_Id")
    3387                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Kp_Id")
    3388                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    3389                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    3390              $C$DW$424       .dwtag  DW_TAG_member
    3391                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$20)
    3392                      .dwattr $C$DW$424, DW_AT_name("Kp_Iq")
    3393                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_Kp_Iq")
    3394                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3395                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    3396              $C$DW$425       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$20)
    3398                      .dwattr $C$DW$425, DW_AT_name("Kp_spd")
    3399                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_Kp_spd")
    3400                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    3401                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    3402              $C$DW$426       .dwtag  DW_TAG_member
    3403                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    3404                      .dwattr $C$DW$426, DW_AT_name("Ki_Id")
    3405                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_Ki_Id")
    3406                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    3407                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$427       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   68

    3409                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    3410                      .dwattr $C$DW$427, DW_AT_name("Ki_Iq")
    3411                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_Ki_Iq")
    3412                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    3413                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$428       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$20)
    3416                      .dwattr $C$DW$428, DW_AT_name("Ki_spd")
    3417                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_Ki_spd")
    3418                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3419                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    3420              $C$DW$429       .dwtag  DW_TAG_member
    3421                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$20)
    3422                      .dwattr $C$DW$429, DW_AT_name("Kd_Id")
    3423                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_Kd_Id")
    3424                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    3425                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$430       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$20)
    3428                      .dwattr $C$DW$430, DW_AT_name("Kd_Iq")
    3429                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_Kd_Iq")
    3430                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    3431                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    3432              $C$DW$431       .dwtag  DW_TAG_member
    3433                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$20)
    3434                      .dwattr $C$DW$431, DW_AT_name("Kd_spd")
    3435                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_Kd_spd")
    3436                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    3437                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    3438              $C$DW$432       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$20)
    3440                      .dwattr $C$DW$432, DW_AT_name("Ui_Id")
    3441                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_Ui_Id")
    3442                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3443                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$433       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$20)
    3446                      .dwattr $C$DW$433, DW_AT_name("Ui_Iq")
    3447                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_Ui_Iq")
    3448                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    3449                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$434       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$20)
    3452                      .dwattr $C$DW$434, DW_AT_name("Ui_spd")
    3453                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_Ui_spd")
    3454                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    3455                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$435       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$55)
    3458                      .dwattr $C$DW$435, DW_AT_name("Idq_ref")
    3459                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Idq_ref")
    3460                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    3461                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$436       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   69

    3464                      .dwattr $C$DW$436, DW_AT_name("IdRated")
    3465                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_IdRated")
    3466                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    3467                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$437       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$20)
    3470                      .dwattr $C$DW$437, DW_AT_name("spd_ref")
    3471                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_spd_ref")
    3472                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    3473                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$438       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$20)
    3476                      .dwattr $C$DW$438, DW_AT_name("spd_max")
    3477                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_spd_max")
    3478                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    3479                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    3480              $C$DW$439       .dwtag  DW_TAG_member
    3481                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$53)
    3482                      .dwattr $C$DW$439, DW_AT_name("counter_current")
    3483                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_counter_current")
    3484                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    3485                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    3486              $C$DW$440       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$53)
    3488                      .dwattr $C$DW$440, DW_AT_name("counter_isr")
    3489                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_counter_isr")
    3490                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xed]
    3491                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$441       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$53)
    3494                      .dwattr $C$DW$441, DW_AT_name("counter_speed")
    3495                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_counter_speed")
    3496                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    3497                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    3498              $C$DW$442       .dwtag  DW_TAG_member
    3499                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$53)
    3500                      .dwattr $C$DW$442, DW_AT_name("counter_traj")
    3501                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_counter_traj")
    3502                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    3503                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$443       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$56)
    3506                      .dwattr $C$DW$443, DW_AT_name("flag_enableCtrl")
    3507                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_flag_enableCtrl")
    3508                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    3509                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$444       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$56)
    3512                      .dwattr $C$DW$444, DW_AT_name("flag_enableDcBusComp")
    3513                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_flag_enableDcBusComp")
    3514                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0xf1]
    3515                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$445       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$56)
    3518                      .dwattr $C$DW$445, DW_AT_name("flag_enablePowerWarp")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   70

    3519                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_flag_enablePowerWarp")
    3520                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    3521                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    3522              $C$DW$446       .dwtag  DW_TAG_member
    3523                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$56)
    3524                      .dwattr $C$DW$446, DW_AT_name("flag_enableOffset")
    3525                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_flag_enableOffset")
    3526                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xf3]
    3527                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    3528              $C$DW$447       .dwtag  DW_TAG_member
    3529                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    3530                      .dwattr $C$DW$447, DW_AT_name("flag_enableSpeedCtrl")
    3531                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_flag_enableSpeedCtrl")
    3532                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    3533                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    3534              $C$DW$448       .dwtag  DW_TAG_member
    3535                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$56)
    3536                      .dwattr $C$DW$448, DW_AT_name("flag_enableUserMotorParams")
    3537                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_flag_enableUserMotorParams")
    3538                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xf5]
    3539                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    3540              $C$DW$449       .dwtag  DW_TAG_member
    3541                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
    3542                      .dwattr $C$DW$449, DW_AT_name("Idq_offset_pu")
    3543                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_Idq_offset_pu")
    3544                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    3545                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$450       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$55)
    3548                      .dwattr $C$DW$450, DW_AT_name("Vdq_offset_pu")
    3549                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_Vdq_offset_pu")
    3550                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    3551                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$451       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$20)
    3554                      .dwattr $C$DW$451, DW_AT_name("angle_pu")
    3555                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_angle_pu")
    3556                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    3557                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$452       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$20)
    3560                      .dwattr $C$DW$452, DW_AT_name("speed_ref_pu")
    3561                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_speed_ref_pu")
    3562                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    3563                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    3564              $C$DW$453       .dwtag  DW_TAG_member
    3565                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$20)
    3566                      .dwattr $C$DW$453, DW_AT_name("speed_fb_pu")
    3567                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_speed_fb_pu")
    3568                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
    3569                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$454       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$20)
    3572                      .dwattr $C$DW$454, DW_AT_name("speed_outMax_pu")
    3573                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_speed_outMax_pu")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   71

    3574                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3575                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    3576              $C$DW$455       .dwtag  DW_TAG_member
    3577                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$56)
    3578                      .dwattr $C$DW$455, DW_AT_name("flag_enableCurrentCtrl")
    3579                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_flag_enableCurrentCtrl")
    3580                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
    3581                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    3582                      .dwendtag $C$DW$T$57
    3583              
    3584              $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Obj")
    3585                      .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$57)
    3586                      .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3587              $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3588                      .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$57)
    3589                      .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3590              $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Handle")
    3591                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    3592                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3593              $C$DW$456       .dwtag  DW_TAG_TI_far_type
    3594                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$87)
    3595              $C$DW$T$88      .dwtag  DW_TAG_const_type
    3596                      .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$456)
    3597              
    3598              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3599                      .dwattr $C$DW$T$60, DW_AT_name("_CTRL_Version_")
    3600                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
    3601              $C$DW$457       .dwtag  DW_TAG_member
    3602                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$21)
    3603                      .dwattr $C$DW$457, DW_AT_name("rsvd")
    3604                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsvd")
    3605                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3606                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    3607              $C$DW$458       .dwtag  DW_TAG_member
    3608                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$59)
    3609                      .dwattr $C$DW$458, DW_AT_name("targetProc")
    3610                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_targetProc")
    3611                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3612                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    3613              $C$DW$459       .dwtag  DW_TAG_member
    3614                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$21)
    3615                      .dwattr $C$DW$459, DW_AT_name("major")
    3616                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_major")
    3617                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3618                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    3619              $C$DW$460       .dwtag  DW_TAG_member
    3620                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$21)
    3621                      .dwattr $C$DW$460, DW_AT_name("minor")
    3622                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_minor")
    3623                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3624                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    3625                      .dwendtag $C$DW$T$60
    3626              
    3627              $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("CTRL_Version")
    3628                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$60)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   72

    3629                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3630              
    3631              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    3632                      .dwattr $C$DW$T$19, DW_AT_name("_EST_Obj_")
    3633                      .dwattr $C$DW$T$19, DW_AT_declaration
    3634                      .dwendtag $C$DW$T$19
    3635              
    3636              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3637                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$19)
    3638                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3639              $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("EST_Handle")
    3640                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3641                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3642              
    3643              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3644                      .dwattr $C$DW$T$61, DW_AT_name("_IPARK_Obj_")
    3645                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
    3646              $C$DW$461       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$20)
    3648                      .dwattr $C$DW$461, DW_AT_name("sinTh")
    3649                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_sinTh")
    3650                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3651                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    3652              $C$DW$462       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$20)
    3654                      .dwattr $C$DW$462, DW_AT_name("cosTh")
    3655                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_cosTh")
    3656                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3657                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    3658                      .dwendtag $C$DW$T$61
    3659              
    3660              $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Obj")
    3661                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$61)
    3662                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3663              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3664                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$61)
    3665                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3666              $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK_Handle")
    3667                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3668                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3669              
    3670              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3671                      .dwattr $C$DW$T$63, DW_AT_name("_MATH_vec2_")
    3672                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
    3673              $C$DW$463       .dwtag  DW_TAG_member
    3674                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$62)
    3675                      .dwattr $C$DW$463, DW_AT_name("value")
    3676                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_value")
    3677                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3678                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    3679                      .dwendtag $C$DW$T$63
    3680              
    3681              $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("MATH_vec2")
    3682                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$63)
    3683                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   73

    3684              
    3685              $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3686                      .dwattr $C$DW$T$66, DW_AT_name("_MOTOR_Params_")
    3687                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x0e)
    3688              $C$DW$464       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$65)
    3690                      .dwattr $C$DW$464, DW_AT_name("type")
    3691                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_type")
    3692                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3693                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$465       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$53)
    3696                      .dwattr $C$DW$465, DW_AT_name("numPolePairs")
    3697                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_numPolePairs")
    3698                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3699                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$466       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$54)
    3702                      .dwattr $C$DW$466, DW_AT_name("Lr_H")
    3703                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Lr_H")
    3704                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3705                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$467       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$54)
    3708                      .dwattr $C$DW$467, DW_AT_name("Ls_d_H")
    3709                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Ls_d_H")
    3710                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3711                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$468       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    3714                      .dwattr $C$DW$468, DW_AT_name("Ls_q_H")
    3715                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_Ls_q_H")
    3716                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3717                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$469       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$54)
    3720                      .dwattr $C$DW$469, DW_AT_name("Rr_Ohm")
    3721                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_Rr_Ohm")
    3722                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3723                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$470       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    3726                      .dwattr $C$DW$470, DW_AT_name("Rs_Ohm")
    3727                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_Rs_Ohm")
    3728                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3729                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$471       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$54)
    3732                      .dwattr $C$DW$471, DW_AT_name("ratedFlux_VpHz")
    3733                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ratedFlux_VpHz")
    3734                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3735                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    3736                      .dwendtag $C$DW$T$66
    3737              
    3738              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("MOTOR_Params")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   74

    3739                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$66)
    3740                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3741              
    3742              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3743                      .dwattr $C$DW$T$67, DW_AT_name("_PARK_Obj_")
    3744                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
    3745              $C$DW$472       .dwtag  DW_TAG_member
    3746                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$20)
    3747                      .dwattr $C$DW$472, DW_AT_name("sinTh")
    3748                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_sinTh")
    3749                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3750                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$473       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$20)
    3753                      .dwattr $C$DW$473, DW_AT_name("cosTh")
    3754                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_cosTh")
    3755                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3756                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    3757                      .dwendtag $C$DW$T$67
    3758              
    3759              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Obj")
    3760                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$67)
    3761                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3762              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3763                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$67)
    3764                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3765              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("PARK_Handle")
    3766                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3767                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3768              
    3769              $C$DW$T$68      .dwtag  DW_TAG_structure_type
    3770                      .dwattr $C$DW$T$68, DW_AT_name("_PID_Obj_")
    3771                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
    3772              $C$DW$474       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$20)
    3774                      .dwattr $C$DW$474, DW_AT_name("Kp")
    3775                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_Kp")
    3776                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3777                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$475       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$20)
    3780                      .dwattr $C$DW$475, DW_AT_name("Ki")
    3781                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_Ki")
    3782                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3783                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$476       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$20)
    3786                      .dwattr $C$DW$476, DW_AT_name("Kd")
    3787                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_Kd")
    3788                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3789                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$477       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$20)
    3792                      .dwattr $C$DW$477, DW_AT_name("Ui")
    3793                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_Ui")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   75

    3794                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3795                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$478       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$20)
    3798                      .dwattr $C$DW$478, DW_AT_name("refValue")
    3799                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_refValue")
    3800                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3801                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$479       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$20)
    3804                      .dwattr $C$DW$479, DW_AT_name("fbackValue")
    3805                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_fbackValue")
    3806                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3807                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    3808              $C$DW$480       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$20)
    3810                      .dwattr $C$DW$480, DW_AT_name("outMin")
    3811                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_outMin")
    3812                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3813                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    3814              $C$DW$481       .dwtag  DW_TAG_member
    3815                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$20)
    3816                      .dwattr $C$DW$481, DW_AT_name("outMax")
    3817                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_outMax")
    3818                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3819                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    3820                      .dwendtag $C$DW$T$68
    3821              
    3822              $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Obj")
    3823                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$68)
    3824                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3825              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3826                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$68)
    3827                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3828              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("PID_Handle")
    3829                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3830                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3831              
    3832              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3833                      .dwattr $C$DW$T$69, DW_AT_name("_SVGEN_Obj_")
    3834                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x02)
    3835              $C$DW$482       .dwtag  DW_TAG_member
    3836                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$20)
    3837                      .dwattr $C$DW$482, DW_AT_name("maxModulation")
    3838                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_maxModulation")
    3839                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3840                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    3841                      .dwendtag $C$DW$T$69
    3842              
    3843              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Obj")
    3844                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$69)
    3845                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3846              $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3847                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$69)
    3848                      .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   76

    3849              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN_Handle")
    3850                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3851                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3852              
    3853              $C$DW$T$70      .dwtag  DW_TAG_structure_type
    3854                      .dwattr $C$DW$T$70, DW_AT_name("_TRAJ_Obj_")
    3855                      .dwattr $C$DW$T$70, DW_AT_byte_size(0x0a)
    3856              $C$DW$483       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$20)
    3858                      .dwattr $C$DW$483, DW_AT_name("targetValue")
    3859                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_targetValue")
    3860                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$484       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$20)
    3864                      .dwattr $C$DW$484, DW_AT_name("intValue")
    3865                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_intValue")
    3866                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3867                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$485       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$20)
    3870                      .dwattr $C$DW$485, DW_AT_name("minValue")
    3871                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_minValue")
    3872                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3873                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$486       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$20)
    3876                      .dwattr $C$DW$486, DW_AT_name("maxValue")
    3877                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_maxValue")
    3878                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3879                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$487       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$20)
    3882                      .dwattr $C$DW$487, DW_AT_name("maxDelta")
    3883                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_maxDelta")
    3884                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3885                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    3886                      .dwendtag $C$DW$T$70
    3887              
    3888              $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Obj")
    3889                      .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$70)
    3890                      .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3891              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3892                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$70)
    3893                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3894              $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("TRAJ_Handle")
    3895                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3896                      .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3897              
    3898              $C$DW$T$76      .dwtag  DW_TAG_structure_type
    3899                      .dwattr $C$DW$T$76, DW_AT_name("_USER_Params_")
    3900                      .dwattr $C$DW$T$76, DW_AT_byte_size(0xac)
    3901              $C$DW$488       .dwtag  DW_TAG_member
    3902                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$54)
    3903                      .dwattr $C$DW$488, DW_AT_name("iqFullScaleCurrent_A")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   77

    3904                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_iqFullScaleCurrent_A")
    3905                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3906                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    3907              $C$DW$489       .dwtag  DW_TAG_member
    3908                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$54)
    3909                      .dwattr $C$DW$489, DW_AT_name("iqFullScaleVoltage_V")
    3910                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_iqFullScaleVoltage_V")
    3911                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3912                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    3913              $C$DW$490       .dwtag  DW_TAG_member
    3914                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$54)
    3915                      .dwattr $C$DW$490, DW_AT_name("iqFullScaleFreq_Hz")
    3916                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_iqFullScaleFreq_Hz")
    3917                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3918                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    3919              $C$DW$491       .dwtag  DW_TAG_member
    3920                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$53)
    3921                      .dwattr $C$DW$491, DW_AT_name("numIsrTicksPerCtrlTick")
    3922                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_numIsrTicksPerCtrlTick")
    3923                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3924                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$492       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$53)
    3927                      .dwattr $C$DW$492, DW_AT_name("numCtrlTicksPerCurrentTick")
    3928                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_numCtrlTicksPerCurrentTick")
    3929                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3930                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    3931              $C$DW$493       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$53)
    3933                      .dwattr $C$DW$493, DW_AT_name("numCtrlTicksPerEstTick")
    3934                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_numCtrlTicksPerEstTick")
    3935                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3936                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    3937              $C$DW$494       .dwtag  DW_TAG_member
    3938                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$53)
    3939                      .dwattr $C$DW$494, DW_AT_name("numCtrlTicksPerSpeedTick")
    3940                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_numCtrlTicksPerSpeedTick")
    3941                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3942                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    3943              $C$DW$495       .dwtag  DW_TAG_member
    3944                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$53)
    3945                      .dwattr $C$DW$495, DW_AT_name("numCtrlTicksPerTrajTick")
    3946                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_numCtrlTicksPerTrajTick")
    3947                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3948                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$496       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
    3951                      .dwattr $C$DW$496, DW_AT_name("numCurrentSensors")
    3952                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_numCurrentSensors")
    3953                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3954                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    3955              $C$DW$497       .dwtag  DW_TAG_member
    3956                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
    3957                      .dwattr $C$DW$497, DW_AT_name("numVoltageSensors")
    3958                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_numVoltageSensors")
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   78

    3959                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3960                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    3961              $C$DW$498       .dwtag  DW_TAG_member
    3962                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$54)
    3963                      .dwattr $C$DW$498, DW_AT_name("offsetPole_rps")
    3964                      .dwattr $C$DW$498, DW_AT_TI_symbol_name("_offsetPole_rps")
    3965                      .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3966                      .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$499       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$54)
    3969                      .dwattr $C$DW$499, DW_AT_name("fluxPole_rps")
    3970                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_fluxPole_rps")
    3971                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3972                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    3973              $C$DW$500       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$54)
    3975                      .dwattr $C$DW$500, DW_AT_name("zeroSpeedLimit")
    3976                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_zeroSpeedLimit")
    3977                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3978                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    3979              $C$DW$501       .dwtag  DW_TAG_member
    3980                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$54)
    3981                      .dwattr $C$DW$501, DW_AT_name("forceAngleFreq_Hz")
    3982                      .dwattr $C$DW$501, DW_AT_TI_symbol_name("_forceAngleFreq_Hz")
    3983                      .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3984                      .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    3985              $C$DW$502       .dwtag  DW_TAG_member
    3986                      .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$54)
    3987                      .dwattr $C$DW$502, DW_AT_name("maxAccel_Hzps")
    3988                      .dwattr $C$DW$502, DW_AT_TI_symbol_name("_maxAccel_Hzps")
    3989                      .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3990                      .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    3991              $C$DW$503       .dwtag  DW_TAG_member
    3992                      .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$54)
    3993                      .dwattr $C$DW$503, DW_AT_name("maxAccel_est_Hzps")
    3994                      .dwattr $C$DW$503, DW_AT_TI_symbol_name("_maxAccel_est_Hzps")
    3995                      .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3996                      .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    3997              $C$DW$504       .dwtag  DW_TAG_member
    3998                      .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$54)
    3999                      .dwattr $C$DW$504, DW_AT_name("directionPole_rps")
    4000                      .dwattr $C$DW$504, DW_AT_TI_symbol_name("_directionPole_rps")
    4001                      .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4002                      .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    4003              $C$DW$505       .dwtag  DW_TAG_member
    4004                      .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$54)
    4005                      .dwattr $C$DW$505, DW_AT_name("speedPole_rps")
    4006                      .dwattr $C$DW$505, DW_AT_TI_symbol_name("_speedPole_rps")
    4007                      .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4008                      .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$506       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$54)
    4011                      .dwattr $C$DW$506, DW_AT_name("dcBusPole_rps")
    4012                      .dwattr $C$DW$506, DW_AT_TI_symbol_name("_dcBusPole_rps")
    4013                      .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   79

    4014                      .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    4015              $C$DW$507       .dwtag  DW_TAG_member
    4016                      .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$54)
    4017                      .dwattr $C$DW$507, DW_AT_name("fluxFraction")
    4018                      .dwattr $C$DW$507, DW_AT_TI_symbol_name("_fluxFraction")
    4019                      .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4020                      .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    4021              $C$DW$508       .dwtag  DW_TAG_member
    4022                      .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$54)
    4023                      .dwattr $C$DW$508, DW_AT_name("indEst_speedMaxFraction")
    4024                      .dwattr $C$DW$508, DW_AT_TI_symbol_name("_indEst_speedMaxFraction")
    4025                      .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4026                      .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    4027              $C$DW$509       .dwtag  DW_TAG_member
    4028                      .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$54)
    4029                      .dwattr $C$DW$509, DW_AT_name("powerWarpGain")
    4030                      .dwattr $C$DW$509, DW_AT_TI_symbol_name("_powerWarpGain")
    4031                      .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4032                      .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    4033              $C$DW$510       .dwtag  DW_TAG_member
    4034                      .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$53)
    4035                      .dwattr $C$DW$510, DW_AT_name("systemFreq_MHz")
    4036                      .dwattr $C$DW$510, DW_AT_TI_symbol_name("_systemFreq_MHz")
    4037                      .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4038                      .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    4039              $C$DW$511       .dwtag  DW_TAG_member
    4040                      .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$54)
    4041                      .dwattr $C$DW$511, DW_AT_name("pwmPeriod_usec")
    4042                      .dwattr $C$DW$511, DW_AT_TI_symbol_name("_pwmPeriod_usec")
    4043                      .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4044                      .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    4045              $C$DW$512       .dwtag  DW_TAG_member
    4046                      .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$54)
    4047                      .dwattr $C$DW$512, DW_AT_name("voltage_sf")
    4048                      .dwattr $C$DW$512, DW_AT_TI_symbol_name("_voltage_sf")
    4049                      .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4050                      .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    4051              $C$DW$513       .dwtag  DW_TAG_member
    4052                      .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$54)
    4053                      .dwattr $C$DW$513, DW_AT_name("current_sf")
    4054                      .dwattr $C$DW$513, DW_AT_TI_symbol_name("_current_sf")
    4055                      .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4056                      .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    4057              $C$DW$514       .dwtag  DW_TAG_member
    4058                      .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$54)
    4059                      .dwattr $C$DW$514, DW_AT_name("voltageFilterPole_rps")
    4060                      .dwattr $C$DW$514, DW_AT_TI_symbol_name("_voltageFilterPole_rps")
    4061                      .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4062                      .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    4063              $C$DW$515       .dwtag  DW_TAG_member
    4064                      .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$54)
    4065                      .dwattr $C$DW$515, DW_AT_name("maxVsMag_pu")
    4066                      .dwattr $C$DW$515, DW_AT_TI_symbol_name("_maxVsMag_pu")
    4067                      .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4068                      .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   80

    4069              $C$DW$516       .dwtag  DW_TAG_member
    4070                      .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$54)
    4071                      .dwattr $C$DW$516, DW_AT_name("estKappa")
    4072                      .dwattr $C$DW$516, DW_AT_TI_symbol_name("_estKappa")
    4073                      .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4074                      .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$517       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$65)
    4077                      .dwattr $C$DW$517, DW_AT_name("motor_type")
    4078                      .dwattr $C$DW$517, DW_AT_TI_symbol_name("_motor_type")
    4079                      .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4080                      .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    4081              $C$DW$518       .dwtag  DW_TAG_member
    4082                      .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$53)
    4083                      .dwattr $C$DW$518, DW_AT_name("motor_numPolePairs")
    4084                      .dwattr $C$DW$518, DW_AT_TI_symbol_name("_motor_numPolePairs")
    4085                      .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    4086                      .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    4087              $C$DW$519       .dwtag  DW_TAG_member
    4088                      .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$54)
    4089                      .dwattr $C$DW$519, DW_AT_name("motor_ratedFlux")
    4090                      .dwattr $C$DW$519, DW_AT_TI_symbol_name("_motor_ratedFlux")
    4091                      .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    4092                      .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    4093              $C$DW$520       .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$54)
    4095                      .dwattr $C$DW$520, DW_AT_name("motor_Rr")
    4096                      .dwattr $C$DW$520, DW_AT_TI_symbol_name("_motor_Rr")
    4097                      .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4098                      .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$521       .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$54)
    4101                      .dwattr $C$DW$521, DW_AT_name("motor_Rs")
    4102                      .dwattr $C$DW$521, DW_AT_TI_symbol_name("_motor_Rs")
    4103                      .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    4104                      .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    4105              $C$DW$522       .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$54)
    4107                      .dwattr $C$DW$522, DW_AT_name("motor_Ls_d")
    4108                      .dwattr $C$DW$522, DW_AT_TI_symbol_name("_motor_Ls_d")
    4109                      .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4110                      .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$523       .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$54)
    4113                      .dwattr $C$DW$523, DW_AT_name("motor_Ls_q")
    4114                      .dwattr $C$DW$523, DW_AT_TI_symbol_name("_motor_Ls_q")
    4115                      .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4116                      .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$524       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$54)
    4119                      .dwattr $C$DW$524, DW_AT_name("maxCurrent")
    4120                      .dwattr $C$DW$524, DW_AT_TI_symbol_name("_maxCurrent")
    4121                      .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    4122                      .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$525       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   81

    4124                      .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$54)
    4125                      .dwattr $C$DW$525, DW_AT_name("maxCurrent_resEst")
    4126                      .dwattr $C$DW$525, DW_AT_TI_symbol_name("_maxCurrent_resEst")
    4127                      .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    4128                      .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$526       .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$54)
    4131                      .dwattr $C$DW$526, DW_AT_name("maxCurrent_indEst")
    4132                      .dwattr $C$DW$526, DW_AT_TI_symbol_name("_maxCurrent_indEst")
    4133                      .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    4134                      .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$527       .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$54)
    4137                      .dwattr $C$DW$527, DW_AT_name("maxCurrentSlope")
    4138                      .dwattr $C$DW$527, DW_AT_TI_symbol_name("_maxCurrentSlope")
    4139                      .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    4140                      .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$528       .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$54)
    4143                      .dwattr $C$DW$528, DW_AT_name("maxCurrentSlope_powerWarp")
    4144                      .dwattr $C$DW$528, DW_AT_TI_symbol_name("_maxCurrentSlope_powerWarp")
    4145                      .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    4146                      .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$529       .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$54)
    4149                      .dwattr $C$DW$529, DW_AT_name("IdRated")
    4150                      .dwattr $C$DW$529, DW_AT_TI_symbol_name("_IdRated")
    4151                      .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    4152                      .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$530       .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$54)
    4155                      .dwattr $C$DW$530, DW_AT_name("IdRatedFraction_indEst")
    4156                      .dwattr $C$DW$530, DW_AT_TI_symbol_name("_IdRatedFraction_indEst")
    4157                      .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4158                      .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$531       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$54)
    4161                      .dwattr $C$DW$531, DW_AT_name("IdRatedFraction_ratedFlux")
    4162                      .dwattr $C$DW$531, DW_AT_TI_symbol_name("_IdRatedFraction_ratedFlux")
    4163                      .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    4164                      .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$532       .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$54)
    4167                      .dwattr $C$DW$532, DW_AT_name("IdRated_delta")
    4168                      .dwattr $C$DW$532, DW_AT_TI_symbol_name("_IdRated_delta")
    4169                      .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    4170                      .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$533       .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$54)
    4173                      .dwattr $C$DW$533, DW_AT_name("fluxEstFreq_Hz")
    4174                      .dwattr $C$DW$533, DW_AT_TI_symbol_name("_fluxEstFreq_Hz")
    4175                      .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    4176                      .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$534       .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$52)
TMS320C2000 Assembler PC v6.4.6 Thu Sep 17 14:11:18 2015

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
C:\Users\Admiral\AppData\Local\Temp\0092010                          PAGE   82

    4179                      .dwattr $C$DW$534, DW_AT_name("ctrlWaitTime")
    4180                      .dwattr $C$DW$534, DW_AT_TI_symbol_name("_ctrlWaitTime")
    4181                      .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4182                      .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$535       .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$71)
    4185                      .dwattr $C$DW$535, DW_AT_name("estWaitTime")
    4186                      .dwattr $C$DW$535, DW_AT_TI_symbol_name("_estWaitTime")
    4187                      .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4188                      .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
